[{"title":"ECB to reassure EU leaders on bank stability after latest market turbulence","link":"https://in-cyprus.philenews.com/news/international/ecb-to-reassure-eu-leaders-on-bank-stability-after-latest-market-turbulence/","description":"The European Central Bank is likely to reassure European Union leaders on Friday that euro zone banks are safe after market turbulence caused by Swiss and U.S. banks, but call on them to push on with an EU deposit insurance scheme, officials said. EU leaders are meeting for a second day of talks in Brussels to discuss economic issues, including changes to the bloc’s […]","content":"Search Insider Economy ECB to reassure EU leaders on bank stability after latest market turbulence ECB to reassure EU leaders on bank stability after latest market turbulence 46 mins ago File Photo: Illustration Shows Svb (silicon Valley Bank) Logo googletag.cmd.push(function() { googletag.display('div-gpt-ad-1522825278556-0'); }); The Eu ropean Central Bank is likely to reassure Eu ropean Union leaders on Friday that eu ro zone banks are safe after market turbulence caused by Swiss and U.S. banks, but call on them to push on with an EU deposit insurance scheme, officials said. EU leaders are meet ing for a second day of talks in Brussels to discuss economic issues, including changes to the bloc’s fiscal and debt rules, but concern over the impact of the troubles of Credit Suisse and Silicon Valley Bank (SVB) on the EU banking system are likely to dominate the talks, officials said. The collapse of U.S. regional banks SVB and Signature Bank earlier this month prompted a rout in banking stocks as investors feared other ticking bombs in the industry . This spilled over to Credit Suisse Group AG, which led to UBS Group AG to take over the 167-year-old Swiss bank to avert a wider crisis. ECB President Christine Lagarde will present to the leaders the economic and financial stability situation of the 20 countries sharing the eu ro and likely face questions about ECB plans for more interest rate rises to fight inflation. “Christine Lagarde will be reassuring on banks after the Swiss solution,” one official said. “She will ask the leaders to complete their Banking Union and go forward on the Capital Markets Union.” “Her message is likely to be the ECB is determined on monetary policy but data-dependent, no forward guidance. There is no trade-off between financial and price stability goals. The ECB has parallel tools to do both,” the official said. EU DEPOSIT INSURANCE NEEDED TO COMPLETE BANKING UNION EU leaders are likely to get a similar message on banks from the chairman of eu ro zone finance ministers Paschal Donohoe. “He is likely to say that overall banks are in good shape, they have good capital liquidity buffers, although there is no room for complacency as we have seen from the banking turbulence,” a second official said. “He is likely call for continued steady progress on completing the Banking Union, and to say Capital Markets Union is important for competitiveness and more needs to be done.” “ Completing the Banking Union “ is EU code for introducing a Eu ropean Deposit Insurance Scheme (EDIS), the last missing element from the project launched in 2012. The Banking Union is already two-thirds complete. T he EU has set up a single supervision of the eu ro zone’s top banks in the hands of the ECB and a single resolution authority with a special fund to resolve failing lenders. While most EU countries have some form of national insurance that guarantees deposits up to 100,000 eu ros ($108,320.00), there is no EU -wide scheme, nor a way for authorities to cooperate across border if a banking crisis is too much for one country alone. The main opponent of EDIS is Germany, concerned that if deposit guarantees are mutualised at EU level, Berlin could end up paying deposits of failing banks in other countries, like Italy, still burdened with poor credit or investment decisions from years ago. The Capital Markets Union was launched in 2015 to facilitate access to private capital by EU companies, which now mainly depend on bank loans for any financing. Progress has been slow due to differences in tax, insolvency or prospectus laws of the EU ‘s 27 countries. (Reuters) googletag.cmd.push(function() { googletag.display('div-gpt-ad-1545053448854-0'); }); By Annie Charalambous Previous article Tourists to get chance to walk in King Charles’ coronation footsteps Next article Top 10 most-capped players in men’s soccer","pubDate":"2023-03-24 04:56:29","image_url":"https://in-cyprus.philenews.com/wp-content/uploads/2023/03/BANKS-2.jpg","id":"7e183196-c7a7-43d9-b07d-b6fa864170df"},{"title":"Nabil inks pact","link":"https://thehimalayantimes.com/business/nabil-inks-pact","description":"KATHMANDU: Nabil Bank has signed a letter of cooperation with USAID Trade and Competitiveness Activity (TCA) with the common goal to increase availability of finance and access to...","content":"Nabil Bank has signed a letter of cooperation with USAID Trade and Competitiveness Activity (TCA) with the common goal to increase availability of finance and access to financial products and services to micro, small and medium sized enterprises (MSMEs) in a sustainable way. With this cooperation, both parties agree to work to boost in tourism, agriculture and digital services, as per a press statement. Gyanendra Prasad Dhungana, CEO of Nabil Bank and Agnes Luz, chief of party, USAID TCA signed the agreement. This partnership is expected to cross-share organisational strengths, experience, technologies, methodologies, and resources.","pubDate":"2023-03-24 04:21:21","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/03/24/22420.jpg","id":"b9e053fd-4978-4393-a578-c81f7a936714"},{"title":"Samsung Galaxy A34 5G, Galaxy A54 5G","link":"https://thehimalayantimes.com/business/samsung-galaxy-a34-5g-galaxy-a54-5g","description":"KATHMANDU: Samsung has confirmed that new additions to its beloved A-series phones will make their way to Nepal.The all-new Galaxy A34 5G and Galaxy A54 5G have been launched globa...","content":"Samsung has confirmed that new additions to its beloved A-series phones will make their way to Nepal. The all-new Galaxy A34 5G and Galaxy A54 5G have been launched globally and have already garnered quite the attention, especially their triple lens rear camera and the access to flagship features like the Nightography, as per a media release. Both the smartphones have quite an upgrade with their primary lens with the Galaxy A34 5G being equipped with a 48 MP primary camera with 2 MP macro lens and the Galaxy A54 5G getting a 50 MP primary with 5 MP macro lens. Both the phones have 8 MP ultrawide angle lens and have upgraded to 120Hz refresh rate. The phones are incredibly durable too, thanks to specs like its IP67 rated for water and dust resistance and the Corning Gorilla Glass 5 protection and Knox Security.","pubDate":"2023-03-24 04:21:21","image_url":"","id":"57cfe00a-7932-49f4-9eba-ab137cc62e47"},{"title":"PET Collection Bins","link":"https://thehimalayantimes.com/business/pet-collection-bins","description":"KATHMANDU: On the occasion of World Recycling Day, Coca-Cola in Nepal and Doko Recyclers have announced the placement of 15 informative PET Collection Bins across Kathmandu valley...","content":"On the occasion of World Recycling Day, Coca-Cola in Nepal and Doko Recyclers have announced the placement of 15 informative PET Collection Bins across Kathmandu valley and Bharatpur. This initiative is a second phase of the joint project 'Refresh and Recycle' which initially commenced in August 2020 with the support of local authorities, as per a press statement. The 'Refresh and Recycle' project is a PET bottle collection campaign which aims to raise awareness and educate communities about giving new life to PET bottles through a recycling process. The bins will be placed in populous areas where PET bottles are frequently disposed across nine locations in Kathmandu and six locations in Bharatapur. Through this initiative, consumers are encouraged to discard their PET bottles after usage in the PET collection bins whenever they are in any of these locations. It is also important for consumers to ensure the bottles are empty, clean and preferably crushed before disposal.","pubDate":"2023-03-24 04:21:21","image_url":"","id":"6d7ba022-ec7d-45aa-b235-789d81331999"},{"title":"Private sector to operate and manage Birgunj ICP from April","link":"https://thehimalayantimes.com/business/private-sector-to-operate-and-manage-birgunj-icp-from-april","description":"Kathmandu, March 23The management committee of Birgunj Integrated Check Post (ICP) has awarded the contract to a private sector company to operate its terminal including dry port,...","content":"The management committee of Birgunj Integrated Check Post (ICP) has awarded the contract to a private sector company to operate its terminal including dry port, integrated check post and container freight station from April 1. Kailasha Terminals JV (a joint venture of Bindabasini Logistics Pvt Ltd of Nepal, and TRS Lift and Shift Services Pvt Ltd and Apeejay Shipping Ltd of India) has been selected for the operation and management of the ICP with the highest score in the evaluation process. As per the legal provision, TRS Himalayan Logipark Pvt Ltd has been registered and its official representative Madhav Prasad Baral and Deputy Director of Nepal Intermodal Transport Develop-ment Board Harekrishna Mishra signed a five-year agreement on March 20 for the operation and management of the ICP. The Executive Director of NITDB Ashish Gajurel, other employees of the board and representatives of TRS Himalayan Logipark Pvt Ltd were also present in the signing programme. According to the contract, for operating and managing the integrated check post, the company will pay the minimum lease recovery amount of nearly Rs 1.81 billion for five years. In addition, if the number of vehicles is more than that projected by the NITDB, the company will also pay the additional amount for additional vehicles at the rate mentioned in the contract. The board will remain as the regulatory body whereas the selected company will operate and manage the ICP as per the conditions and service level mentioned in the contract. The committee believes that after the operation and management of the integrated check post by the private sector, there will be more agility in the business through the check post and it will also be more economical from the point of view of cost. The management committee had sought international level bids from qualified private sector companies to operate the Birgunj ICP on July 27, 2022. There were altogether five qualified bidders - Highway-Atlas-EFC JV from Kathmandu; Pristine Interstate JV from New Delhi, India; TransNepal Freight Services Pvt Ltd from Biratnagar; SS Terminals JV from Kathmandu; and Kailasha Terminals JV from Kathmandu.","pubDate":"2023-03-24 04:21:21","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/03/24/22418.jpg","id":"bf2d6ae4-68d6-4f93-90ed-99e23c9611d8"},{"title":"NLIC&amp;#039;s new scheme","link":"https://thehimalayantimes.com/business/nlics-new-scheme","description":"Nepal Life Insurance Company (NLIC) has announced Nepal Life Sunaulo Bhavishya Jeevan Beema Scheme. The company’s Deputy Chief Executive Officer Amit Kumar Kayal unveiled the insurance plan amidst a programme held here.","content":"KATHMANDU: Nepal Life Insurance Company (NLIC) has announced Nepal Life Sunaulo Bhavishya Jeevan Beema Scheme. The company's Deputy Chief Executive Officer Amit Kumar Kayal unveiled the insurance plan amidst a programme held here.\n\nThis plan provides savings and protection at the same time at a low premium, as per a press release.\n\nTwo types of benefits can be obtained from this life insurance plan which is term advance payment and whole life insurance (passing on profit) with age of the insured from 18 years to 65 years and the minimum insurance fee payment period will be five years to the maximum of 35 years.\n\nThe minimum sum assured of this scheme is Rs 25,000 and maximum sum assured can be determined based on the source of income.\n\nA version of this article appears in the print on March 24, 2023, of The Himalayan Times.","pubDate":"2023-03-24 04:21:21","image_url":"https://thehimalayantimes.com/theme_himalayantimes/images/no-image.jpg","id":"3e3a7f77-b9e9-4540-b478-94a3e95dc63c"},{"title":"&amp;#039;Economic prosperity not possible without reducing trade deficit&amp;#039;","link":"https://thehimalayantimes.com/business/economic-prosperity-not-possible-without-reducing-trade-deficit","description":"Kathmandu, March 23Deputy Prime Minister and Minister for Physical Infrastructure and Transport, Narayan Kaji Shrestha, has said that the country's economy will not be sustain...","content":"Deputy Prime Minister and Minister for Physical Infrastructure and Transport, Narayan Kaji Shrestha, has said that the country's economy will not be sustainable unless the capital budget is utilised effectively and the trade deficit is reduced. Speaking at the programme organised on the occasion of the ninth annual general meeting (AGM) of the Nepal-Italy Chamber of Commerce and Industry (NICCI) here today, Minister Shrestha reasoned that no matter how many slogans of economic prosperity are announced, the economy of the country will not be sustainable without good governance, effective utilisation of the capital budget and reducing the trade deficit. Stating that there is no alternative but to move forward in coordination between the government and the private sector to accelerate the pace of achieving economic prosperity, he stressed increasing domestic production and controlling imports alongside promoting exports. \"If we are unable to maintain good governance, ramp up capital expenditure and reduce our trade deficit, the goal of achieving economic prosperity is unlikely to be achieved just by shouting slogans. While the government is also aware of the present situation, it should also take initiatives for such,\" he said. Minister Shrestha also said that the stakeholders concerned should focus on further strengthening the bilateral trade and diplomatic relationships between Nepal and Italy and that it could lead to a balanced trade between the two countries while also attracting the inflow of Italian tourists to Nepal. Similarly, welcoming all attendees on the occasion, Rajendra Malla, president of the Nepal Chamber of Commerce (NCC), mentioned that although the Nepal-Italy relationship has reached 64 years, an embassy has not been established in the country so far, adding that the minister and stake-holders concerned should also take the initiative towards making that happen in coordination with the Ministry of Foreign Affairs. Talking about the export-import ratio between the two countries, Malla informed that Nepal imports goods worth $22 million from Italy while exports stand at $8 million. Stating that the country's imports are nine times higher than the amount of exported goods at present, he suggested all sectors and industries move ahead towards making the country sustainable and reducing the trade deficit. He also urged Minister Shrestha to raise the issue related to many bills and policies which are left unheard at the parliament, which are crucial for achieving a self-sustainable and prosperous economy. Malla also shared that the present interest rate should be lowered to single digit alongside effective spending of the budget. Furthermore, Gianluca Rubagotti, consulate general of Italy, said that Nepal has no restrictions for Italians who want to invest in Nepal. He shared that Nepal should also start considering the opportunities between the two countries and that the Italian institutions will remain helpful in maintaining peaceful relations and trade viability. The people and organisations that have made significant contributions to Nepal's and Italy's economies were recognised in the programme. Rajesh Kazi Shrestha, an honorary member of the NICCI, received a special honour. In the similar vein, Vinod Sagatani received recognition as the best importer between Nepal and Italy. Raju Shrestha received a prize for being the best exporter of Nepali goods to Italy. The NICCI felicitated Sarbottam Lal Shrestha, managing director of Peace International Tour and Travels, for his contribution to the tourism industry in bringing the most visitors from Italy to Nepal. The Fire and Ice Pizzeria was awarded as the best investor.","pubDate":"2023-03-24 04:21:21","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/03/24/22419.jpg","id":"e76d87de-e37b-4a71-97d8-4edf27de2f55"},{"title":": Apple may spend billions on theatrical movies, Premier League: reports","link":"http://www.marketwatch.com/news/story.asp?guid=%7B20C06575-04D4-B545-71C0-F3FEF8DAB5FF%7D&siteid=rss&rss=1","description":"Apple Inc. is planning to spend $1 billion a year on movies that will be shown in theaters, according to a new report, as part of a bid to boost subscribers for its streaming service and become a bigger player in Hollywood.","content":"Apple Inc. is planning to spend $1 billion a year on movies that will be shown in theaters, according to a new report, as part of a bid to boost subscribers for its streaming service and become a bigger player in Hollywood. Bloomberg News reported Thursday that Apple AAPL, +0.70% plans to significantly boost its spending on movies, and is approaching movie studios for theatrical distribution deals. Apple has an impressive movie business, and won an Oscar for best picture in 2022 for “CODA,” but has largely kept its movies streaming only, with some limited-release exceptions in order to qualify for awards or to appease its high-priced talent. The Bloomberg report gave a boost to movie-theater stocks: AMC Entertainment AMC, +3.00% , IMAX Corp. IMAX, +2.10% and Cinemark Holdings Inc. CNK, +5.75% all posted strong gains Thursday. Upcoming Apple movies include “Killers of the Flower Moon,” starring Leonardo DiCaprio and Robert De Niro, and directed by Martin Scorsese; “Argylle,” starring Henry Cavill and Bryce Dallas Howard, and directed by Matthew Vaughn; and “Napoleon,” starring Joaquin Phoenix and directed by Ridley Scott. Releasing movies in theaters would not only create a new revenue stream for Apple, but could create more pop-culture buzz when they eventually move to streaming, where many of its current, streaming-only movies have found it difficult to find a wide audience. Bloomberg also reported that Apple may bid on rights to stream English Premier League soccer in the U.K. , in a move to compete head to head with the trio of companies that hold Premier League broadcast rights through the 2024-’25 season: Amazon’s AMZN, +0.01% Prime Video, Comcast’s CMCSA, -0.64% Sky and BT Sport, which has a joint venture with Warner Bros. Discovery WBD, +0.14% . The deal would not affect Premier League broadcast rights in the U.S., where the league streams on Comcast’s Peacock. Apple TV+ currently is the home to Major League Soccer — after a 10-year, $2.5 billion deal — and carries Major League Baseball on Friday nights. The Premier League wouldn’t come cheap for Apple; the league’s current deal for domestic broadcast rights sold for $6.3 billion .","pubDate":"2023-03-24 02:31:00","image_url":null,"id":"c340a7c6-1a86-4eda-8f21-84297adc3d52"},{"title":"Trading ideas: Gamuda, Yinson, SunCon, Eco World Development, Straits Energy Resources, Chin Hin Group Property, Ta Win and Pasukhas","link":"https://www.thestar.com.my/business/business-news/2023/03/24/trading-ideas-gamuda-yinson-suncon-eco-world-development-straits-energy-resources-chin-hin-group-property-ta-win-and-pasukhas","description":"KUALA LUMPUR: Stocks with recent corporate news flow include Gamuda, Yinson, Sunway Construction, Eco World Development, Chin Hin Group Property, Straits Energy Resources, Ta Win and Pasukhas, said Apex Research. Read full story","content":"KUALA LUMPUR: Stocks with recent corporate news flow include Gamuda, Yinson , Sunway Construction, Eco World Development, Chin Hin Group Property , Straits Energy Resources, Ta Win and Pasukhas , said Apex Research. Gamuda Bhd ’s 2QFY23 net profit grew 9.88% to RM194.62 million. Yinson Holdings Bhd's 4QFY23 net profit jumped 158.5% to RM168 million. Sunway Construction Group Bhd has won a contract for the construction of station and viaducts for the Johor Bahru–Singapore Rapid Transit System (RTS) for RM604.86 million. Eco World Development Group Bhd ’s net profit for 1QFY23 fell 10% to RM57 million. Chin Hin Group Property Bhd has emerged as a substantial shareholder of NCT Alliance Bhd. Straits Energy Resources Bhd said its 38%-associate CBL International Ltd has been granted in-principle approval to list on the Nasdaq. Ta Win Holdings Bhd is acquiring Asia Poly Holdings Bhd 's 15% stake in Cyprium Wire Technology Sdn Bhd (CWT) for RM12 million. Pasukhas Group Bhd saw an increase in the value of the contract to RM12.7 million from RM7.08 million for concrete substructure works for the head building of the Dexcom Malaysia Factory 3 project in Penang.","pubDate":"2023-03-24 00:34:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/03/24/1992848.jpg","id":"3c4e4eeb-8e1c-491e-9bbb-25772021bb56"},{"title":"Oil markets at mercy of volatility but balanced fundamentals offer some hope","link":"https://www.thestar.com.my/business/business-news/2023/03/24/oil-markets-at-mercy-of-volatility-but-balanced-fundamentals-offer-some-hope","description":"INTERNATIONAL crude oil markets will likely flirt with volatility on macroeconomic considerations, even though Dated Brent prices are expected to average above US$80/b in coming months, as supply risks and strong Asian demand temper the impact of bearish events including those triggered by the Credit Suisse turmoil. Read full story","content":"INTERNATIONAL crude oil markets will likely flirt with volatility on macroeconomic considerations, even though Dated Brent prices are expected to average above US$80/b in coming months, as supply risks and strong Asian demand temper the impact of bearish events including those triggered by the Credit Suisse turmoil. “Dated Brent prices should average US$82-$85/b for the next few months before increasing into the upper US$80s to $90/b later in the year,” as inventory levels will grow more slowly and ultimately shift to declines around mid-year, S&P Global Commodity Insights said in its latest March Commodities brief. Persistent geopolitical supply risks, falling inventories, expectations of the OPEC+ group’s efforts to maintain market balance, as well as hopes of resurgent China demand, will stay dominant themes, although the tumult stirred by the Swiss bank, caused by its liquidity and the slump in its share price, have fueled concerns of a broader financial crisis that could escalate brewing risks of a global recession. Reflecting fears of a spreading banking crisis, Platts, part of S&P Global, assessed Dated Brent at a 15-month low of US$71.84/b March 15. UBS, another Swiss Bank, subsequently agreeing to buy Credit Suisse should restore some semblance of calm. Dated Brent was assessed little-changed at US$71.705/b March 20 as news of the takeover percolated but edged up to reach US$73.775/b March 22. Asia’s demand push Asia is expected to contribute over 70% of global oil demand growth in 2023, S&P Global said, noting that for the second year in a row, jet fuel and kerosene demand is forecast to grow the most in volume, followed by gasoline and diesel. Global oil demand is forecast to reach 104.8 million b/d in 2024, up 2.3 million b/d from 2022 and 2.6 million b/d higher than in pre-pandemic 2019, it added. India was the key driver of Asia’s oil demand growth in 2022 and will contribute about 17% of regional growth this year, with the country’s overall oil demand in 2023 expected to be 7% above levels in 2019, compared with 3% higher for all of Asia, S&P Global has projected. India’s PMI’s for both manufacturing and services remained above the 50-threshold level in January, pointing to an expansion in these sectors. The overall S&P Global composite PMI index strengthened to 59 in February from 57.5 in January, with the latest reading pointed to the 19th straight month of growth in private sector activity. To cater to strong demand and to ensure its oil supply strategy does not encounter hurdles if Russia faces additional sanctions over its war in Ukraine, India has also intensified discussions with the US for crude oil imports. India’s imports of Russian crude surged to 700,000 b/d in 2022 from 100,000 b/d in 2021, boosting the market share of Russian crude in India's overall crude import basket to around 15% from 2.2% over the same period. S&P Global expects India’s Russian crude imports to increase further to around 1.2 million-1.5 million b/d in 2023 and comprise around 25%-30% of its total crude imports. China is also expected to provide bullish momentum to oil demand in 2023 as it reopens after pandemic lockdowns that continued until late last year. During the second half of 2023, China is expected to drive world oil demand to record levels, the International Energy Agency said in its latest monthly oil market report, adding the global economic outlook has benefitted from China’s economic momentum, with rebounding February PMI data and robust air traffic demand. Also noteworthy is China’s increasing crude imports from Russia as it snaps up attractively priced Russian crudes shunned by the West. China's crude oil imports from Russia surged to a record high of 2.01 million b/d (7.69 million mt) in February, General Administration of Customs data released March 20 showed. S&P Global expects the uptrend to continue in March when imports of Urals crude from Russia are likely to hit a 33-month high, with PetroChina and independent refineries both seen to be receiving hefty deliveries. OPEC+ supply considerations The OPEC+ coalition’s crude oil production fell by 80,000 b/d in February, the latest Platts survey by S&P Global Commodity Insights found, with volumes dropping in Iraq, Angola and Kazakhstan. The decline came despite a small increase in Russian output of 10,000 b/d to 9.86 million b/d as the key OPEC ally continued to show resilience to western sanctions targeting its oil sector. With several countries still struggling to raise or even maintain output due to internal disruptions or lack of investment, the OPEC+ alliance continues to massively underproduce its quotas, even with the group agreeing to slash them by 2 million b/d from November 2022 through end 2023. Overall OPEC+ compliance among countries with quotas was 153% in February, according to S&P Global calculations, meaning the 22 members combined were still 1.91 million b/d short of their production targets. Gains in demand growth will likely allow OPEC+ to avoid reducing quotas in H2. The OPEC+ monitoring committee set to meet April 3, when further cues could emerge on its future strategy. Meanwhile, the threat of further sanctions by the West on Russia also keeps the market underpinned. According to the Chinese Zodiac Calendar, 2023 is the Year of the Rabbit, with the animal symbolizing hope, longevity, peace, and prosperity. Only time will tell whether the coming months usher in a period of calm or more global uncertainty. Surabhi Sahu, Senior Editor, S&P Global Commodity Insights.","pubDate":"2023-03-24 00:30:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/03/23/1992432.jpg","id":"675f712e-43f9-4de9-aafe-99cbff992e06"},{"title":"FTX debtors agree to $95M sale of stake in Mysten Labs","link":"https://cointelegraph.com/news/ftx-debtors-agree-to-95m-sale-of-stake-in-mysten-labs","description":"The proposed purchase price of the Mysten Labs shares was roughly 95% of the amount FTX Ventures invested as part of a $300-million funding round in September 2022.","content":"The debtors for defunct crypto exchange FTX have approved an agreement that would sell its preferred stock in Mysten Labs, the company behind the Sui blockchain. In a March 22 filing in United States Bankruptcy Court in the District of Delaware, FTX debtors proposed a deal in which Mysten Labs and the company would agree to a mutual release of claims. As part of the agreement, the debtors planned to sell roughly $95 million worth of preferred stock back to Mysten in addition to $1 million in SUI tokens. “The Debtors carefully considered and analyzed the offer as set forth in the Agreement in comparison to its other options and concluded that a sale of the Interests will result in obtaining maximum value for the Interests, and is in the best interests of the Debtors’ estates and creditors,” said the filing. “The Purchase Price is equal to approximately 95% of the amount FTX Ventures had originally invested in the Preferred Stock of Purchaser-Subject Company, plus 100% of the amount Sellers paid for the SUI Token Warrants.” Related: FTX debtors report $11.6B in claims, $4.8B in assets, with many crypto holdings ‘undetermined’ The deal is seemingly subject to court approval as well as the possibility of other bids on the stock before being finalized. FTX Ventures acquired the stock as part of a $300 million funding round with Mysten announced in September 2022. The investment also came prior to FTX filing for Chapter 11 bankruptcy in November. Debtors in the FTX bankruptcy case also announced on March 22 they planned to recover $460 million of user funds from venture capital firm Modulo Capital. The filing alleged the investment from Alameda Research was at the direction of former FTX CEO Sam Bankman-Fried and a misappropriation of funds. Bankman-Fried faces multiple counts in federal court related to alleged fraud during his time as CEO, and has pled not guilty to all charges. Magazine: Can you trust crypto exchanges after the collapse of FTX?","pubDate":"2023-03-23 19:47:41","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvMDBkMjYxNWQtZTg4NS00ZDU3LTk2NTctYmE4ZGE0N2MwNzU5LmpwZw==.jpg","id":"7c0461bb-0453-474b-82e5-a52d10516649"},{"title":"Arbitrum airdrop sells-off at listing, but traders remain bullish on ARB","link":"https://cointelegraph.com/news/arbitrum-airdrop-sells-off-at-listing-but-traders-remain-bullish-on-arb","description":"ARB token sold-off upon listing at exchanges and some users reported a tech-issue laden claim experience, but the token could still follow the trajectory of previous airdrops.","content":"The official Arbitrum airdrop page crashed right after the claiming process began around 9 a.m. EST. Some users still managed to claim it through alternative methods like Arbiscan. In the first two hours, the market witnessed a massive sell-off of the token as its price declined from over $10.29 to lows of $1. At ByBit, the token started trading for $7.50, but dropped to $1.50 within minutes. At the time of writing, the token was trading at $1.33. Only one address successfully sold the token at $10.29 through the ARB/USDC pool on Uniswap, bagging $64,340 for 6,250 tokens. A few others were able to sell for $4.50, however, the price dropped quickly below $1.50 as more sellers arrived. Nansen data shows that out of 6.03 million ARB claimed by “smart money” wallets, $5.01 million were moved to a centralized or a decentralized exchange, most likely to sell. The analytics firm puts “smart money” tags on addresses that trade in significant size and are usually active. While some smart money accounts added 3.45 million from DEXs. Overall, the amount moved to exchanges was 150% larger than inflows to the wallets, suggesting a massive sell-off. Related: Arbitrum’s ARB token signifies the start of airdrop season — Here are 5 to look out for The Aribtrum airdrop claim web page crashed thanks to overwhelming requests from users to claim ARB tokens. The page returned 404 and 429 errors, remaining down for more than an hour after the claiming process began. Nevertheless, some users still claimed the airdrop through alternative services like Arbiscan. The blockchain explorer witnessed a record number of visitors of over 84,000 in the first 30 minutes after the claiming window opened. Nansen’s data shows that 15% of the airdrop claims were processed when the official Arbitrum webpage was down. However, the claims through Arbiscan were far from smooth. The website also suffered from downtime due to traffic overload, creating a bad user experience for many. https://twitter.com/TheDeFinvestor/status/1638926204169494528 The token claiming widow will be alive for 184 days till September 24, 2023. The views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.","pubDate":"2023-03-23 19:27:56","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvNDdhMjQ2ZmUtZjk3OS00ZjBiLTk2NDEtYjViNjY1MjVhMTQ5LmpwZw==.jpg","id":"d8e94498-6ca5-4a74-a2a6-d5df844d3f95"},{"title":"Sygnum sees increased crypto firm inquiries after US banking giants collapse","link":"https://cointelegraph.com/news/sygnum-sees-increased-crypto-firm-inquiries-after-us-banking-giants-collapse","description":"The Swiss crypto bank, however, would stick to its policy of not onboarding U.S. clients as they focus on its core target market.","content":"Zurich-based digital asset bank Sygnum is seeing an influx in inquiries from international crypto firms looking for new banking partners following the recent collapses of crypto-friendly banking giants in the United States. Dominic Castley, chief marketing officer at Sygnum, told Cointelegraph in an email that they are receiving more onboarding inquiries from crypto firms based in various jurisdictions looking to bank with them. He explained: Castley added that the new onboarding inquiries are mainly coming from investors, asset managers and blockchain projects looking to diversify their crypto investments . He explained that the Swiss bank is putting additional effort into scaling its client service support and compliance teams “to welcome these new clients in a speedy but fully compliant manner.” Signature Bank, Silvergate Capital and Silicon Valley Bank experienced a meltdown in March, leaving U.S. crypto firms scrambling for institutions to do business with. Although the recent events have resulted in an opportune moment for the Swiss bank to partner with new clients, Castley said that they would stick to their policy to not take on U.S. clients. Market Talks with Cointelegraph is live! Tune in to watch Dave Weisberger and Ray Salmond discuss the problems faced by the banks and the Fed and whether they will impact crypto. https://t.co/4WsWRR33tv “Sygnum took the decision to not service U.S. clients at inception back in 2017 to enable full focus on our core target markets,” Castley wrote. “It has been a founding policy ever since, and as a result, we do not onboard any U.S. persons or entities as clients.” Related: Bitcoin’s banking crisis surge will ‘attract more institutions’: ARK’s Cathie Wood Amid the increase in entities interested in banking with Sygnum, Castley said the firm attributes this to its dual Swiss and Singapore locations and strategy to be fully regulated in these respective jurisdictions. Sygnum recently announced that it is opening its Middle East hub for Swiss-regulated crypto banking services in the Abu Dhabi Global Market (ADGM) after securing financial services permission from the Financial Services Regulatory Authority (FSRA). Following Sygnum’s expansion efforts into the Middle East, the Swiss digital asset bank now looks to position itself in another jurisdiction that is also welcoming toward cryptocurrency. Aside from Abu Dhabi and Singapore , it has licensed operations in Luxembourg. Related: Unstablecoins: Depegging, bank runs and other risks loom","pubDate":"2023-03-23 19:00:00","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvMDRlYjA2MmUtMWQzNC00ZjA0LTg5YWItYThkYmRhZjAzYzYxLmpwZw==.jpg","id":"7214187e-2c7d-41b1-8348-afb2651d88dc"},{"title":"ASX set to open lower despite Wall Street rebound","link":"https://www.smh.com.au/business/markets/asx-set-to-open-lower-despite-wall-street-rebound-20230324-p5cuur.html?ref=rss&utm_medium=rss&utm_source=rss_business","description":"Stocks closed mostly higher after a wobbly day of trading as worries continued to rise about the banking industry.","content":"Stocks closed mostly higher after a wobbly day of trading as worries continued to rise about the banking industry.\n\nThe S&P 500 rose 0.3 per cent after veering all the way from a 1.8 per cent gain earlier in the day to a 0.4 per cent loss. The Dow Jones posted a slight gain of 0.2 per cent, while strength for tech and high-growth stocks helped the Nasdaq composite do better than the rest of the market. The Australian sharemarket is set to open lower, with futures at 6.59am AEDT pointing to a dip of 39 points, or 0.6 per cent, at the open. The ASX lost 0.7 per cent on Thursday.\n\nWall Street has had a rollercoaster week. Credit:NYSE\n\nA day earlier, stocks fell sharply after the Federal Reserve indicated that while the end may be near for its market-rattling hikes to interest rates, it still doesn’t expect to cut rates this year. Markets lost momentum after Fed chair Jerome Powell said that, along with an insistence that it could keep raising rates if inflation stays high.\n\nBut traders on Thursday were still largely betting the Fed will cut rates later this year. Such cuts can act like steroids for markets, juicing prices for stocks, bonds and other investments. They would relax the pressure on the economy, but they could also give inflation more fuel.","pubDate":"2023-03-23 18:27:59","image_url":"https://static.ffx.io/images/$zoom_0.1836%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/c2248cb28c627c0c5dd1bbc1cf1e725560132027","id":"03355c06-708e-46d6-8356-360a7bc71930"},{"title":"News24.com | Cape Town looking to bring down price of special meters to feed in power to the grid","link":"https://www.news24.com/fin24/Climate_Future/Energy/cape-town-looking-to-bring-down-price-of-special-meters-to-feed-in-power-to-the-grid-20230323","description":"The City of Cape Town is looking into cheaper bi-directional meters to enable households to feed in power to the grid, says City of Cape Town Mayor Geordin Hill-Lewis.","content":"The City of Cape Town is working to bring down the costs of metering for households that want to feed in excess power to the grid, according to Cape Town Mayor Geordin Hill-Lewis. The mayor was speaking at the Western Cape government's weekly Digicon. The virtual briefing is a means for Premier Alan Winde to keep provincial residents updated on steps being taken to address energy challenges amid the national state of disaster. Hill-Lewis provided a brief overview of the measures the city is taking to shield residents from at least two stages of load shedding. Among these is the procurement of renewable energy, as well us implementing incentives to get households and businesses to install rooftop solar PV. The city for feeding their excess power to the grid. The previous policy only allowed these customers to have their electricity bills credited, and they were still required to be net consumers of power. But now the city will pay its customers a feed-in tariff. The National Energy Regulator of SA (Nersa) approved a feed-in tariff of 78.98c/kWh for the city. And the city, in turn, added a 25c/kWh incentive to that. Apart from load shedding driving more households and businesses to seek energy solutions, the city also wants to \"tip the scale\" and make it easier for them to invest in solar PV, Hill-Lewis said. But there is one more hurdle the city wants to clear for households and that's the cost of the meters that would support the feed-in of electricity. Authorised customers need to install specialised advance metering infrastructure (a bi-directional meter), councillor Beverley van Reenen, mayoral committee member for energy, explained via email. The cost of the meter is roughly R13 000. This is an addition to the cost of a solar PV system with a battery and inverter - which is north of R80 000. Installers must apply to the city to authorise the system for grid connection, Van Reenen said. There is a meter-reading fee of R96.20 (for the 2022/23 financial year) which is inclusive of VAT. The fee is for customers with small-scale embedded generation or rooftop solar PV who have the specialised meter installed. It covers the costs for the infrastructure used to remotely read the meter and upload the data to the billing system (this is similar to sending out a meter reader), Van Reenen said. The city is working on a \"drastic reduction\" in price for the residential feed-in meter, Hill-Lewis said. \"…That meter price will come down dramatically … I think by the end of this year we should be in a place to have a much cheaper two-way feed-in meter,\" said Hill-Lewis. Currently, the meter used to feed in power is a three-phase meter, generally used by businesses for their power needs. The idea is to find a meter designed for households, which would be smaller but affordable and just as reliable and safe. \"Safety is a growing concern because of the amount of power fed to the grid from solar installations. That number is growing rapidly,\" said Hill-Lewis. \"We have to ensure grid safety and stability. We do have to have good, quality equipment,\" he added. It's not just about getting a cheaper meter – but ensuring it is safe for the grid and for people's homes. \"It's important to get a good quality installation from a reputable installer. The meter and equipment that you use must be proper, good stuff.\" Asked about whether the city wants to take over Eskom supply areas in its efforts to reduce load shedding for residents, Hill-Lewis confirmed that talks are underway with the power utility. He could not give more details but said that he hoped Eskom's new management would cooperate with the city as its previous management, under André De Ruyter, had been. On the provincial front, the Western Cape government also described some of the initiatives it plans to bolster energy security. One of the programmes targets rolling out rooftop solar PV systems (with batteries and inverters) at 100 schools in the province. These are lower quintile or poorer schools. The selection process of the schools that would benefit has not yet been finalised, explained Alwie Lester, special energy advisor to Winde. The plan is to also introduce energy efficiencies at schools, for example the use of LED lighting. The provincial government is also looking to learn from what some private schools have done to roll out solar PV systems, this includes understanding the costs and what technology was used. The provincial government is collaborating with researchers from Stellenbosch University, who have similarly provided a solar PV solution for Cloetesville Primary. It is also working together with the national department of education. The budget set aside for this is R100 million. Lester said the province aims to raise funding from donors and partners so more schools could benefit.","pubDate":"2023-03-23 18:27:45","image_url":"https://scripts.24.co.za/img/sites/fin24.png","id":"4e68d78c-3ba1-4d98-8207-808519fdcdc2"},{"title":"Millers Tea Room Hollicarrs closes - team'heartbroken'","link":"https://www.yorkpress.co.uk/news/23408613.millers-tea-room-hollicarrs-closes---teamheartbroken/?ref=rss","description":"A CAFE and tearoom near York has closed sown suddenly after being hit by the rising costs of hospitality.","content":"A CAFE and tearoom near York has closed sown suddenly after being hit by the rising costs of hospitality. Millers Tea Room Hollicarrs opened at Hollicarrs Holiday Park, near Escrick, just off the A19 between York and Selby, in August 2020. Charlie Forbes Adam, proprietor of the Escrick Park Estate, which owns Hollicarrs, said then that the café, owned and run by Paul Blanshard of Millers, would be a great asset for holiday home owners and visitors alike. He said the cafe was a new and significant part of the holiday park’s offering and would also service the adjacent award-winning Three Hagges Woodmeadow.\" Mr Blanshard said then: “My wife Alice and I already own and run two thriving tea rooms at holiday lodge parks at Raywell and Heron in East Yorkshire. On the back of this, we were contacted by Hollicarrs and asked to do something similar. But now Liv Firth, of the Millers Team, has posted on Facebook that she was 'heartbroken' to announce the immediate closing of Millers Tearoom Hollicarrs. She said:\"We tried our absolute hardest but unfortunately with the rising costs in hospitality and multiple lockdowns that got in our way it’s left us no choice but to close down all three businesses. \"I would like to thank all our customers over the past few years that have continued to support us. We will miss you all and we wish things could of been different. \"It’s been a pleasure to serve you all.\"","pubDate":"2023-03-23 18:08:43","image_url":"https://www.yorkpress.co.uk/resources/images/16591676/?type=app&htype=0","id":"70914858-ba6c-4fda-ab73-b2f53978d171"},{"title":"7 artificial intelligence examples in everyday life","link":"https://cointelegraph.com/news/7-artificial-intelligence-examples-in-everyday-life","description":"AI impacts everyday life: personal assistants, social media, healthcare, autonomous vehicles, smart homes and more!","content":"Artificial intelligence (AI) is becoming increasingly important in our daily lives. AI can automate routine and time-consuming tasks, allowing us to focus on more important activities. In addition, AI algorithms can analyze vast amounts of data to personalize products, services and experiences. Moreover, AI is driving innovation in various industries, such as finance, retail and education. Here are seven artificial intelligence examples in everyday life. AI-powered personal assistants, such as Siri, Google Assistant and Amazon Alexa, are integrated into smartphones, smart speakers and other devices and can perform a wide range of tasks, from setting reminders and sending messages to playing music and controlling smart home devices. Social media sites utilize AI to examine user preferences and behavior, suggest pertinent material, and customize the user experience. Moreover, bogus news, hate speech and other harmful content are found and eliminated thanks to AI systems. For instance, Meta uses AI to detect and remove fake news and other harmful content. Instagram uses AI to recommend posts and stories based on user behavior. TikTok uses AI to personalize the user experience and recommend videos. Businesses are increasingly using virtual assistants and chatbots powered by AI to offer 24/7 customer service. Natural language processing is used by these chatbots to comprehend consumer questions and deliver relevant responses. For instance, many companies, such as H&M, use AI-powered chatbots to provide customer support. These chatbots can handle a wide range of queries, such as tracking orders and processing returns. Related: 10 emerging technologies in computer science that will shape the future Applications of artificial intelligence in healthcare include patient monitoring, medication research and medical imaging. Medical picture analysis, anomaly detection and diagnosis support are all capabilities of AI algorithms. For instance, Merative (formally IBM Watson Health) uses AI to analyze medical images and assist doctors in making diagnoses. The app Ada uses AI to help users identify symptoms and connect with healthcare professionals. From drug discovery to clinical decision support, AI is transforming the way we approach healthcare. Some of the top AI tools in the market include IBM Watson Health and Google DeepMind Health. #HealthcareAI #AIinMedicine #HealthTech Related: 9 promising blockchain use cases in healthcare industry Customers are given product recommendations by e-commerce sites, such as Amazon, using AI algorithms based on their search queries, browsing histories and other information. Sales are boosted as a result, and customer satisfaction is enhanced. AI is used in self-driving cars, trucks and buses to perceive their environment, map out routes and make judgments while driving. It is anticipated that this technology will lessen collisions, gridlock in the streets and pollutants. For instance, Tesla uses AI to power its self-driving cars, which can navigate roads, highways and parking lots without human intervention. Smart home devices such as thermostats, lighting systems and security systems use AI to learn user preferences and adjust settings accordingly. These devices can also be controlled remotely using smartphones or voice commands. For instance, Philips Hue uses AI to adjust lighting based on user preferences and ambient light levels. Philips hue makes me so happy. pic.twitter.com/MHqoNvx7AK NFT Creator: Creating ‘organic’ generative art from robotic algorithms: Emily Xie","pubDate":"2023-03-23 18:07:00","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvOTA0MmY2NzAtN2UxYy00NmM5LWE0ZmEtODQ2ZDExODdjYzQyLmpwZw==.jpg","id":"5f54e177-9fa9-4097-8783-9b8572488396"},{"title":"Bitcoin erases Fed losses as traders eye $40K BTC price target","link":"https://cointelegraph.com/news/bitcoin-erases-fed-losses-as-traders-eye-40k-btc-price-target","description":"BTC price snaps back into its uptrend after Bitcoin market nerves over U.S. economic policy fade in line with stocks and gold.","content":"Bitcoin ( BTC ) returned to near $29,000 on March 23 as bulls ignored news of a fresh United States regulatory crackdown. Data from Cointelegraph Markets Pro and TradingView showed BTC/USD gaining almost 8% versus its overnight lows to challenge nine-month highs on Bitstamp. The pair kept the volatility coming as the dust settled on the prior day’s interest rate decision and associated commentary from the Federal Reserve. Despite Fed Chair Jerome Powell giving mixed signals over how and if rate hikes would continue, crypto market commentators argued that the sudden drop that Bitcoin witnessed had been over-the-top. “Make sure to remember the panic and calls for lower next time you get a dip during a HTF uptrend,” popular trader Crypto Chase wrote in part of Twitter analysis. Among those now eyeing the continuation of the uptrend was Crypto Ed, who saw Bitcoin filling its retracement zone. Next leg up should start pic.twitter.com/3spyz52ct0 The mood even managed to stay positive despite news that U.S. regulator the Securities and Exchange Commission had begun targeting crypto firms, notably Coinbase , stocks of which fell 20% at the Wall Street open. Related: Hindenburg Research reports Block short position, claiming fraud facilitation and inflated metrics The reported arrest of Do Kwon , founder of blockchain firm Terraform Labs, responsible for the 2022 Terra implosion, likewise failed to dampen performance. “You can try to fade it, but we’re just gonna keep sending from here,” fellow trader Kaleo added in the latest of his characteristically bullish BTC price takes, having reiterated that $40,000 was a “magnet” price target. Bitcoin and cryptocurrencies like Litecoin ( LTC ) were not the only assets enjoying a rebound on the day. Related: US enforcement agencies are turning up the heat on crypto-related crime U.S. stocks attempted to cancel out their own post-Fed losses, with the S&P 500 up 1.2% on the day at the time of writing. Gold, meanwhile, hit $195.15, gaining an impressive 3.1% versus the daily lows before and edging closer to a $2,000 rematch. “We’re still in the vacuum of relief, the ‘Echo’ bubble. The period where the potential process of pausing hikes remains to be bullish and there’s no clear recession, until reality kicks in,” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, summarized . Van de Poppe agreed that $40,000 was now a longer-term target for BTC/USD. Magazine: Best and worst countries for crypto taxes — Plus crypto tax tips The views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.","pubDate":"2023-03-23 17:26:07","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvNTgxNTM2MjUtMTdhZS00YjkzLTg5YzktOTAwNzZhYmIzNGY3LmpwZw==.jpg","id":"04ef2414-ba2e-4e09-aa6c-ba3af7d4d2aa"},{"title":"Coinbase and Algorand give divergent reasons for staking reward suspension","link":"https://cointelegraph.com/news/coinbase-and-algorand-give-divergent-reasons-for-staking-reward-suspension","description":"Algorand Foundation CEO said the crypto exchange is evaluating its products and services after receiving a Wells Notice. Coinbase denies the claim.","content":"Algorand Foundation CEO Stacy Waden took to Twitter to confirm rumors about Coinbase's decision to discontinue Algorand ( ALGO ) staking rewards for retail customers. Coinbase and Algorand, however, cite different reasons for the move. According to Waden's tweet, Coinbase informed Algorand about the sudden termination of rewards for ALGO tokens on March 22, as the crypto exchange evaluates its portfolio of products and services following a Wells Notice issued by the United States Securities and Exchange Commission (SEC) the same day. Hi #algofam , woke up this a.m, like many of you, to find that @coinbase killed rewards. They've now informed us that they are evaluating their services in light of recent regulatory scrutiny, and, for that reason, they will no longer support Algo rewards for Retail customers. 1/ The change does not affect the ALGO token trading and governance rewards for institutional investors, Waden added in the thread. The claims have been denied by Coinbase. \"The Algorand news is not related,\" a spokesperson for the crypto exchange told Cointelegraph, asserting that halting ALGO rewards is not tied to recent regulatory developments: Cointelegraph reached out to the Algorand Foundation but did not receive an immediate response. Coinbase is the latest crypto company to be targeted by U.S. regulators in 2023. After receiving a Wells Notice on March 22, the exchange's chief legal officer Paul Grewal said the warning \"comes after Coinbase provided multiple proposals to the SEC about registration over the course of months, all of which the SEC ultimately refused to respond to.\" Grewal further said Coinbase has \"repeatedly, formally asked the SEC to engage in rulemaking for our industry.\" This includes filing a petition for rulemaking in July 2022, submitting a comment letter on March 20 supporting the petition, and requesting clarity about the SEC's views on staking services and the lack of notice provided to the industry. According to Grewal: The Coinbase notice was sent less than two months after the SEC reached an agreement with crypto exchange Kraken for “failing to register the offer and sale of their crypto asset staking-as-a-service program,” which the commission claims qualified as securities under its purview. As part of the settlement, Kraken agreed to cease operations of its U.S. staking program and pay $30 million in disgorgement, prejudgment interest, and civil penalties. A Wells Notice is a letter warning a company that the SEC may follow with enforcement action after identifying potential violations of securities law. Despite the notice, the crypto exchange says its products and services \"continue to operate as usual.\"","pubDate":"2023-03-23 17:22:52","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvMTg2YzYyOTktZTFkMS00NjlkLTliMDgtODViZTE5NGNiM2QwLmpwZw==.jpg","id":"3c8a3764-b2cc-4241-ac6f-39a71eb2c151"},{"title":"Bank of England hikes rates like Fed amid financial turmoil","link":"https://www.thezimbabwemail.com/banking/bank-of-england-hikes-rates-like-fed-amid-financial-turmoil/","description":"LONDON (AP) — The Bank of England extended its battle against inflation Thursday, announcing an 11th consecutive interest rate increase despite concerns about the economic fallout from troubles in the global financial system. Britain’s central bank boosted its key rate by a quarter-percentage point to 4.25%, a day after the U.S. Federal Reserve approved a similar move to…","content":"LONDON (AP) — The Bank of England extended its battle against inflation Thursday, announcing an 11th consecutive interest rate increase despite concerns about the economic fallout from troubles in the global financial system.\n\nBritain’s central bank boosted its key rate by a quarter-percentage point to 4.25%, a day after the U.S. Federal Reserve approved a similar move to tame price increases that are crimping household budgets and slowing economic growth.\n\nThe decision followed unexpected news that U.K. inflation accelerated to 10.4% in February, driven by the cost of food, clothing and dining out. Before the figures were released Wednesday, many analysts had expected the Bank of England to keep rates on hold following the collapse of two U.S. banks and the hastily arranged takeover of Swiss banking giant Credit Suisse.\n\n“A banking curve ball has been thrown into the Bank of England’s already tricky juggling act, but for now the eye of policymakers is still firmly trained on catching inflation and bringing it under control,” said Susannah Streeter, head of money and markets at Hargreaves Lansdown, which manages more than 120 billion pounds ($147 billion) for investors.\n\nStill, Thursday’s move was the smallest rate hike since May 2022, with the Bank of England forecasting a drop in inflation to 2.9% by the end of the year as energy costs fall and the big price increases recorded last year drop out of calculations.\n\nAs it did last month, the central bank indicated that it no longer has a presumption for further rate increases, saying only that it would closely monitor price pressures in the economy.\n\n“If there were to be evidence of more persistent pressures, then further tightening in monetary policy would be required,” the bank said.\n\nRaising interest rates increases the cost of borrowing, which reduces spending and relieves upward pressure on prices. But it also tends to slow economic growth.\n\nCentral bankers worldwide are struggling to balance competing economic demands as they try to rein in inflation, which erodes savings and increases costs for consumers and businesses, without unnecessarily damaging economies weakened by the COVID-19 pandemic and Russia’s war in Ukraine.\n\nFollowing the collapse of Silicon Valley Bank in the United States and the turbulence it unleashed on the global financial system, policymakers are concerned that banks around the world may curtail lending, further crimping economic growth.\n\nThe Bank of England said Thursday that it had determined that British banks are “resilient.”\n\n“The U.K. banking system maintains robust capital and strong liquidity positions and is well placed to continue supporting the economy in a wide range of economic scenarios, including in a period of higher interest rates,” the central bank said.\n\nThat echoed the words of Fed Chair Jerome Powell, who sought to reassure Americans that their bank deposits were safe as the Fed raised its key rate by a quarter-point Wednesday.\n\nThe Swiss central bank also went higher, hiking by half a point Thursday and declaring that the government-orchestrated takeover of Credit Suisse by Swiss rival UBS “put a halt to the crisis.”\n\nA week ago, the European Central Bank increased rates by a half-point, brushing aside the financial market jitters and calling Europe’s banking sector resilient.\n\nThe Bank of England was among the first to begin raising borrowing costs after a prolonged period of low interest rates following the 2008 global financial crisis. In 11 hikes since December 2021, the key rate went from just 0.1% to 4.25%.\n\nThe rapid rise in interest rates worldwide squeezed the finances of some banks because it reduced the value of their bond holdings.\n\nAs they assess the potential impact that higher rates are having on banks, policymakers also are weighing how long it will take recent increases to flow through to the broader economy.\n\nIf they wait too long to stop raising rates, they risk slamming the breaks on already anemic growth. If they stop too soon, they risk inflation becoming embedded in the economy.\n\nLuke Bartholomew, senior economist at the U.K.-based fund manager abrdn, said he expects Thursday’s move to be the last rate increase of this cycle because the impact of past hikes and recent market volatility will begin to slow economic growth.\n\n“However, there is still a significant risk of one final rate increase if inflation proves to be a bit stickier in coming months,” he said.\n\nThe Bank of England will have to make that decision in an even more complex environment than other central bankers.\n\nA high level of dependence on natural gas and limited storage capacity left British energy users particularly exposed to the surge in global gas prices following Russia’s invasion of Ukraine. Britain also is still adjusting to the impact of leaving the European Union, which reduced trade with its neighbors, curtailed the supply of cheap labor and slowed economic growth.\n\nU.K. inflation is stuck above 10%, while it dropped to 8.5% last month in the 20 countries sharing the euro and to 6% in the U.S.\n\nTreasury chief Jeremy Hunt applauded the central bank’s decision.\n\n“With rising prices strangling growth and eroding family budgets, the sooner we grip inflation the better for everyone,” he said.\n\nShare this: Share\n\nTwitter\n\nFacebook\n\nEmail\n\nLinkedIn\n\nReddit\n\nPinterest\n\nWhatsApp\n\nSkype\n\n\n\nLike this: Like Loading...","pubDate":"2023-03-23 16:47:02","image_url":"https://i0.wp.com/www.thezimbabwemail.com/wp-content/uploads/2018/01/London.jpg?fit=700%2C425&ssl=1","id":"271e9cbf-bab9-413f-aa8a-7ebd4304b3a8"},{"title":"Who Is Indian-Origin Amrita Ahuja Of Block, Named In Hindenburg Latest Report?","link":"https://zeenews.india.com/companies/who-is-indian-origin-amrita-ahuja-of-block-named-in-hindenburg-latest-report-2587183.html","description":"Twitter co-founder Jack Dorsey started the payment company with the name of Square back then in 2009 which later rebranded into Block.","content":"New Delhi: The short-seller Hindenburg Research in its latest report has alleged Twitter co-founder Jack Dorsey’s payment company Block (erstwhile known as Square Inc.) for “facilitating fraud against consumers and government, avoiding regulation, dressing up predatory loans and misleading investors”. has targeted Twitter co-founder Jack Dorsey’s payment app Block The company Block’s shares tank by over 18% after short-seller Hindenburg Research announced the payment company was its latest short position.\n\nThe report also alleged that Block Chief Operating Officer Amrita Ahuja dumped millions of dollars in stocks during the pandemic as the firm’s stock soared on the back of its facilitation of fraud.\n\n\"As Block’s stock soared on the back of its facilitation of fraud, co-founders Jack Dorsey and James McKelvey collectively sold over $1 billion of stock during the pandemic. Other executives, including CFO Amrita Ahuja and the lead manager for Cash App Brian Grassadonia, also dumped millions of dollars in stock,\" the report mentioned.\n\nWho Is Amrita Ahuja?\n\nAccording to her Linkedin Profile, Indian-origin Amrita Ahuja is currently the chief operating officer of fin-tech Block. She promoted on the post 2 months back after holding chief financial officer post since January 2019. She is also the member of board of directors in companies Discord and Airbnb.\n\nAhuja started her career in 2001 as Analyst and Investment banker in Morgan Stanley where she worked over 1 year. After that, she joined Walt Disney Company as senior analyst in Strategic planning. Her tenure in Activision Blizzard spanned over 5 years where she retained several positions including Vice President in Business Development, Finance and Operations and Investor Relations.\n\nShe completed her graduation from Duke University in Economics and MBA from Harvard Business School.\n\nWhat is Jack Dorsey’s fin-tech Block?\n\nTwitter co-founder Jack Dorsey started the payment company with the name of Square back then in 2009 with the disruptive idea: a tiny card reader that could plug into a smartphone’s headphone jack to easily enable to make the credit card payments between payers and vendors.\n\n“In 2013, a month following PayPal’s acquisition of Venmo, Block launched Square Cash, later rebranded Cash App. It aimed to compete with Venmo by providing financial services to consumers, starting with a peer-to-peer mobile app where users could send and receive money,” the report mentioned.\n\n“In 2017, Block expanded toward more traditional banking by introducing the “Cash Card,” a prepaid debit card allowing users to transact outside of their virtual Cash App wallet. In 2018, following bitcoin’s spike in price and popularity, Cash App allowed users to move funds in their Cash App wallet into Bitcoin,”it added.","pubDate":"2023-03-23 16:31:00","image_url":"https://english.cdn.zeenews.com/sites/default/files/2023/03/23/1172410-untitled-design-2023-03-23t215626.668.jpg","id":"b8feffff-86d6-4629-83f7-a0e00213b8a0"},{"content":"Power cuts due to load shedding have reduced the potential size of South Africa’s economy by almost a fifth since they started being imposed around 2008, according to an energy specialist at Africa’s biggest fund manager. Outages can be expected every week this year and if the inadequate electricity generation situation isn’t addressed the prospects for economic growth will be dismal, Lungile Mashele, sector specialist for energy and infrastructure at the Public Investment Corp., told a conference in Johannesburg on Thursday. State power utility Eskom has imposed rotational blackouts on more than 200 days in 2022 and almost every day this year because its old and poorly maintained plants can’t keep pace with demand. The central bank has estimated that the energy crisis will shave 2 percentage points off growth this year. Mashele, whose organisation manages R2.55 trillion, said outages are affecting everything from the timing of surgeries and the slaughtering of chickens to mining production volumes. \"If we had focused on our problems in 2008\" the situation be a lot better today, she said, adding: Other current and potential impacts of the crisis that Mashele laid out in her presentation include: The International Monetary Fund on Wednesday said it has reduced its economic growth forecast for South African for this year to 0.1% from 1.2%, largely because of the outages. \"We really are in a crisis from a growth perspective,\" Annabel Bishop, chief economist at Investec Bank, said at the same conference.","description":"Power cuts have reduced the potential size of SA’s economy by almost a fifth since they started being imposed around 2008, according to an energy specialist at Africa’s biggest fund manager.","id":"05caeaa1-4a59-4406-9dc7-f6d1ae91dfe0","image_url":"https://scripts.24.co.za/img/sites/fin24.png","link":"https://www.news24.com/fin24/Economy/power-cuts-slashed-potential-size-of-sas-economy-by-a-fifth-says-pic-20230323","pubDate":"2023-03-23 16:20:37","title":"News24.com | Power cuts slashed potential size of SA's economy by a fifth, says PIC"},{"content":"The rift between trade unions in the public sector deepened on Thursday with the alliance of unions that went on strike, accusing those that did not of being sweetheart unions and of lying to workers about the 7.5% wage offer by the government. Public sector unions are now split almost down the middle with the non-strikers, which include all public sector unions affiliated to the Federation of Trade Unions of SA (Fedusa) and Cosatu-affiliated SA Democratic Teachers Union (Sadtu) holding 53.9% of votes in the Public Sector Coordinating Bargaining Chamber (PSCBC) and the rest of Cosatu's public sector unions and others with 46%. The slightly smaller, more militant coalition includes the National Education and Health Workers Union (Nehawu); the Police and Prisons Civil Rights Union (Popcru); the Democratic Nurses Union of SA (Denosa); the SA Police Union (SAPU); and other smaller unions. This includes most Cosatu public sector affiliates, except for Sadtu, and unions affiliated with other groups. While the Fedusa-Sadtu coalition has approached its members to consult on government's 7.5% wage increase for 2023/24 to reach a settlement, the more militant group said they rejected it, arguing that after the R1 000 cash gratuity is rolled into the baseline of pensionable salaries, the actual increase amounts only to 2.8%. The R1 000 (after tax) gratuity was a sweetener paid to public sector workers for the last two years to soften the blow of below-inflation increases. While employees got the extra cash in their pockets, the amount was not included in pensionable salaries. The cash gratuity automatically falls away when a new agreement is signed. The rift between the striking unions and the government also deepened last week when the majority unions and government refused the minority the opportunity to re-open 2022/23 wage negotiations in the PSCBC. READ | Government raises wage offer to unions The minority coalition is adamant that the government had made a binding undertaking to re-open talks on the 2022/23 year in return for ending their illegal strike. The last clause of the settlement agreement \"states very clearly that this agreement is binding to all parties\", said the unions in a statement. \"We are now updating our collective membership and the public servants as a whole that once again, the employer has shamelessly refused to negotiate an increment for 2022/23 in line with this binding Settlement Agreement that it has signed,\" they said.","description":"Public sector unions are effectively split down the middle with the dispute growing more bitter by the day.","id":"91d31a86-2ab2-49e8-a053-b5d9a443dc1b","image_url":"https://scripts.24.co.za/img/sites/fin24.png","link":"https://www.news24.com/fin24/Economy/public-sector-union-spat-deepens-as-minority-coalition-rejects-government-offer-20230323","pubDate":"2023-03-23 16:20:37","title":"News24.com | Public sector union spat deepens as minority coalition rejects government offer"},{"title":"Will improve road infrastructure at par with global standards before end of 2024: Nitin Gadkari","link":"https://www.moneycontrol.com/news/economy/will-improve-road-infrastructure-at-parglobal-standards-before-end2024-nitin-gadkari_16937711.html","description":"The minister accepted that the quality of roads is sometimes a concern and there is room for improvement and also expressed the desire to set up an organisation focussed on research and development in the sector.","content":"Minister of Road Transport and Highways, Nitin Gadkari at Moneycontrol Policy Next summit in New Delhi.\n\nIndia seeks to boost its road infrastructure to the standard seen in the world’s largest economy, while also pushing economic growth, according to Nitin Gadkari, Union Minister of Road Transport and Highways.\n\n“There are problems. A strong political will is very important,” Gadkari said at the inaugural MoneyControl Policy Next - The Rs 10 Trillion Infra Push summit in New Delhi. “Where there is a will, there is a way. I like people who get things done.”\n\nThe minister accepted that the quality of roads is sometimes a concern and there is room for improvement. He also expressed the desire to set up an organisation focussed on research and development in the sector.\n\nAs India aims to become a developed economy by 2047, the government has kept an unrelenting focus on boosting infrastructure. India’s spending on infrastructure has gone up manifold times over the last decade to hit a record Rs 10 trillion for the next financial year.\n\nAs part of the same journey, Moneycontrol Policy Next Series of exclusive events was launched on March 23.\n\nMinister Nitin Gadkari, the man behind India’s top infra projects like the Mumbai-Pune Expressway, delivered the keynote address on ‘The highway of the future: My vision for India’.\n\nNothing quite illustrates India's infrastructure push like the money spent and work done by the Ministry of Road Transport and Highways.\n\nIn 2015-16, the total allocation for the road ministry was Rs 46,913 crore. The Budget estimate for 2023-24 is more than five-and-a-half times higher at Rs 2.7 lakh crore. But it is not just about increasing expenditure but its quality too: if capital spending accounted for 59 percent of the total allocation for the road ministry in 2015-16, it is seen at 96 percent in 2023-24.\n\nIn terms of outcomes, the daily National Highway construction rate is often cited, having hit 36.5 kilometres in 2020-21. Admittedly, that has declined to 24.1 kilometres this year.\n\nA challenge, going ahead, also lies on the monetary front. According to a World Bank report from November, India needs to invest $840 billion over the next 15 years into its urban infrastructure to ensure that the needs of the urban population are met. Assuming an exchange rate of Rs 80 per dollar, this means an annual investment of nearly Rs 4.5 lakh crore on just urban infrastructure.\n\nOnly 5 percent of the infrastructure needs of Indian cities are currently being financed through private sources. With the government's current (2018) annual urban infrastructure investments topping at $16 billion, much of the gap will require private financing, the World Bank noted.\n\nGadkari said that the traditional models of funding infrastructure are being given up for innovative financing instruments like bonds.\n\nElectric highways\n\nDevelopment of new planned highway projects, such as the Panipat-Delhi-Jaipur and several others connecting the national capital to different parts of the country, will ensure that the sector takes off for good, the minister said.\n\nThe minister also said that by the end of the year, the Delhi-Chandigarh and Delhi- Dehradun flight routes will be closed because of our efficient highways.","pubDate":"2023-03-23 16:11:02","image_url":"https://images.moneycontrol.com/static-mcnews/2023/03/Gadkari-770x433.jpg","id":"59e0ceb1-86f1-4d85-853f-c5be1034596f"},{"content":"Mayor of Cambridgeshire and Peterborough Dr Nik Johnson will be the authority’s representative at the partnership. Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Joining the rehashed Oxford to Cambridge Partnership will help the Cambridgeshire and Peterborough Combined Authority \"achieve growth\", a report has said. Previously known as the ‘Oxford Cambridge Arc’, the redesigned organisation aims to “champion” the region and help the area to “achieve environmentally sustainable and inclusive growth”. The project had been government led when it was first announced, but in January, Michael Gove, the Secretary of State for Levelling Up, Housing and Communities, confirmed his support for the new ‘pan-regional partnership’ led by public and private sector groups across the Oxford to Cambridge corridor area. A report to the Combined Authority board meeting earlier this week (March 22), said being a part of the partnership could help the authority to meet its own aims. It said: “The Combined Authority’s corporate strategy focuses on four strategic priority areas: achieving good growth; increasing connectivity; ambitious skills and employment opportunities; and enabling resilient communities. Read more: OxCam Arc 'failed' as massive project didn't show what it would offer people “It also recognises that strong partnership working and delivery as a key component in enabling this strategy to be successfully delivered. Membership of the pan-regional partnership will support the Combined Authority in its delivery of the corporate strategy through stronger collaboration, more efficient working and further strengthening joint working and influence with central government”. The board agreed to confirm the Combined Authority’s intention to become a member of the partnership, and appoint the Mayor Dr Nik Johnson as the authority’s representative. READ MORE: OxCam Arc 'failed' as massive project didn't show what it would offer people Cambridge to get £1m to build affordable homes Search for bus companies to take on three at risk Cambs bus routes launches Developer's bid for 425 homes on edge of Cambridge should be refused, planners say Cambourne to Cambridge busway takes step forward as council agrees to submit plans Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire and Peterborough Combined Authority Cambridgeshire Mayor Cambridgeshire","description":"The organisation formally called the Oxford Cambridge Arc has been redesigned with new priorities, the Cambridgeshire and Peterborough Combined Authority thinks matches its own.","id":"936f0f14-27f0-4eb2-8fbc-6e8cb69b2098","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26543843.ece/ALTERNATES/s615/0_BOX_CAMB_Equiano_003JPG.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/combined-authority-agrees-join-oxford-26542684","pubDate":"2023-03-23 16:00:05","title":"Combined Authority agrees to join Oxford to Cambridge Partnership"},{"title":"Journalist Breastfeeding Her Child Forced By IndiGo Crew To Vacate Seat","link":"https://zeenews.india.com/aviation/journalist-blames-indigo-for-forcing-her-to-vacate-seat-while-breastfeeding-infant-on-flight-2586930.html","description":"In her blog, a journalist writes how she was forced to change the front seat despite paying extra for the legroom on an IndiGo flight from Goa to Delhi.","content":"A journalist has lashed out on the IndiGo airline for alleged mistreatment of her, while travelling on one of its domestic flights. Rishika Baruah, a journalist working with NDTV has written a blog, sharing her ordeal while travelling with her child, an infant on a Goa-Delhi flight. She alleges that three male cabin crew members of the India's airline asked her to vacate her seat, while she was breastfeeding her infant. The journalist was sitting on the front row seat, which she booked for extra legroom, and was asked to move to the back of the plane.\n\nAs per the blog, Baruah was travelling back from Goa to Delhi with her child, when the incident took place. She booked the Seat 1F on the flight, same as her flight to Goa from Delhi 5 days before, by paying extra for an additional legroom. She says that the \"customer relations staff confirmed that infant services have been added to my seat and sent me a payment link.\"\n\nFurther, she says that the Delhi-Goa flight was an unadventurous one, with no issue whatsoever. Since Baruah faced no such issue on her onward flight, she decided to book the exact same seat, on the return flight. However, to her surprise, just before take-off, three male employees approached and ordered her to move to the back. \"They threatened to hold the flight until I vacated my seat,\" she wrote.\n\n\"The men argued with me while I was feeding. They refused to look at my previous boarding pass and said they couldn't possibly allow me to fly in the front row because - you guessed it - no oxygen masks for infants and it is \"dangerous\",\" writes Baruah in her blog.\n\n\"My baby started wailing and I didn't have the energy to fight. So, I buttoned up and went to the back rows. With hardly any leg room, my feeding pillow and my baby, I sat there, seething about being forced to get up while breastfeeding, angry at the incessant misinformation, and overwhelmed that my baby was crying,\" she adds.\n\nBaruah says she understands if there's a quiet zone for infants in the flight and \"I may even book it when I am traveling without my son\". According to media reports from 2016, IndiGo took a decision to not offer extra leg room seats to passengers travelling with infants or young children. However, as per Baruah, they don't declare the terms in their infant travel policy or anywhere on their website.\n\n\"I am not judging the merits of the policy. I am questioning IndiGo's decision to be ambiguous, vague and misleading to people travelling with young children. Why is the airline training its staff to mislead and misinform?\" she mentioned in her blog.\n\nSurprisingly, this is not the first time she has faced the similar problem with the IndiGo airline. She started her blog by narrating an incident from December last year, when she was flying with her 40 days old infant out of Delhi. \"I chose IndiGo after carefully reading the infant travel policies of different airlines and checking for the most convenient flights,\" she wrote.\n\nHowever, IndiGo gave her the last row seat as the speakers are too loud at the front and air pressure is \"dangerous\" for a baby at the front, she was told by the airline. \"After I tweeted about IndiGo's infant travel policy, customer relations apologized for what they called a \"misunderstanding\". Not only were we given the front row, but we were greeted with a handmade card and a bouquet at the airport by the airline's staff,\" Baruah mentions.\n\nA closer look at the IndiGo's website reveals that there's no specific instructions by the airline on the seating of parents travelling with an infant. One of the FAQ states that \"No extra seats may be booked for Infants. Infants cannot travel in their own seat and must be seated in an adult's lap.\"\n\nResponding to the incident, IndiGo released a statement saying they will work towards a well-defined infant policy. \"We have taken cognisance of the issue and are working towards a well-defined infant policy to avoid any such experiences in the future. IndiGo is conscious of the needs of its valued customers and it is our constant endeavour to provide a courteous and hassle-free experience to all.\"","pubDate":"2023-03-23 16:00:00","image_url":"https://english.cdn.zeenews.com/sites/default/files/2023/03/23/1171946-indigo-7.jpg","id":"7b55f16f-c2a3-468d-b73b-8366a486828c"},{"content":"Nqobile Bhebhe, Senior Reporter\n\nZANU PF Bulawayo province has released a full set of candidates set to battle for the House of Assemble and local authority tickets to in the harmonised elections.\n\nThe primaries are set for Saturday’s primary elections in readiness for the harmonised national polls.\n\nThe primary elections were initially scheduled for 18 March but were later postponed as the party was overwhelmed with a large number of candidates who wanted to represent it in the forthcoming general elections.\n\nThe ruling party’s Politburo sat on Monday and went through all the reports, province by province and one by one.\n\nA total of 37 party cadres are vying to represent the party in 12 House of Assembly seats.\n\nThe Senatorial constituencies has 10 candidates while the Women’s quota has 15 candidates and one candidate is eying the youth quota.\n\nAccording to the list, Bulawayo North constituency has seven candidates, Lobengula-Magwegwe (4), Bulawayo Central (3), Mpopoma-Mzilikazi (3), Pumula (2), Entumbane- Njube (3), Pelandaba-Tshabalala (3), Nkulumane (2) and Makhandeni-Luveve (2).\n\nThere will be no elections for Nketa, Bulawayo South and Cowdray Park constituencies as the candidates; Cdes George Tshabangu, Raj Modi and Professor Mthuli Ncube are uncontested.\n\nUnder local authority, District Coordinating Committee (DDC 1), 31 candidates where approved, DCC 2 (22), DCC 3 (18), DCC 4 (9) and DCC 5 has 15 candidates.\n\nThe results of the polls will be displayed at the polling stations and also conveyed to the Administrative District Command Centre, Provincial Command Centre and National Command Centre.\n\nIt is only the National Command Centre which will announce official results.\n\nThe ruling party has already set 87 000 cells that have been verified, reaching a total of 4,5 million votes.\n\nZanu PF has set a target of five million votes for the 2023 harmonised polls.","description":"Bulawayo's most popular daily newspaper","id":"a4f91ae5-48d3-4625-a3a0-3fdb2bde63a9","image_url":"https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-32-1.jpg","link":"https://www.chronicle.co.zw/zanu-pf-releases-primary-election-candidates-list/","pubDate":"2023-03-23 15:51:55","title":"Zanu PF releases primary election candidates list"},{"title":"Railway Constable's Brave Act Saves Life Of Passenger Trying To Catch Train: Watch Video","link":"https://zeenews.india.com/railways/rpf-constables-timely-action-saves-life-of-passenger-trying-to-catch-moving-train-watch-video-2587093.html","description":"The video of the alert RPF constable saving the passenger on Bandra Terminus in Mumbai is receiving lots of appreciation for his actions from the netizens.","content":"Video of passengers getting in an accident and being saved by alert officers on railway platforms are often shared on social media. In one such incident, a vigilant Railway Protection Force (RPF) police officer saved a passenger from a fatal accident at Bandra Terminus in Mumbai. The police officer takes quick action saving a passenger trying to board a moving train with luggage in his hands. It is to be noted that the short video clip was shared on Twitter by RPF India's official Twitter handle. The short video starts with showing a moving train at Bandra Terminus Station.\n\nA few seconds later a passenger appears in the frame running with his luggage in his hands trying to catch the train. Later on, the passenger can be seen leaping toward the departing train in an attempt to board the coach before it leaves the platform. However, the passenger fails to get in the gate and instead falls between the train and the platform.\n\nAlso read: Indian Railways Achieves 100 Percent Electrification In Odisha, Joins Uttar Pradesh\n\nMeanwhile, during this whole process, an RPF officer standing at a distance can be seen trying to stop the man from boarding the train. However, he fails to stop the man. After the man falls on the platform, the RPF officer takes quick action and saves the man from falling on the tracks. The officer in the incident has been identified as RPF constable Sushil Kumar who was on his duty at the time.\n\nA #RealHero among us!#RPF Constable Shushil Kumar acted quickly to save a passenger's life at great personal risk when the passenger was trying to board a moving train at Bandra Terminus.#MissionJeewanRaksha #HeroesInUniform #SafetyStartsWithYou @rpfwr1 pic.twitter.com/Y8OYi6GCKs March 21, 2023\n\nThe video was shared on Twitter with the caption, \"A #RealHero among us! #RPF Constable Shushil Kumar acted quickly to save a passenger's life at great personal risk when the passenger was trying to board a moving train at Bandra Terminus.\"\n\nThe video is gaining traction on the social media platform and has been viewed more than nine thousand times with over 800 likes. Furthermore, the video is getting lots of reactions from social media users. Many of the netizens appreciated the RPF constable for his dedication and alert actions on duty. Appreciating the constable, a social media user wrote, \"Hatsoff sirji, you are a rreal-lifehero.\" While another person said, \"Salute to the railway police.\"","pubDate":"2023-03-23 15:41:00","image_url":"https://english.cdn.zeenews.com/sites/default/files/2023/03/23/1172246-untitled-design-2023-03-23t165549.321.jpg","id":"54d05021-823f-4482-a690-59856422044d"},{"content":"The revamped Oxford to Cambridge partnership still faces the problem of getting public support, a conference heard. Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice ‘The Oxford Cambridge Arc failed’ is the message from Cambridgeshire leaders as they look to move the redesigned organisation away from its beginnings. What was previously known as the ‘Arc’ has now become a ‘pan-regional partnership’, led by public and private sector groups in the Oxford to Cambridge corridor area. The organisation is now taking a ‘bottom up approach’ rather than being government led. Political leaders have looked to distance themselves from the ‘Arc’, highlighting the redesigned approach and new priorities of supporting business innovation, but through environmentally sustainable and inclusive growth. The OxCam Arc was initially announced by the government to support innovation and economic growth in the areas between Oxford, Milton Keynes and Cambridge. Plans for one-million homes, a new major road, and the East West Rail project were all linked to the scheme. The road and the homes figure were later dropped and for a while the scheme was believed by some to have been “flushed away”. However, the government has now handed over the reins to regional leaders and groups, who say this change of approach has moved the plans from the “winter and into the spring”. Read more: Cambridge to get £1m to build affordable homes At a Westminster Social Policy Forum conference on the next steps for the Oxford to Cambridge region (March 17), Peter Horrocks CBE, chair of the South East Midlands Local Enterprise Partnership, and board member in the new partnership, said there was a new “dual ambition” for the partnership to support business innovation, but achieve this in an environmentally stable way, and with inclusive growth. This new focus on the environment was stressed by Councillor Bridget Smith, leader of South Cambridgeshire District Council , and the shadow board member for the environment in the partnership. Cllr Smith said she ‘carries the political scars from what was the Arc’, and said the Arc had “failed” as it did not show people living within its area what it would offer them. She said: “It seemed to be about carbon heavy infrastructure and housing, so it was no surprise people saw that as a threat. This move to a bottom up approach is good. As council leaders we all know we have our own problems, we were just hearing about the water problems affecting our area, there are big problems we cannot solve ourselves. “Entering a pan-regional partnership will help addressing those problems that can be solved strategically regionally, that we have no power or ability to solve alone. There was a comment that the last 10 years have been wasted. I have been involved for the last five years, and they have been really productive. “What we have are really good relationships across the Oxford to Cambridge area, they transcend politics and transcend sectors. Everybody, universities, business sectors, all recognise the value of working together and are all excited about the opportunities of the new pan-regional partnership. We know our areas best and we know our problems best, and as I said before we cannot solve them alone.” 'If we work together we have much more choice in addressing the challenges we face' Dan Thorp, policy director at Cambridge Ahead, said it should be a “real priority” for the growth to be more sustainable and inclusive for the people actually living in the area. He said many parts of the region do not feel they are benefitting from what is going on, and said there were “tangible things” that could be done, such as finding ways to support people to access new jobs in the area. Councillor Anna Smith, leader of Cambridge City Council , also stressed the importance that the partnership made sure the benefits of growth were felt by people in the region. She said: “I am really pleased that this is a new pan-regional partnership, I am careful using that term and not the ‘Arc’, as that is something which had very different aims. “I am personally pleased we lost the top down approach and focus on housing targets. This new partnership is and should be about inclusive sustainable economic development that works for all those who live, work and employ people in our region. We really face significant pressures, yes there is great wealth and great opportunities, but there is so much to address to ensure that everyone shares in the successes of this region. “See in my own city, Cambridge is an area where there is significant deprivation side-by-side with companies and world leading universities. Only if we collaborate can we address so many of those challenges because our workers, companies, and transport infrastructure does not fit one district council.” Cllr Smith highlighted the need to improve transport infrastructure to allow people across the region to be able to travel and access the educational and work opportunities. She also said this focus of ensuring the benefits are felt needed to also include the areas on the geographical edges of the partnership corridor, highlighting Fenland in Cambridgeshire . Cllr Smith said: “If we work together we have much more choice in addressing the challenges we face, much more choice of opportunities we have to support residents and support businesses, and demonstrate our region is really open for business.” The conference heard that the new partnership still faced problems the ‘Arc’ had, including with getting public support. Dr Dave Valler, professor of spatial planning at Oxford Brookes University, said there were still questions over whether the partnership could establish a “clear economic rationale for the area” and whether the Oxford to Cambridge corridor “makes sense economically”. He said there were also questions over the “reality” of central government’s continued backing and how much financial support there would be. Dr Valler said there was still “strong opposition” across the areas within the partnership corridor, and said the partnership needed to work on building support. Lord Andrew Lansley, who chaired the conference and is also part of the Cambridgeshire Development Forum, said it would “not be easy” for the partnership, but said it “might be staring in the right place this time, rather than the wrong place”. READ MORE: Cambridge to get £1m to build affordable homes Search for bus companies to take on three at risk Cambs bus routes launches Developer's bid for 425 homes on edge of Cambridge should be refused, planners say Huntingdonshire agrees call out for major housing blueprint Cambourne to Cambridge busway takes step forward as council agrees to submit plans Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire Cambridge","description":"The government led Oxford Cambridge Arc has been redesigned and handed over to regional leaders. But what do the changes mean for people in Cambridgeshire?","id":"5883b1a4-a5d7-44bb-ac8f-b659c202b064","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26542515.ece/ALTERNATES/s615/0_BOX_CAMB_Covid_027JPG.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/oxcam-arc-failed-massive-project-26542321","pubDate":"2023-03-23 15:27:35","title":"OxCam Arc 'failed' as massive project didn't show what it would offer people"},{"content":"The potential congestion charge caused division between supporters and those who oppose the plans. Group 28 Breaking updates from Cambridgeshire's roads, rails and airports Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice The outcome of a council vote has quashed hopes some may have for a referendum for the proposed Cambridge congestion charge . Councillors at Cambridgeshire County Council (CCC) voted on whether or not to hold a referendum for the controversial plans which would see those driving into the city paying a congestion charge in a bid to persuade more people to use buses or 'active travel' options. The decision is a key moment in the lead up to the next expected update from the Greater Cambridge Partnership (GCP) in the summer. It is then that more information on the 'London-style' bus network is expected . Councillors from the CCC, which is run by a Labour, Liberal Democrat and independent alliance, rejected the motion for a local referendum with 32 votes against and 24 in favour at the council meeting at New Shire Hall. If a referendum was approved, residents would be given a straight yes/no vote on May 4, the same date as local elections. The referendum would've cost £1.5m to hold, according to the council agenda . Read more: Calls for Cambridge congestion charge referendum slapped down as issue ‘too complex for yes, no vote’ Speaking about the council decision, Cllr Elisa Meschini, Chair of the GCP’s Executive Board, said it \"makes no sense\" to hold a referendum in May before consultation responses are properly looked through. She said: \"We're still going through the responses to the consultation which will inevitably result in changes to the currently proposed scheme, and then we'll need to decide whether, based on the responses to the consultation, it is possible to design a viable scheme that takes the feedback appropriately into consideration.\" She added: \"A referendum on the 'principle' in May is just a political trick by the opposition, it would give us no useful information and stoke polarisation and misinformation even further among the community.\" Talking about how useful a referendum could be, she did not believe that \"yes/no questions\" were the way to design policy. \"We have a problem to solve in Cambridgeshire with lack of public service infrastructure and we'll have that problem whichever way a referendum goes,\" she said. \"We can't pass the buck by hiding behind the answer to a referendum. We still have a job to do.\" Cllr Heather Williams, the Conservative opposition leader on South Cambridgeshire District Council, said of the vote: “I think it’s very disappointing that we didn’t get a majority but I don’t think this means we give up. \"I felt the debate was interesting, especially to see the other perspective. I was shocked to hear the councillors had a mandate to do it when it wasn’t in their election literature. I fundamentally believe that the the only fair way to decide this is for people to have their own say.” In the debate, Cllr Lorna Dupré, a Liberal Democrat, said the proposal for a “simplistic yes, no referendum” on the charge was the “worst way to solve a complex set of issues” Cllr Williams added: \"I took slight issue with the suggestion it was too complicated an issue for residents to understand, and I think that’s a dangerous road for them to be treading. \"We should never underestimate the electorate's abilities to make decisions. If people don’t understand what’s happening, it’s our job to make it then that’s our failure to keep it accessible, a lazy it's a lazy excuse.\" Lucy Frazer, MP for South East Cambridgeshire said: \"I am disappointed that the motion was rejected by County Councillors, but I will continue to campaign against the GCP proposals which would charge my constituents for driving their cars into the charging zone without offering them a viable travel alternative.\" Neil Mackay, a Committee member of the Cambridgeshire Residents Group (CRG) said of the result of the debate: “What a contentious suggestion that people are not intelligent enough to understand the issues. “None of those councillors were elected on the mandate to vote for the congestion charge, all bar one, and he didn’t even mention it in the election manifesto. They’re just pushing it through on party political grounds, it’s a crazy plan. “They pushed back the results of the consultation until after the May election for obvious political reasons. It’s crazy, you have a situation when you have councillors from Norfolk and Peterborough deciding what happens in Cambridge.\" Sarah Hughes, a spokesperson of the Cambridgeshire Sustainable Travel Alliance said: \"We do not believe that a referendum (local poll) on the congestion charge is the answer. The feedback from the Making Connections 2022 consultation is still under analysis and has not yet been released. \"Referendums are also votes on a single issue, however the Making Connections 2022 consultation is multi-faceted. For these reasons, and others set out in our briefing paper on the matter published on our website cambstravelalliance.org , we welcome the result of the vote at yesterday’s Council meeting.\" READ MORE: Calls for Cambridge congestion charge referendum slapped down as issue ‘too complex for yes, no vote’ Plans for hundreds of new homes on Cambridge sidings would be refused Roads for 1,200 home estate on edge of Cambridge agreed Calls for action on Cambridge road being used by traffic as 'rat-run' Cambridge taxi driver slams state of city's roads after pothole causes £500 damage Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire County Council Cambridge Traffic & Travel Cambridge Congestion Charge","description":"\"It makes no sense to hold a referendum in May when we don't have a scheme on the table yet. We're still going through the responses to the consultation which will inevitably result in changes to the currently proposed scheme.\"","id":"68c8bf14-01c6-4957-9cce-d54b64c77e7a","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26526596.ece/ALTERNATES/s615/0_HB_TMS_210323congestioncharge001.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/holding-cambridge-congestion-charge-referendum-26532067","pubDate":"2023-03-23 15:19:00","title":"Holding Cambridge congestion charge referendum 'makes no sense', says councillor"},{"content":"C huckle if you will but Schumpeter is looking forward to the first live-action “Barbie” film, due out in July. It is directed by Greta Gerwig, maker of “Lady Bird” and “Little Women”, two movies with strong characters. Its trailer is a parody of “2001: A Space Odyssey’‘, which suggests that, love Barbie or loathe her, she will be treated with a knowing wink.\n\nIt is a business turnaround story, too. If the film is a hit, it could crown a comeback for Mattel, one of the world’s biggest toymakers, with brands like Barbie, Hot Wheels and Fisher-Price in its toy box. Five years ago it was in a funk, having lost three CEO s in four years, and a decades-old licence to produce dolls for Disney to its rival, Hasbro. Under Ynon Kreiz, its CEO since 2018, its cost base, balance-sheet, manufacturing footprint and morale have all improved. Last year, to the joy of staff, it won back the Disney contract. A Barbie red-carpet blockbuster would put icing on the cake.\n\nSo it was with a Ken-like spring in his step that your columnist travelled to Monterrey, in northern Mexico, this month to witness the way Mattel has consolidated its North American manufacturing operations into a single Mexican factory, its biggest in the world. He was hoping that Barbie, as well as becoming a star of the silver screen, could also become emblematic of a hot new trend in trade: near-shoring. Among the brightly coloured toys on the assembly line, there was sadly not a Barbie in sight. The only one on display was a prop in the Barbie Dreamhouse, a Tinseltown-like mansion that is one of the plant’s flagship products. In fact, Barbie is not made in Mexico at all. She is still made in Indonesia and China (the first blonde doll was made in Japan in 1959).\n\nThat makes Barbie emblematic of something else entirely: the paradox of today’s supply chains. As well as bringing some production closer to home, Mattel is maintaining global manufacturing operations in Asia. In a business landscape where demand is increasingly hard to forecast, the environment is fragile and the geopolitics unstable, this is the new reality for multinational manufacturers. They need to be global and local at the same time, even if this adds to the complexity of their supply chains.\n\nDespite what American politicians might have you believe, the overriding rationale for near-shoring is not to decouple supply chains from China. As Roberto Isaias, Mattel’s supply-chain chief, puts it, it is to provide flexibility. In some cases, it makes sense to shorten supply chains, in order to be more responsive to changes in consumer demand. In others, it is better to prioritise low-cost production, however far away the factories.\n\nTo understand Mattel’s two-pronged strategy, consider Mexico’s pros and cons. On the plus side, it adjoins the world’s biggest market. It has a free-trade agreement with America and Canada, which eases the cross-border flow of goods and services. The cost of labour has become more competitive with South-East Asia (Chinese labour has been pricier for years). Its workers may not be as target-oriented as their Asian counterparts, but they tend to be more collaborative. Mexicans treat benign employers and colleagues like family, pitching in ideas to make things flow more efficiently, reports Mr Isaias (himself a Mexican). Mexico is also more or less immune to the rising Sino-American rivalry, which introduces an element of risk into all Asian supply chains.\n\nYet Mexico, too, presents some business risks. Though Mattel and Lego, its bigger Danish rival, have been in the Monterrey area for years, the toy industry has yet to nurture an ecosystem of lower-tier suppliers to rival that across the Pacific. The plastic resins used at Mattel’s Monterrey factory, for example, are transported by rail from America and Canada. The toy moulds into which the hot plastics are poured come from China. Asian infrastructure also remains more solid than Mexico’s. In Monterrey Mattel has no complaints about electricity and water supply, the reliability of which can be patchy. But Roberto Durán-Fernández of the Monterrey Technology Institute, a university, says that the recent flood of investments by carmakers such as Tesla to Nuevo León, Monterrey’s home state, could exacerbate the strain on all manner of infrastructure, including roads and housing.\n\nMattel’s Barbie supply chain illustrates these trade-offs. Her Dreamhouse is three storeys high, heavy and expensive—the sort of item that parents splash out for mostly at Christmas-time. Making it in northern Mexico means it can be shipped within 48 hours to Amazon, Target, Walmart and other retailers in America, enabling Mattel to wait until relatively late in the run-up to Christmas to gauge the strength of demand. The proximity to its market also reduces transport-related costs and emissions.\n\nBarbie, the doll, is different. She is just 11.5 inches (29cm) tall and famously svelte. That makes her fairly cheap to ship in bulk from Asia to America. Demand for the dolls is relatively predictable, so the long trans-Pacific transport time poses less of a market risk. And she is intricately made, with well-coiffed locks and tailored garments—the beneficiary of a tradition of handiwork built up over generations in Asian factories. If demand spikes for particular dolls, Mattel can have Chinese subcontractors make them quickly while it ramps up its own production capacity.\n\nDreamsolution\n\nFor Mattel, then, near-shoring is still a work in progress. It is trying to develop local tooling suppliers to reduce the dependence on China. To become a near-shoring powerhouse, Mexico needs that, too. Over time, the hope is that industries from carmaking to toymaking will develop fully integrated supplier networks across the country, in order to reduce overcrowding near the border. As for Barbie, the optimal supply-chain strategy is probably to manufacture her as close to her biggest markets as possible, provided costs are kept reasonable, in order to respond quickly to consumer demand. Though Mr Kreiz, the CEO , no longer thinks of them as consumers. He thinks of them as fans. ■\n\nRead more from Schumpeter, our columnist on global business:\n\nA battle royal is brewing over copyright and AI (Mar 15th)\n\nHow to stop the commoditisation of container shipping (Mar 9th)\n\nLessons from Novo Nordisk on the stampede for obesity drugs (Mar 2nd)\n\nAlso: How the Schumpeter column got its name","description":"Supply chains are neither global nor local. They are both | Business","id":"53bd4d5d-9539-4e5e-b7f7-43e5039f4574","image_url":"https://www.economist.com/img/b/1280/720/90/media-assets/image/20230325_WBD000.jpg","link":"https://www.economist.com/business/2023/03/23/what-barbie-tells-you-about-near-shoring","pubDate":"2023-03-23 15:17:05","title":"What Barbie tells you about near-shoring"},{"content":"Business | No Yeezy answers Can Adidas ever catch up with Nike? The German firm’s new boss has his work cut out Mar 23rd 2023 | BERLIN Share A few years ago it appeared as though Adidas might challenge Nike for the title of the world’s biggest maker of sportswear. The American giant was well ahead, to be sure. But its three-striped German rival had pep in its step. Under Kasper Rorsted, who took over as chief executive in October 2016, Adidas’s revenues shot up—by a cumulative 30% or so in the first three years of his stewardship. A lucrative deal from 2013 to make and sell trainers designed by Kanye West, an American rapper, was paying off handsomely; by 2021 Mr West’s Yeezy line contributed 12% of Adidas’s overall shoe sales. In August that year the company’s market capitalisation reached €67bn ($79bn), more than twice what it had been five years earlier. Today Adidas looks like an also-ran. Revenues were more or less flat in the final three months of 2022, year on year. The company disclosed a quarterly operating loss of €724m. Far from catching up, it is falling further behind Nike, which on March 21st reported quarterly sales of $12bn, 14% higher than the year before and twice those of Adidas, and boasts cushy 13% operating margins worthy of its Air soles. Adidas’s market value is back down to €25bn, one-seventh that of Nike. Investors today appear to have more confidence not just in the swoosh but in Puma, Adidas’s smaller domestic rival (see chart). Some of Adidas’s cramps are the result of factors beyond its control. Inflation pushed up supply-chain costs. The company had to wind down its sizeable business in Russia after the country’s warmongering president, Vladimir Putin, sent tanks into Ukraine in February 2022, provoking an exodus of Western firms from the Russian market. And the increasingly erratic behaviour, including anti-Semitic outbursts, of Mr West (who now insists on being called Ye) led Adidas to cut ties with him in October last year. That left it with millions of unsold pairs of Yeezys, worth some €1.2bn. Unless these are somehow repurposed, the company expects to end 2023 with its first annual operating loss in 30 years, of perhaps €700m. The prospect of a recession in Europe and North America, and uncertainty over China’s economic recovery, present another drag. Bad luck is not the whole story, however. Mr Rorsted’s focus on efficiency and cost, though in some ways welcome, came at a price. He treated Adidas’s retail partners shoddily, preferring to focus on selling directly to consumers through the company’s own shops. He also neglected investments in innovation. Mr Rorsted would have made a fine chief financial officer, says Florian Riedmüller of the Nuremberg Institute of Technology. Instead, he “is an example of what happens when you put the wrong person into the top job”. Adidas’s board thinks it has now found the right one in Bjorn Gulden, who took over as CEO at the start of the year. The Norwegian former professional footballer had helped to turn round Puma, from which he was poached. Mr Gulden’s first task is to decide what to do with all the Yeezys (options include trying to sell them, possibly handing the proceeds to charity, donating them to a good cause, such as the victims of the recent earthquakes in Syria and Turkey, or just binning them). A bigger long-term challenge, says Aneesha Sherman of Bernstein, a broker, is what to do about China. Last year Adidas’s Chinese sales fell by 36%. China’s strict pandemic lockdowns and boycotts of Western brands that expressed concern about China’s treatment of its Uyghur Muslim minority both played a role; Nike’s Chinese sales, too, declined in its latest quarter, by 8%. But unlike Nike, China’s bestselling sportswear brand, which has deftly adapted to local tastes, in particular a growing love of basketball, Adidas has been caught flat-footed. Its Chinese sales have been overtaken by those of Anta, a fast-charging local rival. Now it risks losing the number-three position to another, Li Ning. Mr Gulden calls 2023 a “transition year” that will smooth the path to rebuilding a profitable business in 2024. He plans to cut the dividend, reduce discounts on unsold kit, mend relations with retailers, and invest more in products and in the Adidas brand. That is a start. But if Adidas really wants to catch up with Nike, it will need to pick up the pace—and then some. ■ To stay on top of the biggest stories in business and technology, sign up to the Bottom Line , our weekly subscriber-only newsletter. This article appeared in the Business section of the print edition under the headline \"No Yeezy answers\" Business March 25th 2023 How TikTok broke social media India loosens restrictions on foreign lawyers Can Adidas ever catch up with Nike? Every setback is an opportunity for Ryanair The real next big thing in business automation How to get flexible working right What Barbie tells you about near-shoring From the March 25th 2023 edition Discover stories from this section and more in the list of contents Explore the edition Share Reuse this content More from Business How to get flexible working right It is about schedules as well as locations What Barbie tells you about near-shoring Supply chains are neither global nor local. They are both India loosens restrictions on foreign lawyers For real this time?","description":"The German firm’s new boss has his work cut out","id":"89706668-d0be-4297-826a-578b553c25b8","link":"https://www.economist.com/business/2023/03/23/can-adidas-ever-catch-up-with-nike","pubDate":"2023-03-23 15:17:05","title":"Can Adidas ever catch up with Nike?"},{"content":"Business | Bartleby How to get flexible working right It is about schedules as well as locations Mar 23rd 2023 Share T he words “flexible schedule” have an attractive ring to them. They conjure up a post-pandemic workplace full of motivated workers, organising their time in the most productive and family-friendly way, and of enlightened bosses, attracting and retaining talented employees. But flexibility is in the eye of the beholder. Its appeal can vary depending on the type of job someone is in, and on whose interests are being served. If you are a blue-collar worker in an industry that operates in shifts, for example, flexibility sounds less like nirvana and more like chaos. For low-wage employees in restaurants and call centres, predictability is much more important than flexibility. Various American cities have introduced laws that, among other things, require employers to give workers a set amount of notice when setting their shift rotas. Recent research by Kristen Harknett of the University of California, San Francisco, and her co-authors into the effect of “fair workweek” legislation in Seattle found that the requirement for two weeks’ notice of schedules improved workers’ reported sense of well-being. It can also improve performance. A study conducted by Joan Williams of the University of California College of the Law, also in San Francisco, and others concluded that introducing more stable employee schedules increased sales and productivity at The Gap, a retailer. Certainty matters less for other workers. Research conducted by Donald Sull at the Massachusetts Institute of Technology and his co-authors found that predictable schedules had a marked effect on retention for blue-collar employees but did not affect white-collar ones. For desk-bound workers, the question is different: less whether flexible scheduling is appealing, more whose version of it prevails. In the minds of some bosses, flexibility means that the work week has no defined boundaries. If their day starts at 4:30am on a Peloton, so can yours (minus the Peloton). If there is a blank space in your calendar, they grab it. If they have a question on a Sunday, they send it over by email—and then text, WhatsApp and voicemail, just to make sure that the weekend is genuinely disturbed. It is a wonder they don’t turn up at the doorstep. A recent paper by Maria Ibanez of Kellogg School of Management at Northwestern University found that offering schedule flexibility on job adverts increases the likelihood that people will apply. But it also discovered that applications decrease markedly when adverts require workers to work at managers’ discretion. If workers balk at the boss’s version of flexible scheduling, managers have a different worry: that giving employees too much control over their hours can backfire. Asynchronous working, which involves individuals contributing to a project in their own time, is all very well. But if teams are to function effectively then they sometimes have to work as a group. Managers can have perfectly legitimate reasons to contact employees at odd hours and to expect an immediate response. Compressing work weeks into four days might well give workers more time to pursue their love of kayaking but be less brilliant for customers. Just as a blend of home and office is a sensible answer to demands for flexibility in location, a mixed approach is the right way to think about flexible schedules. Brian Elliott runs research into the future of work for Slack, a messaging firm. He specifies “core collaboration hours” for his own team, which is when most meetings and group activities happen. The company has instituted “focus Fridays”, a day when there are no internal meetings and employees get on with their own tasks. If Mr Elliott does need to contact people outside working hours, he does so by text so they are not logged in all the time. Boundaries of this sort will upset the absolutists. Managers have to think harder about interrupting people. Workers cannot pick and choose their hours at will. But a bit of thought can stop people from being their own worst enemies. For bosses, getting a swift answer to an unimportant question causes more trouble than it is worth. For employees, the flexibility to work outside standard hours is double-edged: Laura Giurge of London School of Economics and Kaitlin Woolley of Cornell University have found that choosing to work at a weekend or on a bank holiday reduces motivation precisely because these days are associated in their minds with non-work activities. For flexibility to be genuinely useful, it requires a firm skeleton. Read more from Bartleby, our columnist on management and work: From high-speed rail to the Olympics, why do big projects go wrong? (Mar 16th) The small consolations of office irritations (Mar 9th) The uses and abuses of hype (Mar 2nd) Also: How the Bartleby column got its name This article appeared in the Business section of the print edition under the headline \"Time management\" Business March 25th 2023 How TikTok broke social media India loosens restrictions on foreign lawyers Can Adidas ever catch up with Nike? Every setback is an opportunity for Ryanair The real next big thing in business automation How to get flexible working right What Barbie tells you about near-shoring From the March 25th 2023 edition Discover stories from this section and more in the list of contents Explore the edition Share Reuse this content More from Business Can Adidas ever catch up with Nike? The German firm’s new boss has his work cut out What Barbie tells you about near-shoring Supply chains are neither global nor local. They are both India loosens restrictions on foreign lawyers For real this time?","description":"It is about schedules as well as locations","id":"d2bb0718-5400-4b73-aa09-a41d0888974f","link":"https://www.economist.com/business/2023/03/23/how-to-get-flexible-working-right","pubDate":"2023-03-23 15:17:05","title":"How to get flexible working right"},{"content":"Business | Big law in India India loosens restrictions on foreign lawyers For real this time? Mar 23rd 2023 | Mumbai Share P rotracted legal battles are common in India. One of the longest-running of all concerns who is allowed to practise law in the country. On March 10th the Bar Council of India quietly released an announcement that, though armed with inevitable caveats, removed some of the restrictions that have for decades kept most foreign lawyers from plying their trade on Indian soil. “With this, the legal practice of India enters a new era,” says Vyapak Desai of Nishith Desai Associates, a rare Indian law firm with offices abroad. Since independence in 1947 India has, in the name of self-sufficiency, created barriers to entry for outsiders in many industries. As elsewhere in the world, the legal profession was deemed particularly sensitive. So sensitive that, in 1961, the Advocates Act required all lawyers to be Indian citizens. At the urging of the central bank, the Foreign Exchange Regulation Act of 1973 created an exemption. Foreigners were still barred from representing clients in courtrooms but they could advise them on things like contracts and mergers. By the 1990s a handful of foreign firms had set up shop in India, including giants like White & Case, a big New York firm. Then, in 2009, the Supreme Court ended the exemption. Foreign lawyers keen to maintain a toehold in India’s growing economy resigned themselves to establishing “best friend” relationships with local law firms. This enabled non-Indian lawyers to pay Indian clients brief visits. Still, to avoid the attendant hassle, many preferred to meet instead in London, Singapore or, more recently, Dubai. Under the new rules, which have received the government’s imprimatur, foreign lawyers can stay in India for 60 days a year—or permanently, if they register with the authorities. They may advise foreign firms in India on matters of international law. They still may not appear before any tribunal, regulatory authority or other forum with “trappings of a court”. With one exception: foreigners will be able to represent clients before Indian panels in cases of international commercial arbitration. This carve-out hints at the reasons behind the Bar Council’s reform, notes Burzin Somandy of Somandy & Associates, a law firm in Mumbai. As the council itself explains in its decision, “experience and facts show” that multinational companies prefer going to foreign arbitration panels to have their Indian claims heard. The hope seems to be that foreign businesses would keep such proceedings in India if they can be represented by their foreign counsel. And that, in turn, would boost confidence in the Indian legal system—and, by extension, India’s economy. Robust legal logic? The jury is out. ■ To stay on top of the biggest stories in business and technology, sign up to the Bottom Line , our weekly subscriber-only newsletter. This article appeared in the Business section of the print edition under the headline \"The cost of legal admission\" Business March 25th 2023 How TikTok broke social media India loosens restrictions on foreign lawyers Can Adidas ever catch up with Nike? Every setback is an opportunity for Ryanair The real next big thing in business automation How to get flexible working right What Barbie tells you about near-shoring From the March 25th 2023 edition Discover stories from this section and more in the list of contents Explore the edition Share Reuse this content More from Business Can Adidas ever catch up with Nike? The German firm’s new boss has his work cut out How to get flexible working right It is about schedules as well as locations What Barbie tells you about near-shoring Supply chains are neither global nor local. They are both","description":"For real this time?","id":"c3723014-63c1-45c3-bd00-c0dc79ebd691","link":"https://www.economist.com/business/2023/03/23/india-loosens-restrictions-on-foreign-lawyers","pubDate":"2023-03-23 15:17:04","title":"India loosens restrictions on foreign lawyers"}]