[{"title":"Health warning issued for Okawa Bay at Lake Rotoiti and Lake Okaro - Toi Te Ora Public Health","link":"http://www.voxy.co.nz/health/5/414618","description":"A health warning has been issued today for Okawa Bay at Lake Rotoiti and for Lake Okaro.","content":"A health warning has been issued today for Okawa Bay at Lake Rotoiti and for Lake Okaro. The health warning is based on the results released today for levels of cyanobacteria, or algal bloom, in water samples, visual assessments and satellite imagery provided by the Bay of Plenty Regional Council. Today’s warning extends previous health warnings issued for Lake Rotorua, the Ohau Channel, Te Weta Bay and the Okere Arm of Lake Rotoiti, as well as for the upper Kaituna River and at Waitangi on the Kaituna River. There are also health warnings for cyanobacteria in place at Lake Maraetai and Lake Rotoehu. \"It is important to avoid any activity which results in contact with the lake water when a warning is in place,\" says Dr Lynne Lane, Medical Officer of Health at Toi Te Ora Public Health. Cyanobacteria can release toxins which can trigger asthma and hayfever symptoms, skin rashes, stomach upsets, and in some cases neurological effects such as tingling around the mouth, headaches, breathing difficulties and visual problems. \"Algal mats and scum may also accumulate along the shoreline of the lake and so it’s especially important that parents ensure that children avoid contact with these as they may be toxic,\" says Dr Lane. Dogs are particularly at risk and should also be kept away from the shoreline. Elsewhere in New Zealand there have been reported deaths of dogs that have eaten algae on shorelines. Dr Lane advises the public to keep an eye out for signs of algal blooms if using lakes or rivers in our region. \"Algal blooms can develop rapidly and unpredictably. If the water looks discoloured, has an unusual smell, or has green or brown particles floating in it then it is best to avoid contact with it.\"","pubDate":"2023-03-24 03:08:45","image_url":null,"id":"a2a599d2-bc9e-4d5b-8edb-86fa2549e4a4"},{"title":"'Excited for the future' - RANZCOG","link":"http://www.voxy.co.nz/health/5/414615","description":"Dr Gillian Gibson is looking forward to when she becomes RANZCOG President later this year. \"RANZCOG has an important role in ongoing advocacy for women’s health needs, and I welcome the opportunity to lead that,\" Gill says.","content":"Dr Gillian Gibson is looking forward to when she becomes RANZCOG President later this year. \"RANZCOG has an important role in ongoing advocacy for women’s health needs, and I welcome the opportunity to lead that,\" Gill says. Gill will take up the position of President-Elect until November 2023, then step in to the position of College President for a two-year term. She will become the second female President of RANZCOG-. She will also become the second New Zealander to hold the office. \"I hope my election will motivate and inspire a succession of women in senior College leadership, building on the significant advances the College has made in the areas of gender equity and diversity,\" she says. Gill is Deputy Chair of the College’s Gender Equity and Diversity Working Group. \"We are on a journey and have a clear commitment to diversity, equity and inclusion.\" Extensive experience Gill has been a full-time Auckland-based Generalist Obstetrician and Gynaecologist for 25 years, combining public and private practice. She currently holds Medical Officer and Service Clinical Director positions at Te Whatu Ora | Te Toka Tumai Auckland (formerly Auckland District Health Board). Gill has been involved in College activities for much of her professional life, joining Te KÄhui Oranga Å Nuku (formerly the New Zealand Committee) nearly 20 years ago. She has served two terms on the Council and two terms on the Board, culminating in her current Vice-President (New Zealand) role. She has chaired several standing committees and working groups of the College. Priority issues Gill says she looks forward to pursuing the objectives set out in the College’s Strategic Plan; however she nominates workforce issues and access to sexual and reproductive health services as two key areas. \"As Chair of the New Zealand Workforce Working Group I have a deep understanding of the challenges the College faces for future workforce planning,\" she says. \"Aiming to keep maternity services open, an issue for both regional and rural Australia and Aotearoa New Zealand, will require government support for expanding projects such as the successful OGET pilot (rural upskilling and training) and improving access for GPOs to ongoing procedural training. Improved access to sexual and reproductive health services in Australia and Aotearoa New Zealand requires government commitment, and responsibility as a College to train future specialists with the necessary skills. \"RANZCOG has an important role in ongoing advocacy for women’s health needs. Over the past 20 years in Aotearoa New Zealand, I have helped successfully advocate for a maternity quality framework, abortion law reform, improvements to the cervical screening programme, MÄori women’s health issues and most recently incorporating a women’s health strategy into New Zealand health legislation.\" Away from work Gill loves nothing better than spending time with her friends and family, including her daughter, who has recently qualified as a GP.","pubDate":"2023-03-24 02:47:59","image_url":null,"id":"0847f44b-eda9-4c14-8297-37aa22deb322"},{"title":"CDC report finds more children in U.S. diagnosed with autism due to better screening","link":"https://abc13.com/autism-diagnosis-cdc-developmental-disabilities-childhood/12999180/","description":"In 2020, about 1 in 36 children had been diagnosed with autism by age 8, the CDC says. That's up from 1 in 150 children in 2000.","content":"The rate of children diagnosed with autism in the United States has been growing steadily since 2000, but two new reports from the US Centers for Disease Control and Prevention highlight disparities in the types of children identified to have autism spectrum disorder and setbacks in early detection. In 2020, about 1 in 36 children had been diagnosed with autism by age 8, according to the CDC -- about 2.8%. That's up from a prevalence of 1 in 44 children in 2018 and 1 in 150 children in 2000. But according to the CDC, this long-term trend has \"largely been interpreted as improvements in more equitable identification of (autism spectrum disorder), particularly for children in groups that have less access or face greater barriers in obtaining services.\" For the first time, diagnosis was more common among Asian, Black and Hispanic children than it was among White children. The CDC researchers note that this shift \"may reflect improved screening, awareness, and access to services among historically underserved groups.\" In fact, between 2018 and 2020, autism prevalence rose more than twice as fast among Asian, Black and Hispanic children than it did among White children. These findings are based on surveillance data from 11 communities that participate in the CDC's Autism and Developmental Disabilities Monitoring Network. The data are not nationally representative and vary widely by location -- from a prevalence of 1 in 22 children in California to about half as many in Maryland. The CDC says more research is needed to understand this variation, which could be related to differences in the strategies used to identify and diagnose the condition. Still, some trends have stayed consistent. Autism prevalence is significantly higher among boys than girls -- in 2020, there was about a four-fold difference. But it was the first year that more than 1% of 8-year-old girls had been diagnosed with autism. Also, disparities persist in identifying autism in children who also have an intellectual disability. In 2020, more than half of Black children diagnosed with autism also had an intellectual disability, compared with less than a third of White children. According to the researchers, this finding suggests a need to better detect and evaluate developmental concerns beyond cognitive ability. Generally, children who have intellectual disabilities are more likely to be diagnosed with autism earlier. But early detection is important for all children with autism, as it helps connect them with helpful resources and interventions. In recent years, good progress had been made in early detection of autism -- an earlier CDC report found that children born in 2014 were 50% more likely to receive an autism diagnosis or special education by age 4 than those born in 2010. Another new report published by the CDC on Thursday shows that there was evidence of continued improvement in these trends through February 2020, but the trends reversed as the COVID-19 pandemic hit with \"sustained lower levels\" of evaluations and identification of autism across most of the surveillance network. In first six months of the pandemic, there were 217 fewer evaluations for every 1,000 children at age 4 than there were four years earlier. There were also nearly three fewer identifications for every 10,000 children, according to the CDC report. \"Disruptions due to the pandemic in the timely evaluation of children and delays in connecting children to the services and support they need could have long-lasting effects,\" said Dr. Karen Remley, director of CDC's National Center on Birth Defects and Developmental Disabilities. \"The data in this report can help communities better understand how the pandemic impacted early identification of autism in young children and anticipate future needs as these children get older.\"","pubDate":"2023-03-24 02:41:48","image_url":"https://cdn.abcotvs.com/dip/images/12999771_autism-cleanTN.jpg","id":"49ef6451-028a-4a1d-8a59-5c54549c22d4"},{"title":"Ontario Fire Marshal authorizes closure of Care Centre in Cornwall","link":"https://ottawacitizen.com/news/local-news/ontario-fire-marshal-authorizes-closure-of-care-centre-in-cornwall","description":"The building is owned by a numbered company that purchased the property back in 2014 for $2 million.","content":"Share this Story: Ontario Fire Marshal authorizes closure of Care Centre in Cornwall Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr Breadcrumb Trail Links News Local News Ontario Fire Marshal authorizes closure of Care Centre in Cornwall The building is owned by a numbered company that purchased the property back in 2014 for $2 million. Author of the article: Cornwall Standard-Freeholder Published Mar 23, 2023 • Last updated 39 minutes ago • 3 minute read Join the conversation A 2020 file photo of The Care Centre at Second and Marlborough streets in Cornwall. Photo by Francis Racine / POSTMEDIA Article content CORNWALL — The Ontario Fire Marshal’s office has given Cornwall Fire Services authority to close the Care Centre at 510 Second St. Advertisement 2 Story continues below This advertisement has not loaded yet, but your article continues below. THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY Subscribe now to read the latest news in your city and across Canada. Unlimited online access to articles from across Canada with one account Get exclusive access to the Ottawa Citizen ePaper, an electronic replica of the print edition that you can share, download and comment on Enjoy insights and behind-the-scenes analysis from our award-winning journalists Support local journalists and the next generation of journalists Daily puzzles including the New York Times Crossword SUBSCRIBE TO UNLOCK MORE ARTICLES Subscribe now to read the latest news in your city and across Canada. Unlimited online access to articles from across Canada with one account Get exclusive access to the Ottawa Citizen ePaper, an electronic replica of the print edition that you can share, download and comment on Enjoy insights and behind-the-scenes analysis from our award-winning journalists Support local journalists and the next generation of journalists Daily puzzles including the New York Times Crossword REGISTER TO UNLOCK MORE ARTICLES Create an account or sign in to continue with your reading experience. Access articles from across Canada with one account Share your thoughts and join the conversation in the comments Enjoy additional articles per month Get email updates from your favourite authors Don't have an account? Create Account or View more offers If you are a Home delivery print subscriber, unlimited online access is included in your subscription. Activate your Online Access Now Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Ontario Fire Marshal authorizes closure of Care Centre in Cornwall Back to video This move marks the latest challenge for the centre, which has offered a variety of tenancies and services since its current owners purchased the former Cornwall General Hospital site in July 2014. Cornwall firefighters and police officers were at the site Thursday morning, notifying residents and other tenants. A release from the City of Cornwall said human services department staff members were also on-site, along with the city’s command-centre vehicle, to provide tenants with information on obtaining alternate accommodations. Anyone living at the Care Centre can also call 613-933-6282 ext. 2309 to inquire about support for relocation. A resident in the building named Daniel said he’d received notice Thursday as police and firefighters were on-scene to give the news to tenants. Article content Advertisement 3 Story continues below This advertisement has not loaded yet, but your article continues below. Article content Cornwall Fire Services said it had conducted several fire-safety inspections within the building, identifying numerous serious violations under the Ontario Fire Code that would increase the risk of injury. Those violations were what triggered the fire service’s request to the Ontario Fire Marshal for authority to close the building to all tenancies. Cornwall Fire Chief Matthew Stephenson said confidentiality and the relationship with the owner meant the fire service wasn’t disclosing any details about specific fire-code violations. He confirmed the service had been working with the owners about those concerns, even conducting a fire drill mentioned by the resident about a week and a half ago. “These are life-safety issues and they were of such a critical nature that it warranted our conversation with the Ontario Fire Marshal’s office and their followup,” Stephenson said. “These are current issues we’ve identified and of a nature that requires this level of action.” Advertisement 4 Story continues below This advertisement has not loaded yet, but your article continues below. Article content Stephenson said the fire service and the city were cognizant of the feelings the order might create among residents and tenants, and Cornwall was working to ensure every resident would end up in equal or better accommodations than they had at the Care Centre. Once those people’s needs are tended to, Stephenson confirmed, it would be up to the owners to address the safety issues and pass inspection before anyone was allowed to return. The Care Centre is owned by 2416300 Ontario Inc., which as recently as the beginning of November 2022 was led by Matthew Cinnamon and Daniel Orr. The numbered company purchased the property back in 2014 for $2 million, and 2022 property records show a charge (loan/mortgage) against the property to 9448-1462 Quebec Inc. for $1.3 million. Advertisement 5 Story continues below This advertisement has not loaded yet, but your article continues below. Article content Over the years, the Care Centre has had conflicts with the City of Cornwall and other agencies. At the heart of many of them was the owners’ insistence they had not changed the use of the building from those allowed while it was a hospital. This insistence often came into conflict with the owners’ marketing of the property as a seniors’ residence. Over the years it also offered space to several non-profit organizations and hosted medical offices for physicians and other health services. Most recently, the centre ran into building-permit problems when it was making leasehold improvements for a space to be used by the Mohawk Council of Akwesasne as a shelter healing centre in the summer of 2021. The MCA had planned to operate an 11,000-square-foot facility there, but, when the Care Centre couldn’t get two permits closed, it abandoned those plans. Advertisement 6 Story continues below This advertisement has not loaded yet, but your article continues below. Article content In the fall of 2020, the Ontario Court of Justice rejected a Care Centre appeal of a decision forcing the owners to file a change-of-use permit with the city. While the Care Centre had argued it was still operating the building as a hospital, the city disagreed because owners had been renting spaces to tenants to live in and was marketing itself as a seniors’ residence. That decision bolstered one made by the Retirement Home Regulatory Authority in October 2020, when it ordered the Care Centre to apply for a retirement-home licence. In the summer of 2020, the city stepped in to provide hot water to the building under its Vital Services Bylaw after a Care Centre dispute with Cornwall District Heating over non-payment. Recommended from Editorial One-year-old Ottawa girl overdosed on fentanyl, saved at CHEO Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline Share this article in your social network Share this Story: Ontario Fire Marshal authorizes closure of Care Centre in Cornwall Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr Comments Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings . Join the Conversation Trending McGill remains the top university in Canada, according to these rankings One-year-old Ottawa girl overdosed on fentanyl, saved at CHEO Police officer borrows citizen's bike to chase down traffic suspect Online petition targets OCDSB trustee who cut off speech against trans students' use of washrooms What you should know about U.S. president's visit to Ottawa this week Latest National Stories Advertisement 1 Story continues below This advertisement has not loaded yet, but your article continues below. This Week in Flyers","pubDate":"2023-03-24 00:49:12","image_url":null,"id":"625dcace-1561-49e0-a082-cdb341abdbfc"},{"title":"You Don’t Even Have to Leave Your Sickbed to Get a Medical Certificate Now","link":"https://www.lifehacker.com.au/2023/03/doctors-certificate-quickly-updoc/","description":"One of the worst parts about getting sick is having to muster up the courage to drag yourself into the... The post You Don’t Even Have to Leave Your Sickbed to Get a Medical Certificate Now appeared first on Lifehacker Australia.","content":"One of the worst parts about getting sick is having to muster up the courage to drag yourself into the doctor’s surgery just to get a medical certificate to send to your boss when all you want to do is crawl into a dark hole and rest. Luckily, we’re here to take some of that pain away by introducing you to Updoc. Updoc is a trusted Aussie health platform that allows users to get legit online medical certificates or consult with doctors without having actually to go into a doctor’s surgery. Yep, that means you don’t even have to leave your bed. While it does sound too good to be true, it’s actually a super simple process. All you have to do is complete a quick consultation form with your health concerns/why you’re feeling awful, then an independent registered Aussie partner doctor will review the consultation. If approved, they will send a medical certificate directly to your inbox within a few hours. Alternatively, if you need more of a general consult, you can now easily speak with a registered Health Practitioner about any health-related issues you need help with from anywhere in Australia. If required, they’ll get you sorted with a prescription or a referral or provide you with a medical certificate and send it immediately to your inbox. Surprisingly, it won’t cost you an arm and a leg, with consults for medical certificates starting from just $19.95. General consultations also start from $49.95. General consultations are available from 9am to 10pm on weekdays and 9am to 5pm on weekends, and can be accessed from anywhere in Australia. If you’re just after a standard medical certificate, you can submit a request at any time of day throughout the week, and Updoc will get to your request urgently within the next day. All of Updoc’s certificates are valid documents and meet all the requirements of the Fair Work Act 2009 — which requires providing enough evidence that the employee was genuinely entitled to the sick or carer’s leave. Your employer is allowed to ask for more evidence if they require it, and employers can validate the authenticity of certificates through the “employer verify” section of Updoc’s website . So long, waiting rooms. If you’d like to learn more about Updoc, you can head over to its website here .","pubDate":"2023-03-24 00:45:32","image_url":"https://www.lifehacker.com.au/wp-content/uploads/sites/4/2023/03/24/iStock-1360140094.jpg?quality=80=1280,720","id":"1806318f-d842-4c42-9c63-421b8c244ec7"},{"title":"Check your ticket! Adelaide winner scoops $10.6m Powerball jackpot","link":"https://www.themercury.com.au/lifestyle/adelaide-winner-scoops-106m-powerball-jackpot-in-draw-1401/news-story/3441d7af6986dcfe04bb878abaf0ba32","description":"A Powerball player who bought their ticket at Glenelg is Australia’s newest multimillionaire, taking out last night’s entire $10.6m jackpot.","content":"But the winner may still be unaware of their newfound fortune – the ticket was not registered to a player card and officials from The Lott are still waiting for the winner to contact them.The winning ticket was purchased at Kylie Brown’s Newsagency in Bayside Shopping Village, on the corner of Jetty Rd and Brighton Rd, Glenelg. The winner will receive $10,626,592. They are the second South Australian to take out the Powerball division one prize this month, after a Huntfield Heights woman won $4.6m on March 9.Winning numbers in Powerball draw 1401 on Thursday 23 March 2023: 4, 5, 7, 18, 19, 25, 26 | Powerball: 15This article is unlocked and free to read. Get full digital access to trusted news from The Advertiser and Messenger with our great introductory offer.“It honestly feels so good! We were so close when we sold a division two in Powerball before and have been waiting to sell the big one ever since,” said Kylie Brown, who owns the newsagency where the winning ticket was sold.It continues a strong winning streak for SA lotto players in recent months. Last weekend a Whyalla man won $1.8m in Saturday Lotto, at the start of January an OzLotto player from Findon won $20m, and there were two big local wins in December. An Echuca woman won $40m on Powerball in February, continuing an unusual spate of huge lotto wins over the past 12 months. On December 29, three winners split a $100m jackpot while a NSW player pocketed $50m on November 24. Two people each won $63.3m in February 2022, a Canberra man scored $60.7m in June, a mum from Snowtown in SA snaffled $40m in September and three winners shared $53.3m each in the record-breaking $160m jackpot in October.AA Subscriber Exclusives for free storiesIf you didn’t strike it big don’t be disheartened, the odds of winning the Powerball division one jackpot with a single game are a mere one in 134,490,400.But this list of Australia’s 10 biggest lotto winners of all time shows that sometimes incredible good fortune does strike. In 2019, a Sydney nurse became Australia’s current individual lottery record-holder when she won $107,575,649.Powerball is drawn from two barrels. Seven numbers are drawn from the main barrel with balls numbered 1-35, and one Powerball is drawn from a pool of numbers 1-20.You can cut your odds by buying a PowerHit entry, which guarantees you get the Powerball number, but that of course costs a lot more for a ticket.","pubDate":"2023-03-24 00:21:00","id":"8e0d9459-97bf-4802-851f-5414db1fb151"},{"title":"CDC report finds more children in U.S. diagnosed with autism from boost in early detection","link":"https://6abc.com/autism-diagnosis-cdc-developmental-disabilities-childhood/12999180/","description":"In 2020, about 1 in 36 children had been diagnosed with autism by age 8, the CDC says. That's up from 1 in 150 children in 2000.","content":"In 2020, about 1 in 36 children had been diagnosed with autism by age 8, the CDC says. That's up from 1 in 150 children in 2000.","pubDate":"2023-03-23 23:41:59","image_url":"https://cdn.abcotvs.com/dip/images/12999099_032323-kabc-md-autism-report-vid.jpg","id":"22c4f5e7-32ad-4ddf-92ec-83404a9eb780"},{"title":"Minnesota House set to debate and pass \"trans refuge\" legislation","link":"https://www.cbsnews.com/minnesota/news/minnesota-house-set-to-debate-and-pass-trans-refuge-legislation/","description":"\"We have a responsibility to create more space for our community to live their fullest, authentic lives without fear of violence, rejection, abuse or political attack,\" said Rep. Leigh Finke.","content":"-- Supporters of a bill up for debate Thursday night say it will make Minnesota a \"refuge\" for transgender people. Democrats pushing the legislation forward say it will protect trans patients and providers of gender-affirming care from legal action in other states where such care is banned or restricted. It's structured similarly to a proposal that passed the House earlier this week that's works as a for people seeking and providing abortions at a time when laws vary after the fall of Roe v. Wade. \"We have a responsibility to create more space for our community to live their fullest, authentic lives without fear of violence, rejection, abuse or political attack,\" said Rep. Leigh Finke, DFL-St. Paul, elected to the Minnesota Legislature. The legislation prohibits enforcing out-of-state subpoenas, arrest warrants and extradition requests for people from other states who sought treatment that is legal in Minnesota. It also bars enforcement of court orders elsewhere to remove children from their parents' custody for getting gender-affirming care. The effort comes as 10 states now prohibit gender-affirming care for minors, including Iowa and South Dakota, according to an Some policies are blocked in court. DFL lawmakers say the bill ensures transgender children and adults have a safe haven in Minnesota when other states are hostile to them. Republicans ahead of the floor debate held a news conference condemning the effort as the Democrats' \"transgender health care sanctuary state\" bill that runs afoul of the constitution and puts children at risk. They've raised questions and concern about the long-term impact of certain treatments. \"House File 146 undermines parental rights and most concerningly has zero guardrails to protect our kids,\" said Rep. Peggy Scott, R-Andover. Many medical groups, including the American Academy of Pediatrics, support youth access to care, which doctors say means something different to each patient and family. Dr. Angela Kade Goepferd with Children's Minnesota said that gender-affirming care that involves surgical procedures is \"incredibly rare\" for minors under 18 and physicians at Children's Minnesota do not perform such surgeries \"The vast majority of gender-affirming care is medication based or supportive services for families,\" she said. Gov. Tim Walz recently designed to protect gender-affirming care. Finke said that action recognizes the \"urgency\" around threats to trans people, but the making it law makes protections stronger. \"It's just absolutely crucial that we keep doing this work to build these protections and not worry about what could happen in the future. We need a law behind it,\" she said. Caroline Cummings is an Emmy-winning reporter with a passion for covering politics, public policy and government. She is thrilled to join the WCCO team.","pubDate":"2023-03-23 23:35:54","image_url":"https://assets3.cbsnewsstatic.com/hub/i/r/2023/03/23/ca39c93f-6ab4-4cd9-8825-925ca533480b/thumbnail/1024x576/407ad3ca4de440a410efe7ceaea98c2e/trans-refuge-sot-5p-wcco32md.jpg","id":"5330ce3b-d5b8-4dea-94d3-54979190b516"},{"title":"CDC Warns of Rising Drug-Resistant C. auris Infections - Mirage News","link":"https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL2NkYy13YXJucy1vZi1yaXNpbmctZHJ1Zy1yZXNpc3RhbnQtYy1hdXJpcy05NzM1NDIv0gEA?oc=5","description":"CDC Warns of Rising Drug-Resistant C. auris Infections  Mirage NewsSuperbug fungus cases rose dramatically during pandemic  Al Jazeera EnglishFrightening new fungus 'candida auris': What is it? Who is susceptible?  Fox News‘Very disturbing’: What to know about the potentially deadly fungus spreading in the US  The HillAmid rising cases of Candida auris, ‘a serious global health threat’, in the US, know who is at an increased risk  The Indian ExpressView Full coverage on Google News","content":"CDC Warns of Rising Drug-Resistant C. auris Infections  Mirage NewsSuperbug fungus cases rose dramatically during pandemic  Al Jazeera EnglishFrightening new fungus 'candida auris': What is it? Who is susceptible?  Fox News‘Very disturbing’: What to know about the potentially deadly fungus spreading in the US  The HillAmid rising cases of Candida auris, ‘a serious global health threat’, in the US, know who is at an increased risk  The Indian ExpressView Full coverage on Google News","pubDate":"2023-03-23 22:45:00","id":"12c02eb8-a28c-46c2-8869-69b6bd50ba96"},{"title":"Does It Matter What Time I Go To Bed?","link":"https://www.lifehacker.com.au/2023/03/does-it-matter-what-time-i-go-to-bed/","description":"Some of us love to be tucked up in bed by a particular time every night, ensuring a certain number... The post Does It Matter What Time I Go To Bed? appeared first on Lifehacker Australia.","content":"Some of us love to be tucked up in bed by a particular time every night, ensuring a certain number of hours of sleep. Others go to bed when they start to feel tired, or when they’ve finally finished everything they wanted to get done, and get up when they need to in the morning. But does it matter what time you go to bed? Getting a good night’s sleep can improve brain function, mood, metabolic health and immunity. Not getting enough sleep or having poor sleep quality increases the risk of infections and other health problems such as depression, dementia, weight gain, diabetes and high blood pressure. Recent studies even suggest not getting enough sleep at night can also increase the risk of developing long COVID . Perhaps surprisingly, sleeping for seven to eight hours is associated with better health outcomes than shorter or longer sleeps. The timing of our sleep is orchestrated by the so-called “ circadian clock ”, the body’s internal biological timekeeper. It helps regulate many processes on a daily basis including the timing of our sleep-wake cycle. During evolution, living species – from bacteria and plants to humans – have acquired a circadian clock to optimise bodily processes in an environment that changes throughout the day. Consequently, almost all aspects of behaviour, physiology and metabolism are rhythmically organised to anticipate these daily changes. While we are, in theory, able to sleep at any time during the day as long we’re sufficiently tired, our circadian clock dictates us to be “diurnal”, meaning we’re active during the day and sleep during the night. Working against this default stage – by doing shift work , where we work regular shifts at night or alternate between shifts, or staying up longer/waking up later over the weekend – can result in poorer health because it disconnects our physiology and behaviour from our internal circadian clock that is supposed to organise it. Even the apparently harmless weekend sleep-in after a late night increases the risk of obesity and mental health issues. Indeed, this regular shift in our sleeping schedule every weekend creates a so-called “social jetlag” that, to some extend, mimics the effect of shift work. Our individual biological night (when our body thinks it’s night) may differ substantially from the actual environmental night (when it’s actually night time). But our modern society doesn’t really support going to bed late and waking up later in the day. It can be even considered a sign of poor self-discipline and laziness. We’re told “the early bird catches the worm”, or that early risers have an advantage over late risers and tend to be more productive and successful. But our sleep preferences are not really a matter of choice: they are mainly driven by our genes and depend on our chronotype . The chronotype is the natural tendency of a person to sleep or be active at a certain time during the day according to their circadian rhythms. While most of us already know the expression that people can be either larks (early types) or night owls (late types), these chronotypes are the two extremes on the spectrum . Most people are somewhere in the middle. As our chronotype depends on individual differences in our circadian clock properties , it is not really possible to actively alter our chronotype. However, it can change over a lifetime : children are larks, adolescents tend to be night owls, and after the age of 20 and as we increase in age, we become lark-like again. The chronotype itself does not affect how much sleep we need , which is also mainly influenced by other factors and genetics . Rather, our chronotype interacts with our social obligations such as school, work or family responsibilities, which can affect how much sleep we get. Later chronotypes may have a disadvantage due to the pace of modern life as their natural chronotype conflicts with the demands of their schedule. Consequently, a late chronotype is often associated with poor cardiometabolic health (affecting your heart and blood vessels) and the higher risk of depression . In this context, there is a growing call from scientists for schools to delay the start time for teenagers to ensure sufficient sleep and improve health outcomes and school performance . So there is no simple answer to the question of when to go to bed. While a regular good night’s sleep with an average of seven to eight hours is important for general health and wellbeing, our optimal bedtime depends on our internal circadian clock and other factors including genetics that control how long we need to sleep. Frederic Gachon , Associate Professor, Physiology of Circadian Rhythms, Institute for Molecular Bioscience, The University of Queensland and Meltem Weger , Postdoctoral Research Fellow, Institute for Molecular Bioscience, The University of Queensland This article is republished from The Conversation under a Creative Commons license. Read the original article .","pubDate":"2023-03-23 22:41:58","image_url":"https://www.lifehacker.com.au/wp-content/uploads/sites/4/2023/03/24/iStock-1332615490.jpg?quality=80=1280,720","id":"67a0c45f-db90-44ae-8dc9-e04024515bea"},{"title":"Cholera hits Manicaland","link":"https://www.manicapost.co.zw/cholera-hits-manicaland/","description":"  Tendai Gukutikwa and Tanyaradzwa Mujati   MANICALAND has recorded at least 15 percent of the suspected cholera cases reported in Zimbabwe since the outbreak of the disease last month (February), The Manica Post can reveal.   The province has the highest number of confirmed cholera cases across the country with nine, followed by Matabeleland […]","content":"The ManicaPost MANICALAND has recorded at least 15 percent of the suspected cholera cases reported in Zimbabwe since the outbreak of the disease last month (February), The Manica Post can reveal. The province has the highest number of confirmed cholera cases across the country with nine, followed by Matabeleland South which has eight confirmed cases. The upsurge in cholera cases in the province has resulted in five of Manicaland’s seven districts being declared hotspots by the Ministry of Health and Child Care. The five districts are Buhera, Chimanimani, Chipinge, Mutare and Mutasa. This comes at a time when Mutare is grappling with water shortages, resulting in most parts of the city going for days without the precious liquid. Last weekend alone, Chimanimani District had a single confirmed cholera case and 24 suspected cases. Mutasa District on Wednesday recorded six new suspected cholera cases, as the province recorded the highest number of confirmed cholera cases in the country. Manicaland’s cumulative confirmed cases now stand at nine, while the number of suspected cases stand at 31. Buhera and Chipinge have, however, not reported any suspected or confirmed cases. According to a Zimbabwe Cholera SitRep report released on Wednesday, 12 people were hospitalised across the country due to cholera, with two hospitalised in Chimanimani and one hospitalised in Mutare district. The report stated that so far, a cumulative total of 198 suspected cholera cases, one confirmed cholera death, four suspected cholera deaths and 26 laboratory confirmed cases have been recorded nationwide, nine of which are from Manicaland. In an interview, Manicaland provincial health promotions officer, Mrs Agnes Mugumbate said as of Wednesday, nine of the suspected cholera cases had been confirmed. She said Buhera, Chimanimani, Chipinge, Mutare and Mutasa were declared hotspots due to their proximity to neighbouring Mozambique where there is a cholera outbreak. “Due to the porous border with Mozambique, the outbreak was bound to spread to the province. People travel daily to and from Mozambique using many illegal entry points and Forbes Border Post. “This might explain why we have over the past week been experiencing a spike in suspected as well as confirmed cholera cases in Manicaland,” she said. Mrs Mugumbate said they have since activated their rapid response and surveillance teams in the respective areas, and sensitised health facilities as well as local communities on the disease. “We have sensitised our facilities to be on high alert with on-going active surveillance. We are also distributing relevant materials like buckets to the hotspot areas and making sure that locals are well sensitised and protected from the disease. The sensitisation of our health workers, community and village health workers is also ongoing. “The public is being sensitised to keep safe by making sure that they drink and use safe water, wash their hands often with soap and safe water as well as prepare their food well,” she said. Mrs Mugumbate added:“So far all reported cases are from locals. We have not recorded any cases of cholera from foreign patients crossing into Manicaland to seek treatment.” However, in Mutare, acute water shortages have put a dent on the Ministry of Health and Child Care’s awareness campaigns. The local authority was for the greater part of this week battling to repair a 450mmpipe that burst near Herbert Chitepo (3 Brigade) Barracks in Chikanga since last week. The burst pipe has affected most suburbs in the city. Mutare City Council spokesperson, Mr Spren Mutiwi confirmed the water shortages. “We had a major pipe burst and we have been trying to fix it since last week. However, we finished repairing it on Tuesday and I am sure the water levels are building up in the tanks. Water should be available in most parts of Mutare by the end of this week,” he said. According to a Zimbabwe Cholera SitRep report: “To date, cases have been reported in eight provinces in the country since the beginning of 2023, with eight cases in the said provinces having no epidemiological link to each other. “In Zimbabwe, the cholera outbreak started on February 12 at Chao-square Mining Resource Company in Chegutu. The outbreak has since spread into the community with unrelated cases and suspected cases being reported in other provinces,” the report reads in part. The report also says cases started spiking on March 15 when 31 cases were recorded. Other declared hotspot districts across the country are Chegutu, Chikomba, Chitungwiza, Chiredzi, Harare, Gokwe North, Marondera, Mazowe, Shamva, Murewa, Mwenezi, Seke and Wedza.","pubDate":"2023-03-23 22:15:04","image_url":null,"id":"6c1c3b0c-93e4-4601-b36b-d17edcaffe7b"},{"title":"Hernia camp a great success","link":"https://www.manicapost.co.zw/hernia-camp-a-great-success/","description":"  Tendai Gukutikwa Post Reporter   THE Government of Japan recently availed US$633 000 towards the country’s health sector to strengthen Surgical, Obstetric and Anaesthesia (SOA) care services, while building capacity of specialist health workers in Zimbabwe.   This saw a surgical hernia camp being set up at Victoria Chitepo Provincial Hospital over the past […]","content":"The ManicaPost THE Government of Japan recently availed US$633 000 towards the country’s health sector to strengthen Surgical, Obstetric and Anaesthesia (SOA) care services, while building capacity of specialist health workers in Zimbabwe. This saw a surgical hernia camp being set up at Victoria Chitepo Provincial Hospital over the past week. Implemented by the Ministry of Health and Child Care, and its partners, World Health Organisation (WHO), UNICEF and Celebration Health, the surgical camp saw patients aged between two and 12 who were diagnosed with hernia being screened and surgically operated on. In an interview on Tuesday, Victoria Chitepo Provincial Hospital Medical Superintendant, Dr Dorcas Masanga-Mutede, said the camp which was scheduled for Manicaland patients only, gained momentum when word spread and the hospital ended up receiving patients from as far as Victoria Falls and Beitbridge. She said at least 500 patients were turned away as the available resources could only attend to a little more than 100 patients. Dr Mutede-Masanga said as a provincial referral hospital, they were elated that they ended up saving patients from across the country, thanks to the camp. “I would like to thank the partners and specialist doctors for ensuring that this camp was set up. Their contribution has made a great difference in the children’s lives and we hope that this continues across all medical disciplines,” she said. Dr Mutede-Masanga said the hospital is grappling with the issue of theatre time as specialist doctors will be attending to emergencies most of the time, such that elective cases like hernia will not get due attention. “We are very happy with the camp. This is following a growing need which was identified in the community. Usually cases end up being booked years after being diagnosed because of the challenge of theatre time. We are very grateful because we managed to assist many patients from across the country and we are hoping that this will become a norm,” she said. Dr Ruvimbo Saunyama, who is part of the surgical team, said they received overwhelming response from patients who continued flocking to the hospital despite the completion of the screening process on Monday. She said the major limiting factor is time and all outstanding patients were recorded in the country’s hernia operations waiting list. “The plan is for further camps for Mutare or Harare, but that will benefit patients from across the country if funds permit because we have discovered that there is a great need for hernia surgeries. We are making good progress,” said Dr Saunyama. Ms Rosaria Maida of Marondera whose son, Edron Chikanga (eight) had an umbilical hernia for the past six years, said: “He would vomit after eating and his navel would swell at any given moment. This was disturbing his education and I would like to thank Government and funders for making my son’s operations possible. My son can now lead a normal life,” she said. Japan’s Ambassador to Zimbabwe, Ambassador Satoshi Tanaka, said: “Japan will support Zimbabwe’s efforts to attain Universal Health Coverage (UHC) by strengthening access to safe, timely and affordable SOA care, for which there is a dire need.” In a recent Press release, WHO country representative, Professor Jean-Marie Dangou Director reaffirmed the organisation’s commitment to support Government in strengthening the health system and implementation of the National Health Strategy (NHS 2022 – 2025) for which delivery of safe and quality SOA care are among its top priorities. A hernia is when a part of the intestine pushes through a weak spot in the belly (abdominal) muscles. The hernia creates a soft lump or bulge under the skin.","pubDate":"2023-03-23 22:11:50","image_url":null,"id":"1fd15944-f9af-41c2-9aea-cbf31699552e"},{"title":"Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline","link":"https://ottawacitizen.com/news/local-news/negotiations-ongoing-between-carleton-university-teaching-assistants-and-contract-instructors-as-clock-ticks-to-monday-strike-deadline","description":"If agreements are not reached in time, the university is taking steps to prepare for a possible labour disruption","content":"Share this Story: Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr Breadcrumb Trail Links Local News Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline If agreements are not reached in time, the university is taking steps to prepare for a possible labour disruption Author of the article: Joanne Laucius Published Mar 23, 2023 • 3 minute read Join the conversation Carleton University in Ottawa. The university says it has been in negotiations with two units of CUPE Local 4600 since last August. Photo by Tony Caldwell / Postmedia Article content Carleton University on Thursday remained in negotiations with its biggest union as a Monday strike deadline looms, only weeks away from the end of the term. Advertisement 2 Story continues below This advertisement has not loaded yet, but your article continues below. THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY Subscribe now to read the latest news in your city and across Canada. Unlimited online access to articles from across Canada with one account Get exclusive access to the Ottawa Citizen ePaper, an electronic replica of the print edition that you can share, download and comment on Enjoy insights and behind-the-scenes analysis from our award-winning journalists Support local journalists and the next generation of journalists Daily puzzles including the New York Times Crossword SUBSCRIBE TO UNLOCK MORE ARTICLES Subscribe now to read the latest news in your city and across Canada. Unlimited online access to articles from across Canada with one account Get exclusive access to the Ottawa Citizen ePaper, an electronic replica of the print edition that you can share, download and comment on Enjoy insights and behind-the-scenes analysis from our award-winning journalists Support local journalists and the next generation of journalists Daily puzzles including the New York Times Crossword REGISTER TO UNLOCK MORE ARTICLES Create an account or sign in to continue with your reading experience. Access articles from across Canada with one account Share your thoughts and join the conversation in the comments Enjoy additional articles per month Get email updates from your favourite authors Don't have an account? Create Account or View more offers If you are a Home delivery print subscriber, unlimited online access is included in your subscription. Activate your Online Access Now Article content We apologize, but this video has failed to load. Try refreshing your browser, or tap here to see other videos from our team . Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline Back to video The university says it has been in negotiations with two units of CUPE Local 4600 — which represents about 3,000 teaching assistants, internally-funded research assistants and contract instructors at the university — since last August. One sticking point for the union is the wording of a proposed cost of living adjustment, which would ensure wages keep up with inflation. CUPE argues that teaching assistant wages have fallen behind the cost of living in Ottawa by more than 10 per cent over the past decade, and that contract instructors who teach undergraduates are paid 15 per cent less than their counterparts at the University of Ottawa. CUPE also argues that Carleton currently does not have a centralized process for providing accommodations to union members who need them, with a “piecemeal” system in place that “has left many members feeling vulnerable to discrimination.” Article content Advertisement 3 Story continues below This advertisement has not loaded yet, but your article continues below. Article content There is also no cap on how many students a teaching assistant may be responsible for, according CUPE, making the workload untenable. Carleton said it was continuing to meet with CUPE 4600 Unit 1 (teaching assistants, some research assistants and service assistants) and Unit 2 (contract instructors) this week. Both units have their own collective agreements, which are bargained at the same time but by separate bargaining teams. “The university is committed to negotiating fair compensation packages in a timely manner and has tabled significant, multi-year salary increases to both units,” said the university in a statement. “The parties have reached agreement on a number of issues and significant progress continues to be made.” Advertisement 4 Story continues below This advertisement has not loaded yet, but your article continues below. Article content If agreements are not reached in time, the university is taking steps to prepare for a possible labour disruption, said Carleton. “Should a strike be declared, further updates will be provided regarding courses, exams and other campus activities.” Both CUPE units have given their bargaining teams strong strike mandates. Unit 1 voted 93 per cent in favour, and Unit 2 voted 95 per cent in favour, according to the union. Without this group of educators, “the university would be unable to hold classes successfully, particularly at the height of the marking and exam period,” warned the union earlier this month. CUPE said on Twitter Thursday that “ hundreds continue to sign up for picket shifts, strike pay, and we continue to receive thousands of dollars in pledges, we are increasingly ready if time runs out.” Advertisement 5 Story continues below This advertisement has not loaded yet, but your article continues below. Article content According to a 2020 Carleton policy on labour disruptions, individual faculty are in the best position to determine the extent to which courses, seminars and labs are affected by a strike and what action may be taken if the disruption lasts 10 days or less, but academic standards should not be altered. In the case of a longer strike, an advisory committee of the university senate will determine what should be done, including the possibility of changing schedules or a term extension. CUPE, meanwhile, has been critical of what it said has been sparse communications with the campus community by Carleton. The union said it has been flooded with messages from students, teaching assistants and contract instructors about how the strike will affect them “because Carleton is saying nothing. They’re leaving the community in the dark while we pick up the slack.” Recommended from Editorial JTF2 base expansion deal inked four months ago, but defence minister waited until Biden visit to make announcement Ontario expects $1.3B deficit budget, to post surplus in a year Share this article in your social network Share this Story: Negotiations ongoing between Carleton University, teaching assistants and contract instructors as clock ticks to Monday strike deadline Copy Link Email Facebook Twitter Reddit Pinterest LinkedIn Tumblr Comments Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings . Join the Conversation Trending McGill remains the top university in Canada, according to these rankings One-year-old Ottawa girl overdosed on fentanyl, saved at CHEO Police officer borrows citizen's bike to chase down traffic suspect Online petition targets OCDSB trustee who cut off speech against trans students' use of washrooms What you should know about U.S. president's visit to Ottawa this week Related Stories OPP investigating fatal residential fire north of Perth The Lanark detachment of the Ontario Provincial Police says it is investigating a fatal residential fire on Drummond Concession 4C, north of Perth. 5 hours, 5 minutes ago Local News McGill remains the top university in Canada, according to these rankings It beat out University of Toronto and UBC in the authoritative ranking publication. 13 hours, 47 minutes ago Local News Advertisement 2 Story continues below This advertisement has not loaded yet, but your article continues below. BREAKING NEWS: Two Edmonton police officers killed while responding to a call Edmonton Police Service Chief Dale McFee is scheduled to make a statement later today 1 week ago News Ottawa's wastewater tracking was vital during the pandemic. Now its funding could go down the toilet Rob Delatolla's lab began monitoring Ottawa’s wastewater for COVID-19, RSV and influenza. Loss of provincial funding means that could end in June. 6 days, 5 hours ago Local News Online petition targets OCDSB trustee who cut off speech against trans students' use of washrooms \"Let the haters hate. I will not resign.\" 1 day, 4 hours ago Local News Latest National Stories Advertisement 1 Story continues below This advertisement has not loaded yet, but your article continues below. This Week in Flyers","pubDate":"2023-03-23 21:29:42","image_url":null,"id":"2c20e6c8-db25-4a1e-999f-fd00b60fe3ea"},{"title":"Teen kicked out of 'UK's rudest restaurant' for being rude to staff","link":"https://www.walesonline.co.uk/news/real-life/teen-kicked-out-uks-rudest-26542844","description":"Jack Keith had travelled two hours to visit Karen's Diner with his grandparents","content":"A lad and his grandparents were booted out of 'the UK's rudest restaurant' - after he called the waitress a 'fat s**g' because she branded him a 'p****y' for mumbling. Jack Keith had travelled two hours to visit the Manchester branch of Karen's Diner with his grandparents but they were ordered to leave after just ten minutes. Viral footage shows the in-character waitress hear the 17-year-old calling her a 'whore' under his breath as part of what appears to be the restaurant's accepted customer-vs-staff banter. She tells him 'not to mumble it because you're a p***y' and when he says it more clearly she hits back to say 'you can't pronunciate [sic], that's embarrassing'. However the exchange quickly turned sour when she asks his age and he quips back 'how old are you, you fat s**g?'. The angry waiter immediately tells another member of staff then returns to the table to declare 'you're out, all of you, it's in the rules. He's ruined it'. Stunned Jack and his family were forced to pay the £25 drinks bill and leave because rules given to customers upon entry tells them banter doesn't extend to 'body shaming'. Despite admitting he's not proud of the comments, he's since hit back at the restaurant chain questioning why staff 'can give [abuse] but can't take it'. His mum Jane Keith, who was also at the meal, insists the 'house rules' need to be made clearer before the experience begins to avoid customers getting 'caught in the moment'. However, Karen's Diners firmly hit back at the family and said it is 'sad that a minority of customers need reminding as to how to behave' but they have 'no choice but to cater to the minority' by putting up house rules. The diner confirmed that if 'give it but not take it' referred to 'body shaming' then the family were correct - the chain would act upon such 'unacceptable behaviour'. The chain condemned the footage as a 'sour clip' and sarcastically said they accept the possibility that some people 'struggle to read the 'house rules' handed to them on arrival. Jack, from Ulverston, Cumbria, said: \"I agree that if you can't take it don't give it. I was shocked when she told us we had to leave. We thought they'd tell us to pay for the drinks then to sit back down. \"She brought it on herself really because I wasn't going to say anything after she said about my pronunciation. I'm not going to say something then not be able to take it and start crying about it. I'd take it on the chin, have just laughed about it and say something back. \"It was just in the moment and that came to my head so I thought I'd throw that at her. I understand that they think it's against the rules. It said 'no body shaming' but I couldn't think of anything [my insult] would have come under because she wasn't fat. She was your average female build so I don't know why she took it to heart. Jack Keith after being told he's been kicked out \"We didn't have time to read the rules. They just threw them at us and it was a really loud atmosphere. There was a lot going on. Some of the insults they gave to my grandparents were pretty next-level. Karen's Diner is a crazy idea and I probably wouldn't go back.\" The family left Karen's Diner without issue and chose to eat at a nearby cafe instead where they discussed the incident. Jane says a staff member threw the rules on the floor upon entry and made her pick them up before showing them to a table. She admits they didn't read the rules and is keen emphasise the importance of making sure customers do before the experience begins. Jane said: \"When you're there and you see the way they speak to you it leaves you quite shell-shocked. Jack Keith is told to leave \"She was quite in his face and Jack doesn't like that really. He doesn't go out looking for trouble and he's quite a quiet lad. Before you sit down they should show you the rules and make you read them in front of you. They don't make it clear enough.\" Jack's brother Josh Keith, who was also at the meal, posted the video on TikTok where it's been viewed more than half-a-million times. Jack commented on his 19-year-old brother's post and said: \"Please let me state that I'm not proud of this. It was just [said] in the moment and I'm not a bad person.\" Social media users are split on whether the teen is out of order with his abuse or if the waitress should accept it as par for the course. Karen's Diner offers its 'rude' experience in more than 15 locations across the world, with six being in the UK. Karen's Diner House Rules As listed on the company's website Karen's Diner is a unique, interactive dining experience. But in order to maintain a shred of sanity here, we have some rules Breaking these rules will result in the table being asked to pay the bill and leave the venue. You will also be banned from returning to the venue We want both staff and customers to feel as safe as possible in our venues No racist, sexist, homophobic or ableist comments or slurs will be tolerated No body shaming No sexual harassment Any damage or vandalism of the venue will lead to instant removal from the venue. (Charges may also apply) Keep your food and drink on your tables, don't throw them, its not fun A spokesman for Karen's Diner said: \"[In response] to the allegation that Karen’s staff can 'give it, but not take it'. If the 'Take it' referred to is simple 'body abuse', then the statement is quite correct. \"Karen's Diners will not condone seriously offensive abuse either 'given' (which can be grounds for dismissal as all our staff are obliged to work within strict behavioural guidelines) or 'take it' as we will always take every stance to protect our staff from unacceptable behaviour. \"It is sad that a minority of customers need reminding as to how to behave. We have no choice but to cater for this minority and accept that it is always possible that they struggle to understand how to click onto the front bar of our website ('rules'), and perhaps struggle to read the cards ('House rules') handed to them on arrival, which state specifically what we consider to be unacceptable behaviour. Subscribe here for the latest news where you live \"Sadly we are unable to personally explain to every customer that calling a waitress a 'fat sl*g' is very directly 'body shaming' and that is why we hand out the House Rule cards. I accept that there is a distinct possibility that some people perhaps need an explanation as to the meaning of 'body shaming!' \"Perhaps this is what they mean when they say 'It needs to be made clearer!?' We spend days teaching our staff how to be rude and funny. Offending anyone is never funny. \"When you trawl through the thousands of video clips showing customers enjoying Karen's dining experience, it will take you some time to find other clips with content similar to the sour clip presented. We have loved being rude to over 50,000 people in Manchester and we thank 99% of them for being such fun.\"","pubDate":"2023-03-23 18:10:01","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26545418.ece/ALTERNATES/s615/0_KNM_DINER_ABUSE_ROW-_13.jpg","id":"5db6c1b5-185f-4505-8a71-6f506e77821a"},{"title":"The card that’s a sign of eternal friendship | Brief letters","link":"https://www.theguardian.com/lifeandstyle/2023/mar/23/the-card-thats-a-sign-of-eternal-friendship","description":"Birthday greetings | Bridget Phillipson | Women’s football’s nasty turn | Saveloy source | The joy of a post-hangover dayRe your letters on friendship (Letters, 19 March), 60 years ago, I popped in to a card shop and paid 1s 9d for a McTavish’s eternal birthday card. Inside was a list of numbers from one to 99. I ticked 18 and gave it to my pal Eddie. In October of that year, he ticked 19 and sent the card to me. Every year since then we have, without fail, delivered the card to each other.Dr Roger WaterfallMarlesford, Suffolk• I was surprised and disappointed to read Zoe Williams’ comment in her interview with Bridget Phillipson (‘I grew up at the margins’: Bridget Phillipson on teachers’ strikes, Ofsted, Brexit and Corbyn, 21 March) that she was “still weirdly well turned-out, for a Labour MP”. This is 2023! Have we really not moved on from judging women and their politics from the way they dress?Elizabeth BrownCorsham, Wiltshire Continue reading...","content":"Re your letters on friendship ( Letters, 19 March ), 60 years ago, I popped in to a card shop and paid 1s 9d for a McTavish’s eternal birthday card . Inside was a list of numbers from one to 99. I ticked 18 and gave it to my pal Eddie. In October of that year, he ticked 19 and sent the card to me. Every year since then we have, without fail, delivered the card to each other. Dr Roger Waterfall Marlesford, Suffolk I was surprised and disappointed to read Zoe Williams’ comment in her interview with Bridget Phillipson ( ‘I grew up at the margins’: Bridget Phillipson on teachers’ strikes, Ofsted, Brexit and Corbyn, 21 March ) that she was “still weirdly well turned-out, for a Labour MP”. This is 2023! Have we really not moved on from judging women and their politics from the way they dress? Elizabeth Brown Corsham, Wiltshire Bravo to women’s football. “At times we need to be nastier,” says Georgia Stanway, who has seven yellow cards so far this season ( Report, 20 March ). Good to see the women’s game so intent on emulating its male counterpart. Rhys David Redbourn, Hertfordshire I don’t suppose Jonathan Jones could divulge where he bought his saveloy ( ‘You’ve never eaten a banana?!’ 10 writers face their fiercest – and strangest – food fears, 23 March )? Asking for a friend who is willing to travel. Warren Brown Ilkley, West Yorkshire Re Adrian Chiles’ column on the secret to happiness( 22 March ), may I recommend the day after a hangover (not available to all)? Today, the birds are chirping merrily; yesterday, the little buggers wouldn’t shut up. Linda Mockett Wokingham, Berkshire Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.","pubDate":"2023-03-23 18:09:12","image_url":"https://i.guim.co.uk/img/media/aa2bcd94c4f80f7d589549eb4d7e761d7f98343c/0_63_3216_1930/master/3216.jpg?width=460&quality=85&auto=format&fit=max&s=006d0f3e4197a93e23833f21fcb19c81","id":"2f4dd7bf-5ba7-4b3e-8109-6c3da7180f5c"},{"title":"Photos show squalor and filth inside rat infested restaurant","link":"https://www.walesonline.co.uk/news/wales-news/photos-show-squalor-filth-inside-26544299","description":"A judge described the food handling processes at the restaurant as 'nauseating', adding there had been evidence of rats","content":"This is the state food hygiene inspectors found a Cardiff restaurant in during an inspection in what has been described as \"the worst case of neglect at a restaurant in the past 15 years\". Sabz Ali Khan, aged 77, and Sabrina Khan, aged 41, appeared at Newport Crown Court for sentencing having been previously been found guilty following a trial of 18 food hygiene offences. A number of food hygiene safety inspections at Lilo Grill in Cardiff took place between August 2019 and January 2020. The legal food business operator of the business is Nightcover Limited, and Sabrina Khan is the sole director of the business, whilst her father Sabz Khan managed the day-to-day operations of the restaurant. Judge Richard Williams, passing sentence on the pair, explained how inspectors found evidence of the presence of rats in the restaurant, and described its food handling processes as \"nauseating\". He also added that food was being stored in conditions likely to render it \"unfit for human consumption\". Read more: Get the latest court cases sent to your email inbox with our Crime & Punishment newsletter A mincer found in the raw meat prep area (Image: Cardiff Council) A rat hole by to the sewers by the waste stored in the salad storeroom (Image: Cardiff Council) A blocked open drain in the wash area with rat footprints in the thick grease (Image: Cardiff Council) Cables for the fire alarm gnawed by rats (Image: Cardiff Council) He said: \"The picture presented of Lilo's Grillhouse in City Road, Cardiff, as it was when it was inspected in 2019, was one of behind the scenes squalor. There was clear evidence of ingress by rats and accumulated filth of equipment which was inadequate or in disrepair, food handling processes which were simply nauseating, the provision for recording matters were token at best, and the recordings which were kept had been falsified by one or more persons who made them. \"Equipment such as thermometers and temperature probes which were necessary to test food for safety purposes were missing, broken, or those present didn't know how to use it. Food was being stored in conditions likely to render it unfit for human consumption, there was no established regime for maintenance of equipment or replacement of worn out equipment or pest control. There was no apparent appetite for those responsible to manage the restaurant and do anything other than trade. \"The principle person responsible was Mr Sabz Khan. When the restaurant was inspected, there was a deal of obfuscation and he did the bare minimum to secure the re-opening of the restaurant and had a foot dragging approach in carrying out measures to improve the restaurant and adopted a combative approach. The failure on Sabrina Khan's part was failing to do what a company director was supposed to do. There is no evidence she was directly involved in the management of the restaurant. Her ability to mitigate what was found was hampered by her relationship with her co-accused.\" A collapsed wall behind the freezer in the washing up area which inspectors say was a result of damage caused by rats (Image: Cardiff Council) A damaged freezer at the restaurant (Image: Cardiff Council) Dried rat urine dripping down the walls of the dry store (Image: Cardiff Council) Extensive rat activity and damage under seating at the restaurant (Image: Cardiff Council) Nightcover Ltd was fined £12,000 and ordered to pay £6,500 in costs, Sabrina Khan was fined £1,500 and ordered to pay £1,000 in costs and Sabz Ali Khan was fined £5,000 and ordered to pay £2,500 in costs. Speaking after the court case, Cardiff Council cabinet member responsible for shared regulatory services, councillor Dan De’Ath said: “I have been reliably informed by the case officer that this is the worst case of neglect at a restaurant that we have come across in the past 15 years. Not only was the state of the property an absolute disgrace that put their customers at risk, but the manager was also very unhelpful and obstructive throughout the investigation. To top it all off, the argument he used in his defence that the rats in the restaurant were due to the proximity of students living in the area, is quite honestly laughable. “If you own or run a food business, you have responsibilities which are laid out in law. If you do not follow the correct practices and allow your business to go into a state of disrepair, you are putting your customers at risk of disease and infection.” READ NEXT: Man living illegally in UK sent to tend cannabis farm in Cardiff Man branded 'pervert' by judge for 'beyond creepy' behaviour towards women Inquest opens into death of 68-year-old man found dead following house explosion Man accused of murdering toddler Lola James told police she was 'a nutcase' and 'accident prone' Man looked after cannabis farm to pay off loan for late dad's medical treatment","pubDate":"2023-03-23 17:31:29","image_url":"https://i2-prod.walesonline.co.uk/incoming/article26545180.ece/ALTERNATES/s615/0_RD_SWA_230323CardiffRestaurant_07jpgn.jpg","id":"29a1fd0e-640c-4b1b-8641-c5ea6e8e993b"},{"title":"Dog owner gets suspended jail sentence after pet attacks jogger","link":"https://www.walesonline.co.uk/news/uk-news/dog-owner-gets-suspended-jail-26544609","description":"A Shar Pei type breed attacked and injured the runner","content":"A man has been given a suspended jail sentence after his dog attacked a jogger. A court heard the Shar Pei type injured the runner in January 2021. At a hearing this week, Brian Dickson advised the court the dog is no longer in his possession and the judge ruled the pet was to be subject to an order ensuring it is permanently muzzled while in public. Dickson was sentenced at Belfast Magistrates’ Court after a prosecution by Belfast City Council, the statutory powers responsible for dog-owning, BelfastLive reports. Dickson was convicted under Article 29 of The Dogs (Northern Ireland) Order 1983. The judge imposed a three-month prison sentence suspended for 12 months. He was also ordered to pay £250 compensation to the injured jogger, along with court costs of £138 and an offender levy. The Shar Pei is an ancient guard dog breed of Chinese origin, noted in appearance for its deep wrinkles. The American Kennel Club, which helped save the breed from extinction in the 1970s, describes the Shar Pei as: \"a fascinating but challenging breed of ancient pedigree - steadfastly loyal to family, but standoffish with strangers.\" It adds: \"They are suspicious of strangers and other dogs. Shar-Pei are serene dogs, but they will meet a perceived threat with tenacity and vigor. Early training and socialization are essential - a dominant adult Shar-Pei without them is a serious problem waiting to happen.\" Subscribe here for the latest news where you live","pubDate":"2023-03-23 17:18:48","image_url":"https://i2-prod.belfastlive.co.uk/news/belfast-news/article26534849.ece/ALTERNATES/s615/0_GettyImages-713835621.jpg","id":"3e7ecc38-b611-422c-854c-21c02d743ebe"},{"title":"COVID left some with damaged immune response, study finds","link":"https://247newsaroundtheworld.com/health-news/covid-left-some-with-damaged-immune-response-study-finds/","description":"247 News Around The World 247 News Around The World A key piece of the body’s immune response to COVID-19 looks to… The post COVID left some with damaged immune response, study finds appeared first on 247 News Around The World.","content":"A key piece of the body’s immune response to COVID-19 looks to have been damaged in people who caught the disease before they were vaccinated, a study published this month found, resulting in a “major reduction” to part of the defense the body typically musters to fight off the virus. “You have damage that, even in recovery from the infection, you haven’t really recovered your ability to make those CD8+ cells. So something happened in the course of infection to prevent that, to damage your response,” said Stanford Professor Mark Davis, head of the university’s Institute for Immunity, Transplantation and Infection. Davis is lead author of the paper, which was published this month in the journal Immunity. CD4+ T cells, often dubbed “helper T cells” for their role in marshaling other parts of the immune response, appeared to be undamaged. But Davis and his team found the response of CD8+ T cells, known as “killer T cells” for their role in destroying infected cells, was substantially worse in people who had survived an infection, with both the quantity and quality of the cells diminished. A disparity remained even after those people got vaccinated with the Pfizer-BioNTech vaccine. “Looking at the broader swath of data, we came up with a seven-fold average reduction. But it was much larger in several of the cases. So that’s a big deal,” Davis said. While researchers often look to antibodies first to measure the body’s initial protection against an infection, an array of T cells also make up an essential part of the body’s defenses. Davis and his team engineered a unique approach to measuring this response, leveraging a reagent they developed to essentially label a detailed picture of the T cells. “Technology-wise, looking at the T cell response and quantitatively measuring it is harder than antibody detection. That’s why there’s a need to improve that technology and also relate it to vaccine development,” said Chao Jiang, a program officer for the National Institutes of Health. Jiang oversaw the research, which was funded by the agency. Davis thinks the dropoff could result in the immune system taking longer to root out infected cells. Compared to others without the damage, it could also potentially make it harder to gain the full benefit from the vaccine they got and fend off new variants. “I think it would be probably too much of a speculation to say that this could impair responses to other viruses. But SARS-CoV-2 variants have not gone away. They’re out there,” he said. The study’s authors likened the dysfunction to that seen in their previous work with viruses like hepatitis C or HIV, lingering even after infections were quelled. “So there are probably, after these years of study, we know that SARS-CoV-2 actually did alter our host immune response. And this CD8 T cell dysfunction may be just one aspect of it,” said Jiang. Not every infectious disease has been linked to this kind of lasting dysfunction, Jiang said. But she cautioned that this does not mean SARS-CoV-2 inflicts the same kind of devastation that HIV can wreak on the immune system. “This dysfunction may have some long-term immune consequences. It may be possibly related to long COVID , but we don’t know. And there is a lot of work ongoing, and I think we will understand more about the mechanism,” said Jiang. It will also be important to study how this damage squares with other parts of the body’s complex immune response. Jiang noted research elsewhere has turned up signs of superior antibody protection from people who were both infected and vaccinated. “That’s why, in my mind, it’s very important to follow up a study like this, especially when our clinical cohort is getting more years down the road, so that we could be able to correlate that with some more clinical symptoms,” Jiang said. One limitation of this paper from Davis is that they relied on “peripheral” T cells in the blood. Gathering samples from elsewhere in the body — for example the lungs, where the immune response might look strongest — cannot be done with living humans. However, Davis pointed out their measurements turned up other kinds of T cells for the virus in the blood at levels that looked fine. “This question has been raised like a million times. And basically, what I would say is that everything ends up in the circulation eventually,” said Davis. Some of the phenomenon they discovered may also be unique to the population scientists tested: people who got an mRNA vaccine for COVID-19 after they were infected. Davis suggested it was possible people may see different results more years after their initial infection, especially in people who mix-and-matched with other vaccines for their booster. “Maybe, as we go further along to look at some of those damaged CD8 responses, can we bring them back? Or do people recover after?” he said. More Alexander Tin CBS News reporter covering public health and the pandemic. Post source: cbsnews","pubDate":"2023-03-23 17:14:12","image_url":null,"id":"c02abacd-3255-4887-a387-deba45ab3ad7"},{"title":"Teachers accept pay offer from Welsh Government ending strike action","link":"https://www.walesonline.co.uk/news/education/teachers-latest-pay-offer-26543584","description":"No deal has been offered to teaching assistants though with the National Education Union warning its national executive will be “considering next steps in our support staff pay campaign”.","content":"Teachers in Wales have called off any further strike action after accepting the latest pay offer from the Welsh Government. The dispute, rumbling since the autumn, saw teachers strike on two days across Wales closing hundreds of schools. The National Education Union said 73% of its teacher members in Wales who responded to it latest consultation voted to accept the pay offer put forward by Education Minister Jeremy Miles to end the dispute. He made the offer after the second strike on March 2 with members agreeing to suspend further action planned while they considered it. The offer will see an additional payment to teachers of 3% for this academic year (2022/23), made up of 1.5% consolidated award and a further 1.5% one-off unconsolidated lump-sum. The offer also included an increased pay rise of 5% paid from September 2023. The minister pledged that it will all be fully funded by the Welsh Government and not have to come from school budgets. Read more: Hundreds of teachers and school staff told to re-apply for their jobs in Pontypridd schools shake up Striking teachers on the picket line at Cardiff High on February 1 (Image: WalesOnline/Rob Browne) No offer has been made to teaching assistants however. The NEU warned that its national executive will be “considering next steps in our support staff pay campaign”. Speaking about the members’ decision to accept the offer NEU Joint General Secretary Kevin Courtney said: “Members in Wales have made a clear decision to accept the pay offer, put forward by the Minister in a letter dated 9 March. “We would like to thank the Welsh Government for the constructive way in which they have conducted negotiations with the union, and we look forward to a productive working relationship to ensure that the rest of the deal, focused on workload, continues to make good progress. “Whilst this doesn’t meet our ambitions for pay restitution every part of this offer is due to our members’ efforts - and we will continue campaigning for the governments in Cardiff and Westminster to invest properly in this generation of children and the staff who work with them.” David Evans, Wales Secretary for the National Education Union Cymru, said: “It is clear that a large majority of our teacher members here in Wales want to accept the deal from the minister. They were provided with full information about the offer and have given us a definitive steer. “This has been a difficult time for everyone in education. Our members do not take decisions to go on strike lightly, but they had to make a stand given the continuing impact of austerity, cost of living and spiralling inflation. We would like to thank all the parents who supported teachers and support staff in the action taken.” He added: “We remain disappointed that the minister made no offer to teaching assistants, but we know that we have raised the profile of the critical issues which affect everyone in education. Our national executive will be considering next steps in our support staff pay campaign.” NEU members turned down an initial 5% offer recommended by the Independent Pay Review Body for Wales and accepted by the Welsh Government “an insult”. They also turned down a second offer of an additional 1.5% lump sum and extra 1.5% pay rise as “not good enough”. They have accepted a third offer adding an increased pay rise of 5% paid from September 2023 with the promise that will be fully funded by the Welsh Government. But headteachers have voiced concerns that with school budgets being cut money is being given in one hand but taken in another. There are ongoing concerns about years of underfunding for schools leading to larger class sizes and use of unqualified staff. Teachers voice their anger at pay erosion during this terms strikes (Image: WalesOnline) The NEU estimates teachers’ pay had been eroded by as much as 20% in the last decade. Headteachers in the NAHT Cymru have been working to rule in protest over pay and working conditions. The full holding offer from Welsh Government: 5% already awarded (fully-funded) An extra 1.5% fully consolidated 1.5% one-off cash payment This makes a total consolidated increase of 6.5% and an in-year boost for the current year of 8% The money would be paid in April and backdated to September provided NEU Cymru pauses next week’s industrial action For the next academic year 2023-24 a new 5% offer compared to the original 3.5% offer Education Minister Jeremy Miles said: “I am pleased that NEU members have voted to accept the enhanced pay offer. This is good news for pupils, parents and teachers. “I want to thank unions and local authorities for engaging in a positive way in the negotiations. The result today will give learners and parents piece of mind and together we can focus on teaching and learning. I am also looking forward to working with our partners on the workload-related issues which we have identified together.” To get our free daily briefing on the biggest issues affection the nation, Wales Matters, click here . Read next: Teachers and school staff told to re-apply for their jobs in Pontypridd schools shake up 'Terrifying, frightening and extremely stressful': Headteachers in Wales on how it feels having their schools inspected Headteachers fear schools will have to pick up bill for pay rise offered in Wales Wales faces massive shortage of specialist physics and chemistry teachers The figure that shows why teachers went on strike in Wales","pubDate":"2023-03-23 17:10:40","image_url":"https://i2-prod.walesonline.co.uk/incoming/article26545544.ece/ALTERNATES/s615/1_Teachers-at-a-strike-rally-outside-the-Senedd-on-March-2.jpg","id":"61f5887c-940e-4323-8b7d-ce2436770e06"},{"title":"What the color of your snot says about your health","link":"https://www.dailymail.co.uk/health/article-11887615/What-color-snot-says-health.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","description":"Whether dark or light, hard or soft - the color and consistency of your snot could be an early warning sign for health problems. Doctors say it's worth keeping an eye on as allergy season arrives.","content":"What color are YOUR boogers? Here's what it says about your health The color of your snot can help you determine why you are suffering sniffles White, yellow and green snot often signal different stages of an infection READ MORE: A devastating allergy season is coming earlier than usual in 2023 By Mansur Shaheen Deputy Health Editor For Dailymail.Com Updated: 17:08, 23 March 2023 e-mail 68 shares 196 View comments Whether dark or light, hard or soft — the color and consistency of your snot could be an early warning sign for health problems. Doctors say it's worth keeping an eye on, particularly as allergy season arrives and leaves millions prone to the sniffles. Clear, thin snot is considered healthy, but if it is too white, it could signal congestion or that you are about to come down with an illness. A yellow or green color usually comes when you are most sick and happens when the body flushes out white blood cells that are used to fight infections. If the color in your tissue is red, pink or brown, it could mean there is damage your internal nose tissue or something much more serious. So, what do your boogers say about your health? The color of your snot can give you a few hints as to why you have a runny nose. In some cases, for instance when it is clear, it is relatively harmless and usually caused by pollen allergies. If it is black, though, it could signal that you have been infected by a deadly fungus Clear Experts generally say that clear snot is not much to worry about. The natural color of snot is relatively transparent, so colorless flow from the nose means nothing is wrong. If you find yourself sneezing or having to blow your nose often, so long as the snot remains clear, it is usually a sign of common allergies. Pollen allergies usually erupt around this time of the year. White White snot is often the earliest sign that you are about to get sick. When someone's mucus has low water content, it will lose its usual colorless glow and instead turn a thick white color. Water content is usually lost during the early stages of a viral infection - such as the flu or Covid. One of the earliest symptoms the body suffers when sick is the inflammation of tissue in the nose. This swelling partially blocks the flow of mucus in the nose and causes it to lose its moisture as it passes through. By the time it reaches the tissue, it is significantly lacking in water, causing it to appear much thicker and cloudier than usual. A person blowing white snot should brace themselves to experience other symptoms of illness in the coming days. Yellow READ MORE: What does your poo say about YOU? Color guide reveals the health clues in stools A comprehensive guide to poo colors has been drawn up and it can reveal a lot about your health. <!- - ad: https://mads.dailymail.co.uk/v8/gb/health/none/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement A person's snot will often turn yellow once they are in the throws of illness. When a person gets sick, white blood cells swarm infected cells and battle the virus to remove it from the body. Consistency will be similar to that of an egg white. It will be a light, but dull yellow color. White blood cells will valiantly die for the cause. When your body ejects infected cells from the body — through snot in many cases — the dead cells go with them. It is the pile of dead cells that causes snot to earn its yellow coloring. Doctors say there is usually not much to worry about if snot remains in this state. Green When a person is suffering a serious infection, or in the latter stages of one, they may see their snot turn green. Green snot means there are even more dead white blood cells than there are when it turns yellow. It is usually a duller and more earthy green color and relatively thick. While there usually is still not much to worry about, if green snot persists for more than two weeks someone should seek out a doctor. Pink or red A pinkish or reddish tint in a person's mucus is usually a result of exactly what they think it is. Blood. The slight red tint that appears in snot is usually provided by a small bit of blood. There are a few potential causes for a bloody nose, but experts say that is usually is not much to worry about. The most common causes are dry air, usually because the weather outdoors is cold or a person is indoors where an air conditioner or dehumidifier is being used. Sometimes, a person picking their nose may also damage their nose tissue, causing a slight bleed. They will usually recover within a day. A bloody nose could also spawn from a cold, drug use or inhaling chemical irritants, like cleaning supplies. Doctors recommend seeking out medical attention if you lose a cup or more of blood. Black There are a few reasons snot could appear black, ranging from innocuous to highly dangerous. In many cases, black snot is a sign that someone has inhaled some sort of pollutant like smoke or soot. It is a surprisingly common occurrence among people who work on construction sites or who smoke cigarettes regularly. But, in rare cases the black snot could be an early sign a person has been infected with Mucormycosis. Also known as black fungus, a person can contract the disease after inhaling its spores. It is incredibly rare, only appearing in one of every 1million people, according to the World Health Organization, Because of this, it can be hard to diagnose, though. Doctors are not familiar with it and could take them some time to determine if it is the cause of infection. It has a mortality rate of around 50 percent, making it one of the more dangerous fungal infections in existence. Share or comment on this article: What the color of your snot says about your health e-mail 68 shares Add comment Comments 195 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-23 17:08:57","image_url":"https://i.dailymail.co.uk/1s/2023/03/22/21/68975401-0-image-m-41_1679521080398.jpg","id":"afb74a57-ca81-43c6-a81f-3d8fb3c19518"},{"title":"Take a look at King Charles' old Land Rover being sold at auction","link":"https://www.walesonline.co.uk/news/uk-news/gallery/king-charles-land-rover-sale-26544583","description":"Discovery 3 model was delivered to The Royal Garage in 2007 to the then Prince of Wales","content":"If you fancy driving around in a car fit for a king then look no further - King Charles' old Land Rover is up for sale. The car is being sold at auction and bidding ends tonight (March 23). The Discovery 3 model Land Rover was delivered to Highgrove House in 2007 for the then Prince of Wales. It is being sold with a letter dated January of that year to King Charles' chauffeur, Tim Williams. The document confirms the Tonga Green car was delivered to The Royal Garage at HighGrove House. It is signed by George Hassall MVO, director of royal & diplomatic affairs. With 117,816 miles on the clock, the car is now on to its third owner. Collecting Cars, which is handling the sale of the motor describes it as \"a handsome example of the Land Rover Discovery 3, with excellent documented royal provenance.\" The online auction ends at 7.40pm today (March 23). At the time of writing the current bid stands at £5,550. This wishing to bid on the car can do so online at . If you want to check out the car before you make a bid, you can check out pictures of the vehicle below.","pubDate":"2023-03-23 17:04:52","image_url":"https://i2-prod.chroniclelive.co.uk/incoming/article26544731.ece/ALTERNATES/s615/0_King-Charless-car.jpg","id":"45b2baec-84b5-44b6-b883-4b8262b586f2"},{"title":"Just 1% of £1.1bn lost to fraudulent Covid grants recovered","link":"https://www.walesonline.co.uk/news/uk-news/just-1-11bn-lost-fraudulent-26544541","description":"Checks were not made when handouts started to firms claiming they were hit by lockdowns","content":"Only one per cent of the estimated £1.1billion of taxpayer cash lost to fraudulent or erroneous grants paid to businesses during the pandemic has been recovered, Whitehall’s spending watchdog has said. The former Department for Business, Energy and Industrial Strategy (BEIS) initially did not require pre-payment checks when it started the handouts to firms that said they were hit by lockdowns in March 2020. Some 90 per cent of the losses due to error and fraud arose during the first wave of Covid-19 grant schemes, the National Audit Office (NAO) said in a new report. Checks and improved data reduced the risk in later iterations. Just under five per cent of the £22.6bn distributed to businesses between March 2020 and March 2022 was lost. Only £11.4million, or 1%, had been clawed back by last month. Attempts by BEIS to identify losses were delayed until at least a year after the payments had been made. Council authorities tasked with pursuing the money had no financial incentive to do so as it would be paid back to central Government, according to the NAO. It said the Government must learn from its experience of working at speed with local authorities to pay out emergency grants to businesses. The watchdog’s head Gareth Davies said: “The new Department for Business and Trade can now use these lessons to improve contingency planning and to build government resilience for responding to future national emergencies. BEIS and local government deserve credit for working quickly to set up and distribute grants to businesses. Early schemes lost significant sums to error and fraud, but BEIS addressed this in later iterations. “The Government does not yet know the impact of these grants, in terms of maintaining jobs or how much support might have been given to businesses which did not need it. Without such an assessment, an overall judgement about the value for money of the schemes remains open.” The Labour chairwoman of the Public Accounts Committee Dame Meg Hillier said: “Government moved at speed to provide grants to businesses to support the high street during the pandemic. However in doing so, an estimated £1.1bn was lost to fraud and error, and to date only 1% of this has been recovered. “It is now up to the Department for Business and Trade and the rest of government to act on the lessons from this experience it has learnt so it can be on the front foot for the next crisis.\" Subscribe here for the latest news where you live A spokesperson for the Department for Business and Trade, recently created after Prime Minister Rishi Sunak split up BEIS, said: “This report confirms that our Covid-19 business grant schemes helped to secure millions of businesses and livelihoods through the pandemic, supporting jobs and the economy during unprecedented times. No amount of error and fraud is acceptable, and we are continuing to work hard to recover these funds where possible.” But it is not possible to recover everything, the department acknowledged.","pubDate":"2023-03-23 16:57:34","image_url":"https://i2-prod.walesonline.co.uk/news/uk-news/article26544734.ece/ALTERNATES/s615/0_JS231067305.jpg","id":"a6839ac8-fbae-4be5-83fe-395d3fb7e583"},{"content":"Mayor of Cambridgeshire and Peterborough Dr Nik Johnson will be the authority’s representative at the partnership. Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Joining the rehashed Oxford to Cambridge Partnership will help the Cambridgeshire and Peterborough Combined Authority \"achieve growth\", a report has said. Previously known as the ‘Oxford Cambridge Arc’, the redesigned organisation aims to “champion” the region and help the area to “achieve environmentally sustainable and inclusive growth”. The project had been government led when it was first announced, but in January, Michael Gove, the Secretary of State for Levelling Up, Housing and Communities, confirmed his support for the new ‘pan-regional partnership’ led by public and private sector groups across the Oxford to Cambridge corridor area. A report to the Combined Authority board meeting earlier this week (March 22), said being a part of the partnership could help the authority to meet its own aims. It said: “The Combined Authority’s corporate strategy focuses on four strategic priority areas: achieving good growth; increasing connectivity; ambitious skills and employment opportunities; and enabling resilient communities. Read more: OxCam Arc 'failed' as massive project didn't show what it would offer people “It also recognises that strong partnership working and delivery as a key component in enabling this strategy to be successfully delivered. Membership of the pan-regional partnership will support the Combined Authority in its delivery of the corporate strategy through stronger collaboration, more efficient working and further strengthening joint working and influence with central government”. The board agreed to confirm the Combined Authority’s intention to become a member of the partnership, and appoint the Mayor Dr Nik Johnson as the authority’s representative. READ MORE: OxCam Arc 'failed' as massive project didn't show what it would offer people Cambridge to get £1m to build affordable homes Search for bus companies to take on three at risk Cambs bus routes launches Developer's bid for 425 homes on edge of Cambridge should be refused, planners say Cambourne to Cambridge busway takes step forward as council agrees to submit plans Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire and Peterborough Combined Authority Cambridgeshire Mayor Cambridgeshire","description":"The organisation formally called the Oxford Cambridge Arc has been redesigned with new priorities, the Cambridgeshire and Peterborough Combined Authority thinks matches its own.","id":"5b943364-f51d-4c26-9411-711fdd3fe474","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26543843.ece/ALTERNATES/s615/0_BOX_CAMB_Equiano_003JPG.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/combined-authority-agrees-join-oxford-26542684","pubDate":"2023-03-23 16:00:05","title":"Combined Authority agrees to join Oxford to Cambridge Partnership"},{"content":"WE all fart and it's something that is completely normal. But you may have noticed that sometimes when you pass gas , it feels a little warmer than others. 1 One expert has revealed the real reason as to why your farts feel warm Credit: Getty Now one expert has revealed exactly why sometimes farts can feel hot when they exit the body and what really causes that uncomfortable burning sensation. Clinical associate professor in the Division of Gastroenterology at NYU Langone Health, Lisa Ganjhu explained that this humid feeling is based on your body temperature . \"The heat of the gas that comes out of your body is going to be the same temperature as what your body is,\" the expert told Men's Health . The medic explained that the burning sensation you might feel when you let one rip, could be down either acidic or spicy foods. This could include dishes such as curry , or meals that include acidic fruit like lemons and limes. Prof Ganjhu added: \"If it burns your mouth going down it’s going to burn your butt coming out,\" Professor Ganjhu added. \"The tissue in your mouth is very similar to the tissue in your rectum.\" The NHS states that if you have excessive farts or if your wind has become particularly smelly , then there are things you can do to quell it. Most read in Health WHEELY GOOD I live in a tiny wagon that cost me just £200 to build - I love the simple life MAKE IT STOP Channel 4 fans left 'screaming and being sick' at one of TV's grimmest moments YOU'RE FIRED BBC makes big decision on whether axed Apprentice flop will appear in final 'STOP JUDGING' People judged my outfit in Asda but I don't care, I'm proud of my mum bod This includes eating smaller meals more often, drinking and chewing food slowly with your mouth closed and exercising on a regular basis in order to improve how your body digests food. Guidance states that you should also try drinking peppermint tea. However, if your farts are getting out of hand, the experts said you should avoid chewing gum or sucking sweets in order to avoid inhaling more air. You should also stay away from beer , wine or fruit juice and foods that are hard to digest. When to see a GP The NHS states that you should see a GP if farting is affecting your life and treatments from the pharmacy and self-help haven't worked. You should also book in to see a medic if you have a stomach ache or bloating that will not go away or keeps coming back. If you keep getting constipation or diarrhoea or if you've lost weight without trying then you should also see your GP. If you've had blood in your poo for three weeks or longer then it's important to get help. Read more on the Scottish Sun GO FISH Proud catfish shows off glow-up but men say they’d chew their arm off to get away NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 These symptoms might be down to issues like constipation or irritable bowel syndrome. But if in doubt, go and get checked out.","description":"WE all fart and it's something that is completely ","id":"c56bc024-1998-466b-ae3b-6d617d36c465","link":"https://www.thescottishsun.co.uk/health/10411530/people-just-realising-farts-feel-warm-real-cause-burning/","pubDate":"2023-03-23 15:45:09","title":"People are only just realising why some farts feel warm and the real cause of that burning sensation"},{"content":"A NURSING student who nearly died from a mystery illness is currently waiting for a kidney transplant in a race against time to save her life. Kristin Hamill, 25, became seriously ill last June which caused major damage to her kidneys and liver and left her in intensive care. 5 Kristin Hamill became seriously ill last June 5 The mystery illness caused major damage to her kidneys and liver 5 She is currently receiving dialysis three to four times a week to keep her alive Her family were even told to prepare to say their final goodbyes as doctors were unsure if she'd survive the night. The student, from Greenock, is currently receiving dialysis three to four times a week to keep her alive. On the morning of the horror ordeal, she woke up with slurred speech, blue lips and extreme abdominal pain before she started vomiting blood. She was rushed to Inverclyde Royal and taken straight into resus where she suffered a major haemorrhage and was diagnosed with sepsis and pneumonia. read more health stories HEART STOP I died & came back - there’s no light to walk towards - you shouldn't fear death HEADY HEIGHTS Man stunned after brain tumour op leaves him with surprising side effect Doctors feared the worst for Kristin and were unsure if she would make it through the night. Healthcare professionals managed to stabilise Kristin's condition enough so she could have surgery to stop the bleeding in her stomach. Due to the severity of the major haemorrhage she suffered, her blood pressure dropped critically low which caused kidney and liver failure. Kristin told the Scottish Sun: \"On the day I took ill I knew that I was really sick given my symptoms. Most read in Health EYE SORE Three dead, 8 blind and 4 have eyeballs removed after using contaminated eyedrops BUGBEAR The hearing condition leaving millions of Brits angry - are you affected? NODDING OFF Not getting enough sleep ‘increases your risk of silent killer by 74%’ SNACK ATTACK How your favourite snacks change your brain to make you pile on weight \"But due to the sepsis, the infection took over and caused confusion, I wasn’t able to react in a way I would have had I seen this symptoms with one of my own patients. \"I phoned for an ambulance at 7am but they said they were very busy and that I should wait and phone my GP. \"I was in and out of consciousness it was about 9.30am by the time I phoned GP. \"They sent a GP to the house at 11am and by midday I was in resus in Inverclyde Royal Hospital getting blood transfusions. \"My mum was asked to call the family as they didn't think I would survive. \"I was stable enough to get to theatre to have surgery to stop the bleeding in my stomach and then transferred to intensive care.\" She was then transferred to Glasgow 's Queen Elizabeth University Hospital where she spent four months in the high dependency renal unit where started on dialysis and had several blood transfusions which left her unable to walk or eat. But despite numerous tests and scans, doctors still don't know what caused Kristin to suffer from sepsis and pneumonia. She added: \"I deteriorated again and was transferred to the QEUH intensive care for a few days and then 4A Renal in the QEUH for four and a half months. \"Throughout my time there there were many ups and downs. \"I didn’t eat for four months and was fed via a feeding tube. \"There were many days that I was not expected to survive.\" The student was then discharged in October. And in December, she was told that her kidneys would not recover from the damage and a transplant is her only hope. 5 Doctors still don't know what caused Kristin to suffer from sepsis and pneumonia 5 Kristin was told that her kidneys would not recover from the damage and a transplant is her only hope She may also be facing a liver transplant in the future, but doctors are hoping the organ will repair on its own. Kristin receives dialysis treatment three to four times a week to keep her alive. She admits that the treatment is hard going and often causes her to collapse. She is now is a race against time to find a donor to save her life. Kristin added: \"Dialysis is hard going, my fluids and diet is restricted. \"I can only drink one litre of fluids a day as I don’t pass urine so dialysis takes the fluid off for me. I am on restricted amounts of phosphate, potassium and salt. \"The dialysis treatment is three to four times a week and often causes me to collapse after due to the stress it puts on your body and blood pressure drop. \"But the dialysis nurses make a difficult five hours much easier with so much love and support that they give. \"We try to have a laugh and the other patients on dialysis have become my family.\" Kristin and her family and friends have launched a desperate appeal to find possible donors and have even taken to Facebook to find a match. Over 200 people have since come forward to be considered as a possible donor. She added: \"The response from the community regarding transplant donation forms has been incredible. \"I cannot believe how kind everyone has been coming forward and offering something so huge. Everyone has really pulled together. \"A new kidney would just give me my life back, let me have children, come off dialysis and get back to work. \"I miss and love my job so much. \"And if they’re not a match for me, I pray that someone else gets good news from this. \"I want to say a thank you to all my family, friends 4A QEUH and IRH dialysis unit for all their love and support.\" To sign up as a potential kidney donor for Kristin, fill in the application here - recipient details are Kristin Hamill, 23.12.1997 Read more on the Scottish Sun GO FISH Proud catfish shows off glow-up but men say they’d chew their arm off to get away NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 Kristin is also raising funds for the for IRH Dialysis Unit & 4A Renal QEUH, saying that she is \"eternally grateful to every staff member involved in my care in the most terrifying time of our lives\". You can donate to the fundraising page here . We pay for your stories and videos! Do you have a story or video for The Scottish Sun? Email us at scoop@thesun.co.uk or call 0141 420 5200","description":"A NURSING student who nearly died from a mystery i","id":"eaf846a4-7925-43aa-9f43-c18f010930fe","link":"https://www.thescottishsun.co.uk/health/10410425/blue-lips-slurred-speech-mystery-illness-family/","pubDate":"2023-03-23 15:43:09","title":"I almost died from mystery illness – my family was told to prepare for final goodbye"},{"content":"The revamped Oxford to Cambridge partnership still faces the problem of getting public support, a conference heard. Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice ‘The Oxford Cambridge Arc failed’ is the message from Cambridgeshire leaders as they look to move the redesigned organisation away from its beginnings. What was previously known as the ‘Arc’ has now become a ‘pan-regional partnership’, led by public and private sector groups in the Oxford to Cambridge corridor area. The organisation is now taking a ‘bottom up approach’ rather than being government led. Political leaders have looked to distance themselves from the ‘Arc’, highlighting the redesigned approach and new priorities of supporting business innovation, but through environmentally sustainable and inclusive growth. The OxCam Arc was initially announced by the government to support innovation and economic growth in the areas between Oxford, Milton Keynes and Cambridge. Plans for one-million homes, a new major road, and the East West Rail project were all linked to the scheme. The road and the homes figure were later dropped and for a while the scheme was believed by some to have been “flushed away”. However, the government has now handed over the reins to regional leaders and groups, who say this change of approach has moved the plans from the “winter and into the spring”. Read more: Cambridge to get £1m to build affordable homes At a Westminster Social Policy Forum conference on the next steps for the Oxford to Cambridge region (March 17), Peter Horrocks CBE, chair of the South East Midlands Local Enterprise Partnership, and board member in the new partnership, said there was a new “dual ambition” for the partnership to support business innovation, but achieve this in an environmentally stable way, and with inclusive growth. This new focus on the environment was stressed by Councillor Bridget Smith, leader of South Cambridgeshire District Council , and the shadow board member for the environment in the partnership. Cllr Smith said she ‘carries the political scars from what was the Arc’, and said the Arc had “failed” as it did not show people living within its area what it would offer them. She said: “It seemed to be about carbon heavy infrastructure and housing, so it was no surprise people saw that as a threat. This move to a bottom up approach is good. As council leaders we all know we have our own problems, we were just hearing about the water problems affecting our area, there are big problems we cannot solve ourselves. “Entering a pan-regional partnership will help addressing those problems that can be solved strategically regionally, that we have no power or ability to solve alone. There was a comment that the last 10 years have been wasted. I have been involved for the last five years, and they have been really productive. “What we have are really good relationships across the Oxford to Cambridge area, they transcend politics and transcend sectors. Everybody, universities, business sectors, all recognise the value of working together and are all excited about the opportunities of the new pan-regional partnership. We know our areas best and we know our problems best, and as I said before we cannot solve them alone.” 'If we work together we have much more choice in addressing the challenges we face' Dan Thorp, policy director at Cambridge Ahead, said it should be a “real priority” for the growth to be more sustainable and inclusive for the people actually living in the area. He said many parts of the region do not feel they are benefitting from what is going on, and said there were “tangible things” that could be done, such as finding ways to support people to access new jobs in the area. Councillor Anna Smith, leader of Cambridge City Council , also stressed the importance that the partnership made sure the benefits of growth were felt by people in the region. She said: “I am really pleased that this is a new pan-regional partnership, I am careful using that term and not the ‘Arc’, as that is something which had very different aims. “I am personally pleased we lost the top down approach and focus on housing targets. This new partnership is and should be about inclusive sustainable economic development that works for all those who live, work and employ people in our region. We really face significant pressures, yes there is great wealth and great opportunities, but there is so much to address to ensure that everyone shares in the successes of this region. “See in my own city, Cambridge is an area where there is significant deprivation side-by-side with companies and world leading universities. Only if we collaborate can we address so many of those challenges because our workers, companies, and transport infrastructure does not fit one district council.” Cllr Smith highlighted the need to improve transport infrastructure to allow people across the region to be able to travel and access the educational and work opportunities. She also said this focus of ensuring the benefits are felt needed to also include the areas on the geographical edges of the partnership corridor, highlighting Fenland in Cambridgeshire . Cllr Smith said: “If we work together we have much more choice in addressing the challenges we face, much more choice of opportunities we have to support residents and support businesses, and demonstrate our region is really open for business.” The conference heard that the new partnership still faced problems the ‘Arc’ had, including with getting public support. Dr Dave Valler, professor of spatial planning at Oxford Brookes University, said there were still questions over whether the partnership could establish a “clear economic rationale for the area” and whether the Oxford to Cambridge corridor “makes sense economically”. He said there were also questions over the “reality” of central government’s continued backing and how much financial support there would be. Dr Valler said there was still “strong opposition” across the areas within the partnership corridor, and said the partnership needed to work on building support. Lord Andrew Lansley, who chaired the conference and is also part of the Cambridgeshire Development Forum, said it would “not be easy” for the partnership, but said it “might be staring in the right place this time, rather than the wrong place”. READ MORE: Cambridge to get £1m to build affordable homes Search for bus companies to take on three at risk Cambs bus routes launches Developer's bid for 425 homes on edge of Cambridge should be refused, planners say Huntingdonshire agrees call out for major housing blueprint Cambourne to Cambridge busway takes step forward as council agrees to submit plans Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire Cambridge","description":"The government led Oxford Cambridge Arc has been redesigned and handed over to regional leaders. But what do the changes mean for people in Cambridgeshire?","id":"b85900ab-f75e-4134-b5d6-70b533a47dfa","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26542515.ece/ALTERNATES/s615/0_BOX_CAMB_Covid_027JPG.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/oxcam-arc-failed-massive-project-26542321","pubDate":"2023-03-23 15:27:35","title":"OxCam Arc 'failed' as massive project didn't show what it would offer people"},{"content":"The potential congestion charge caused division between supporters and those who oppose the plans. Group 28 Breaking updates from Cambridgeshire's roads, rails and airports Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice The outcome of a council vote has quashed hopes some may have for a referendum for the proposed Cambridge congestion charge . Councillors at Cambridgeshire County Council (CCC) voted on whether or not to hold a referendum for the controversial plans which would see those driving into the city paying a congestion charge in a bid to persuade more people to use buses or 'active travel' options. The decision is a key moment in the lead up to the next expected update from the Greater Cambridge Partnership (GCP) in the summer. It is then that more information on the 'London-style' bus network is expected . Councillors from the CCC, which is run by a Labour, Liberal Democrat and independent alliance, rejected the motion for a local referendum with 32 votes against and 24 in favour at the council meeting at New Shire Hall. If a referendum was approved, residents would be given a straight yes/no vote on May 4, the same date as local elections. The referendum would've cost £1.5m to hold, according to the council agenda . Read more: Calls for Cambridge congestion charge referendum slapped down as issue ‘too complex for yes, no vote’ Speaking about the council decision, Cllr Elisa Meschini, Chair of the GCP’s Executive Board, said it \"makes no sense\" to hold a referendum in May before consultation responses are properly looked through. She said: \"We're still going through the responses to the consultation which will inevitably result in changes to the currently proposed scheme, and then we'll need to decide whether, based on the responses to the consultation, it is possible to design a viable scheme that takes the feedback appropriately into consideration.\" She added: \"A referendum on the 'principle' in May is just a political trick by the opposition, it would give us no useful information and stoke polarisation and misinformation even further among the community.\" Talking about how useful a referendum could be, she did not believe that \"yes/no questions\" were the way to design policy. \"We have a problem to solve in Cambridgeshire with lack of public service infrastructure and we'll have that problem whichever way a referendum goes,\" she said. \"We can't pass the buck by hiding behind the answer to a referendum. We still have a job to do.\" Cllr Heather Williams, the Conservative opposition leader on South Cambridgeshire District Council, said of the vote: “I think it’s very disappointing that we didn’t get a majority but I don’t think this means we give up. \"I felt the debate was interesting, especially to see the other perspective. I was shocked to hear the councillors had a mandate to do it when it wasn’t in their election literature. I fundamentally believe that the the only fair way to decide this is for people to have their own say.” In the debate, Cllr Lorna Dupré, a Liberal Democrat, said the proposal for a “simplistic yes, no referendum” on the charge was the “worst way to solve a complex set of issues” Cllr Williams added: \"I took slight issue with the suggestion it was too complicated an issue for residents to understand, and I think that’s a dangerous road for them to be treading. \"We should never underestimate the electorate's abilities to make decisions. If people don’t understand what’s happening, it’s our job to make it then that’s our failure to keep it accessible, a lazy it's a lazy excuse.\" Lucy Frazer, MP for South East Cambridgeshire said: \"I am disappointed that the motion was rejected by County Councillors, but I will continue to campaign against the GCP proposals which would charge my constituents for driving their cars into the charging zone without offering them a viable travel alternative.\" Neil Mackay, a Committee member of the Cambridgeshire Residents Group (CRG) said of the result of the debate: “What a contentious suggestion that people are not intelligent enough to understand the issues. “None of those councillors were elected on the mandate to vote for the congestion charge, all bar one, and he didn’t even mention it in the election manifesto. They’re just pushing it through on party political grounds, it’s a crazy plan. “They pushed back the results of the consultation until after the May election for obvious political reasons. It’s crazy, you have a situation when you have councillors from Norfolk and Peterborough deciding what happens in Cambridge.\" Sarah Hughes, a spokesperson of the Cambridgeshire Sustainable Travel Alliance said: \"We do not believe that a referendum (local poll) on the congestion charge is the answer. The feedback from the Making Connections 2022 consultation is still under analysis and has not yet been released. \"Referendums are also votes on a single issue, however the Making Connections 2022 consultation is multi-faceted. For these reasons, and others set out in our briefing paper on the matter published on our website cambstravelalliance.org , we welcome the result of the vote at yesterday’s Council meeting.\" READ MORE: Calls for Cambridge congestion charge referendum slapped down as issue ‘too complex for yes, no vote’ Plans for hundreds of new homes on Cambridge sidings would be refused Roads for 1,200 home estate on edge of Cambridge agreed Calls for action on Cambridge road being used by traffic as 'rat-run' Cambridge taxi driver slams state of city's roads after pothole causes £500 damage Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire County Council Cambridge Traffic & Travel Cambridge Congestion Charge","description":"\"It makes no sense to hold a referendum in May when we don't have a scheme on the table yet. We're still going through the responses to the consultation which will inevitably result in changes to the currently proposed scheme.\"","id":"34934737-99a6-4131-8a62-8f187eb1f061","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26526596.ece/ALTERNATES/s615/0_HB_TMS_210323congestioncharge001.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/holding-cambridge-congestion-charge-referendum-26532067","pubDate":"2023-03-23 15:19:00","title":"Holding Cambridge congestion charge referendum 'makes no sense', says councillor"},{"content":"AN AI can now answer blind people’s questions about the world around them. The Be My Eyes app previously helped users identify anything from what ingredients are in food to whether they are using shampoo or conditioner using volunteers on a video call. 2 The Be My Eyes app is set to be upgraded so AI technology can helps answer blind people’s questions about the world around them Credit: PR Handout 2 Blind content creator Lucy Edwards was brought to tears while using the free app when it described what a model was wearing in a fashion catalogue Credit: Instagram / Lucy Edwards Now, its new Virtual Volunteer tool, which is powered by OpenAI, will be able to perform many of the same tasks more quickly. It will allow blind or partially sighted people to take pictures of nearly anything, which will then be described in text form to help them make decisions. Blind content creator Lucy Edwards was brought to tears while using the free app when it described what a model was wearing in a fashion catalogue. She said: “I’ve always dreamed of buying books like this. I know it’s stupid I’m crying over a book but it’s more than that to me.” In a video posted on Instagram, Lucy took a few snaps of the book before typing in her question. It described the colours of the dresses being worn by models as well as offering to describe the clothes in more detail. She responded by speaking to the app, before it described the neckline, length of sleeve and type of hem on the first dress — prompting the fashion-obsessed influencer to tear up. In a series of other posts, she used the app to help decipher foreign products at a supermarket and navigate the gym, saying it “gave her autonomy back”. Most read in Health WHEELY GOOD I live in a tiny wagon that cost me just £200 to build - I love the simple life YOU'RE FIRED BBC makes big decision on whether axed Apprentice flop will appear in final 'STOP JUDGING' People judged my outfit in Asda but I don't care, I'm proud of my mum bod NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 Be My Eyes chief executive Mike Buckley said the new feature was prompted by some of its millions of users saying they felt uncomfortable with using volunteers’ time to help them. He told Mashable : “This is directly responsive to the people who are blind and low-vision in our community that want something like this. “Up to this point we just haven't seen a technological tool that would solve these needs quickly enough and accurately enough to launch something like this. “We know AI is powerful, but it's got to be shaped and moved and fostered in a way that this community owns, and serves their needs.” Around 2million people in Britain live with sightloss, with 240,000 registered as blind or partially sighted. The new feature is currently in beta testing and only available to a small subset of users. But the group will be expanded over the coming months and will be free to use.","description":"AN AI can now answer blind people’s questions abou","id":"c1daffc5-7e92-4e2d-a0e0-6199276974ee","link":"https://www.thescottishsun.co.uk/health/10411411/ai-answers-blind-peoples-questions-items-around/","pubDate":"2023-03-23 15:18:07","title":"New AI answers blind people’s questions about items around them – leaving users in tears"},{"content":"BLACK pee, turning to stone, giant hands and elderly looking children. These are all common symptoms of very rare health conditions, which many people, including medical professionals, have never heard of. 1 Black urine disease is a very rare inherited disorder that prevents the body from fully breaking down proteins Credit: Getty But they exists, and can be a a major source of difficulty and shame for those who suffer from them. Here, we look four of the more unusual medical conditions that some some people across the world have to live with. 1. Alkaptonuria Frequency: one in one million people globally. Alkaptonuria, or “black urine disease”, is a very rare inherited disorder that prevents the body from fully breaking down proteins. This results in a build-up of a chemical called homogentisic acid in the body, according to the NHS. This can turn urine and other parts of the body a dark colour and lead to a range of health problems over time such as brittle bones, shortness of breath, difficulty breathing and heart disease. Treatments There is currently no specific treatment or cure, but a diet low in protein is recommended to decrease the build up. Most read in Health WHEELY GOOD I live in a tiny wagon that cost me just £200 to build - I love the simple life YOU'RE FIRED BBC makes big decision on whether axed Apprentice flop will appear in final 'STOP JUDGING' People judged my outfit in Asda but I don't care, I'm proud of my mum bod NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 People with this condition have a normal life expectancy, but with a lesser quality of life. 2. Hutchinson-Gilford progeria syndrome Frequency: one in four million people globally . Hutchinson-Gilford progeria syndrome (HGPS), is a rare, fatal, genetic condition characterised by the dramatic, rapid appearance of aging in beginning in childhood. According to the National Organisation for Rare Diseases (NORD), children born with the condition usually begin showing symptoms at around 24 months of age. Signs include includes prominent eyes, a thin beaky nose, thin lips, small chin and protruding ears. The condition affects multiple systems of the body, causing physical and metabolic abnormalities. Treatments There is currently no cure but certain symptoms can be treated. Children with the condition usually die at around the age of 14 of heart failure, the NHS says. 3. Alice in wonderland syndrome Frequency: currently unknown. Alice in Wonderland syndrome causes short term episodes of disorientation and distorted perception in those who suffer. It affects the way your brain perceives your environment and how your body looks – hence it being named after the popular children’s fantasy novel. Sufferer will find that they are confused as to the size and shape of their body parts. The parts usually mentioned are the head and hands; growth seems more usual than shrinkage. Scientists do not know for sure what causes the disease. But research suggests it could be related to unusual brain activity caused by blood flow problems to the main sensory organs, such as sight. The syndrome can be related to many factors including stress , epilepsy, stroke , brain tumour and hallucinogenic drugs. Treatments There is no medical treatment for the condition. Doctors recommend the best thing to do is rest as the symptoms are not harmful. The Brain Charity offer help and support to those suffering from AIWS. 4. Rasmussen’s encephalitis Frequency: In the UK it is 1.7 per 10million people Rasmussen’s encephalitis usually occurs in children under the age of 10. According to the NHS, children with the condition experience frequent and severe seizures, loss of motor skills and speech, paralysis on one side of the body, inflammation of the brain and mental deterioration. It can lead to the destruction or removal of a part of the affected child’s brain. Most individuals with Rasmussen’s encephalitis will experience progressive brain damage over the course of the first eight to 12 months, and then enter a phase of permanent, but stable, neurological deficits. Treatments There are treatments to decrease brain inflammation at the acute stage, but there is no treatment to ultimately prevent disability. 5. Stoneman syndrome Fibrodysplasia ossificans progressive (FOP), often known as stoneman syndrome, slowly turns connective tissue such as tendons, muscles and ligaments into bone. The progression of the disorders starts from the neck to shoulders, and gradually proceeds to lower parts of the body and finally to the legs, says NORD. Bone growth is triggered when an area of the body is injured. Treatments The condition does not have an effective treatment that can cure it or stop its progression. Read more on the Scottish Sun GO FISH Proud catfish shows off glow-up but men say they’d chew their arm off to get away NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 Most patients are wheelchair-bound by the end of the second decade of life. People with the condition commonly die of complications of thoracic insufficiency syndrome - which is a chest wall deformity that interferes with lung function and development.","description":"BLACK pee, turning to stone, giant hands and elder","id":"40f92e7d-1053-427e-8521-65bb3c937feb","link":"https://www.thescottishsun.co.uk/health/10411342/rare-illness-black-pee/","pubDate":"2023-03-23 15:11:03","title":"The rare condition that can make your pee black and 4 other strange illnesses you’ve never heard of"},{"content":"Othersyde, mock-up of new 'crypto bar' in Cambridge (Image: OtherSyde) Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice The popular bar and venue OtherSyde closed its waterfront venue in Cambridge back in September of this year. Soon after, though, they released exciting new plans for a \"crypto bar\" and game space on Mitcham's Corner, Cambridge. The new OtherSyde venue will now embark on the process of enlisting workmen to start working on the development. They hope to open their doors to customers in June or July 2023. OtherSyde have now released photos showing what the new place could look like after announcing their \"delight\" at finalising their lease arrangements. They said in a post on Tuesday, March 21: \"We are delighted to announce that we have just completed the lease arrangements on our new venue. Read more: OtherSyde owner to open new 'crypto bar' and game space in former Cambridge bank \"It's all taken a bit longer than we expected, but we are ready to start work on fitting out the space and hope to open again for business within the next three to four months.\" Speaking about the recent updates, director of OtherSyde, Matthew Taylor said: \"The picture above is our architect's impression of what the venue, that we're calling the Alcademy, will look like when completed. We wanted to do something much more than having a coffee, you feel enriched in some way of getting involved in whatever it may be.\" The new crypto bar will be based around famous Cantabrigians and there will be puzzles dotted around the venue as well as walking tours focussing on Cambridge's most famous personalities. Explaining how it felt to finally start work on the project, Matthew said: “It feels great to have everything signed off, it's been almost a year speaking to all sorts of places to get everything sorted out. It’s all quite complicated.\" Part of plans for the new venue include the live music events. Matthew said: “We’ve got to sort out noise levels to see what level of volume we’d be able to have in the venue, once we know that we can sort out all the acoustic needs, it’s good to finally get this point where we can start promoting it.\" Matthew envisions the space being used as a community hub. He explained: “We’re hoping to make the venue available for various political events, it’s what we were doing at the engineers house, so there’s a huge sense of freedom, and we can be open 12 months of the year. There’s also some outdoor seating.\" He added: “I think that all the area could become quite a hotspot, that’s our hope, because the whole street will have bars on it, and it will develop a character. The area has recently been designated a development zone by the council.\" READ NEXT: 'Successful bidder' found for Peterborough's Hereward Cross Shopping Centre Peterborough Regional Pool closed after potentially dangerous bacteria found All the Cambridgeshire criminals who have been jailed this week Cambs teens guilty of attempted murders after 'vicious' play park knife attacks Police called to 'reports of violence' on Cambs street Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridge What's on in Cambridge Things to do Cambridge","description":"“It feels great to have everything signed off, it's been almost a year speaking to all sorts of places to get everything sorted out. It’s all quite complicated.\"","id":"42b10410-0eb1-4484-ae6d-4abca9796037","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26542216.ece/ALTERNATES/s615/1_JS294751810.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/othersyde-share-plans-what-new-26541592","pubDate":"2023-03-23 14:44:13","title":"OtherSyde share plans of what new 'crypto bar' could look like"},{"content":"ARTIFICIAL Tears manufacturer Ezricare has had to recall its products after users experienced horrific side effects from using the treatment. Here's what we know about why it has been recalled , and what people have said about the product. 1 EzriCare Artificial Tears are being recalled due to a link to an aggressive bacteria What is Ezricare Artificial Tears? Ezricare is a brand of eye drops, prescribed for eye dryness. It is an over-the-counter form of medication. Ezricare has recalled its products due to a link to an aggressive bacteria, which has caused deaths and lifechanging illnesses to users. Health authorities in the US have warned against purchasing the product while they continue their investigation. Why are the eyedrops being recalled? The products are being recalled due to a link to pseudomonas aeruginosa, a bacterial infection that is immune to antibiotics. Most of these have been attributed to eye drop companies Ezricare and Delsam Pharma. The bacteria starts through bad hygiene either due to hands that haven’t been washed or medical equipment and surfaces not being sanitized. According to the Centre For Disease Control And Prevention (CDC) at least three people have died after using the drops. Most read in Health WHEELY GOOD I live in a tiny wagon that cost me just £200 to build - I love the simple life MAKE IT STOP Channel 4 fans left 'screaming and being sick' at one of TV's grimmest moments YOU'RE FIRED BBC makes big decision on whether axed Apprentice flop will appear in final 'STOP JUDGING' People judged my outfit in Asda but I don't care, I'm proud of my mum bod Furthermore, other users have reported going blind after usage, and some have had to have their eyeballs surgically removed. Through data collected by the CDC between May 2022 and February 2023, at least 68 people have been infected with the bacteria. According to the CDC eye infection symptoms may include: Yellow, green, or clear discharge from the eye Eye pain or discomfort Redness of the eye or eyelid Feeling of something in your eye (foreign body sensation) Increased sensitivity to light Blurry vision What has been said about Ezricare Artificial Tears? A spokesperson for Ezricare said in February 2023 that they were “not aware of any testing that definitively links the pseudomonas aeruginosa outbreak to EzriCare Artificial Tears” but had taken steps to recall the product. A CDC spokesperson said in March 2023: “Patients who have used EzriCare or Delsam Pharma’s Artificial Tears and who have signs or symptoms of an eye infection should seek medical care immediately.” The Food and Drug Administration (FDA) have warned customers against buying other products from the brand as well, such as eye ointment, because of links to bacterial infection.","description":"ARTIFICIAL Tears manufacturer Ezricare has had to ","id":"ac261a04-9190-4da1-9b9c-fb2f77ce61bf","link":"https://www.thescottishsun.co.uk/health/10410598/ezricare-articifial-tears-eyedrops-recalled/","pubDate":"2023-03-23 13:23:31","title":"What is Ezricare Artificial Tears and why are the eyedrops being recalled?"},{"content":"A QUICK rub at your eye after a long day or if you've got some dust stuck in it might not seem like a big deal. But doctors say it's never a good idea to do this. 1 Rubbing your eyes could result in a fatal infection and other issues, experts have warned Here are nine reasons why you should resist that urge to itch - unless you really, really have to. 1. Risk of infection Your hands aren't always the cleanest. If you're giving your peepers a cheeky rub, you could transfer infection from your fingers into your eyes, Dr Deborah Lee from Dr Fox Pharmacy told Huffington Post . This could cause infections such as blepharitis, conjunctivitis, styes , cellulitis, keratitis, and uveitis, to name just a few. Cellulitis is an infection which makes your skin painful, hot and swollen. It can be very serious if you get it in your eye, the NHS says: the white part of your eye may become red. If the infection is not treated quickly, it can spread to other parts of the body, such as the muscles and bones. In extreme cases, it can cause blood poisoning - also known as sepsis - which can be fatal. Most read in Health WHEELY GOOD I live in a tiny wagon that cost me just £200 to build - I love the simple life YOU'RE FIRED BBC makes big decision on whether axed Apprentice flop will appear in final 'STOP JUDGING' People judged my outfit in Asda but I don't care, I'm proud of my mum bod NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 Sepsis is the body's extreme response to infection and is a life-threatening medical emergency, the Centre for Disease Control in the US states. If you wear contact lenses, you're also at greater risk of of corneal inflammation and infection , Dr Deborah added. Reusing lenses and wearing them overnight or in the shower can increase your risk of Acanthamoeba keratitis , which can cause severe pain and in a quarter of cases, blindness . Some other common bacterial infections that occur from hand-to-eye contamination include: staphylococcus streptococcus salmonella E. coli . 2. You can damage your cornea Your cornea is the clear outer layer at the front of the eyeball and acts as the window to your eye, the NHS says . Continual rubbing of the cornea can cause tiny scratches on it called corneal abrasions. Your eye then becomes pink and is sore and sensitive to light. If you've got something in your eye like a tiny woodchip or a piece of metal, avoid rubbing it, Dr Deborah advised. Doing so could make the object scratch your cornea or you could embed it further into your eye, which can be very painful and you might need to have it removed by a doctor or nurse . Corneal scratches - or abrasions - can also hurt a lot due to the many nerves supplying the area. It can take 24 to 48 hours for your eye to heal, according to Moorfields Eye Hospital . If you scratch the centre of your cornea, you could also temporarily affect your vision. 3. Small blood vessels may rupture This can cause bloodshot eyes, or give dark circles under the eyes. Rubbing your eyes can cause dark circles as the tissue around the eyes is thinner than elsewhere on the body. Experts from the Atlantic Eye Institute said: \"The delicate skin has equally delicate blood vessels right underneath. \"When you rub your eyes, those tiny capillaries and veins break very easily, and this causes bruising that makes dark eye circles even worse.\" 4. You could worsen pre-existing eye conditions If you're already short sighted, you might be worsening your vision by rubbing your peepers, Dr Deborah warned. And if you have glaucoma – raised pressure inside the eye – rubbing your eyeball further increases the pressure in the eye and can damage the optic nerve. This can cause further deterioration in your vision. 5. You could worsen allergy symptoms If hay or pollen fever is giving you itchy eyes, often all you want to do is give them a quick swipe. But rubbing your red and swollen eyes will makes them produce additional tears, leading to more histamine being released and worsening the problem. 6. You could thin your cornea Constantly rubbing your eye thin the cornea, leading it to develop a sort of cone-shaped bulge known as keratoconus. This can make you lose your vision and sometimes requires a corneal graft. 7. You could irritate your dry eyes Dry eyes are a pretty common condition - it happens when your peepers don't produce enough tears. But you should resist rubbing your eyes if you're plagued by this condition - treat it with artificial tears, moisturising gels or ointments instead. 8. You could age the skin around your eyes Rubbing your eyes leads to thickening of the skin around the eyes, known as lichenification. So you could be making the skin around them look more wrinkled. 9. You might be affecting your vision Rubbing the eye disrupts the blood flow in the eye, increases the pressure inside the eye on the retina and optic nerve, and hence can damage the optic nerve, reducing vision, Dr Deborah said. Retinal tears and detachment are more common in those who rub their eyes. Are there any benefits to rubbing your eyes? There are just a couple benefits to doing this, Dr Deborah admitted. “Putting pressure on your eyes is an effective way of relieving stress, as pressing on the eyeballs stimulates the vagus nerve, the major parasympathetic nerve of the body,” she explained. She said you can also gently rub your eyes after applying drops to help distribute the drops and lubricate your peeper. But if you feel a constant need to rub your eyes, this is a symptom that something is wrong, and you should seek medical help. Here's what to do instead of rubbing your eyes: Dr Deborah said to clean your eyes use some cotton wool soaked in warm water instead, to remove any dust or dirt from the eyelids or eyelashes. “Soak a flannel in warm, clean water. Wring it out so it is damp, and place it over your eye or eyes. Try and relax,” she added. “Next, apply some artificial tears or natural lubricant drops to the eye. Try not to rub or scratch the eyes. Wear gloves or mittens if needed.” Read more on the Scottish Sun GO FISH Proud catfish shows off glow-up but men say they’d chew their arm off to get away NO PANE, NO GAIN I was sick of staring into next door so transformed my windows for just £6 If you are thinking of using eye drops, it was recently revealed that a specific brand sold in the US has been linked to infections caused by a rare bacterial strain - but bear in mind these drops are not sold in the UK. Aside from rubbing your eyes, there are other daily activities that could be damaging your eyesight , including drinking too much coffee or not getting enough sleep.","description":"A QUICK rub at your eye after a long day or if you","id":"9f5f1edb-7d5a-4209-a05a-df213424b4a6","link":"https://www.thescottishsun.co.uk/health/10410553/never-rub-your-eyes-trigger-fatal-infections/","pubDate":"2023-03-23 13:04:59","title":"I’m a doctor and here’s why you should never rub your eyes – it can trigger fatal infections"}]