[{"title":"The space junk problem just got a cheap solution","link":"https://www.moneycontrol.com/news/technology/the-space-junk-problem-just-gotcheap-solution_16938271.html","description":"The US is getting better at spotting and dodging space debris in orbit, which is a cost-effective solution rather than some of the fancy and expensive technologies that are being touted.  But a comprehensive international space junk treaty is needed","content":"The International Space Station.\n\nLast week a hunk of space junk hurtled toward the International Space Station, putting the safety of astronauts and their orbiting outpost at risk. Fortunately, the cosmic hazard was detected early and an emergency maneuver rocketed the $150 billion station out of harm’s way. Such episodes, which burn gallons of valuable propellant, cost NASA and its partners an average $1 million per incident.\n\nThere must be a better way, right? For years now, scientists and engineers have been dreaming up alternatives — mainly pricey new robots that could remove rapidly multiplying space junk or shove it further into space. But what if the best solution is what they’ve been doing all along — just getting out of the way?\n\nAn unusual new NASA space junk study asked a question only an accountant could love: What’s the most cost-effective way of solving the problem? Rather than focus on whether removing junk enhances safety and sustainability, NASA wondered if the potential cost of collisions justifies the development of expensive new technologies to clean up the heavens.\n\nAnd it turns out it probably doesn’t — not in this century, at least. Instead, Earth-bound humans could save a lot of money and effort by honing their debris-tracking and dodging skills while forging international agreements to minimize the creation of more space junk in the future.\n\nSpace junk is a well-documented, growing problem for companies that have invested tens of billions of dollars building, launching and operating satellites that circle the planet collecting and transmitting data, including broadband internet, military communications and weather observation.\n\nThe Soviet Union’s Sputnik satellite became the world’s first space junk when its batteries died just three weeks after its 1957 launch. By the end of that decade, dead satellites, spent rocket stages, screws, bolts, tools dropped during space walks, flecks of paint and a wide range of scrap metal were zipping around the Earth. Today, in addition to roughly 7,200 working satellites occupying orbit, there are about 36,500 objects greater than 4 inches in size (including 2,500 dead satellites), 1 million pieces of debris between .4 and 4 inches, and 130 million pieces of debris less than .4 inches.\n\nImpacts happen. In 2009, a dead Russian machine collided with an active US satellite at a speed of 22,300 mph, destroying it — and sending at least 2,000 new pieces of space junk into orbit. Smaller objects, speeding along many times faster than bullets, create other dangers.\n\nBut surprisingly, devastating collisions are rare. In part because controllers on Earth have become adept at tracking the biggest pieces of junk and steering around them. For example, One Web Ltd, which operates a constellation of nearly 600 satellites, executes six to eight maneuvers a day to avoid potential collisions. And One Web hasn't yet suffered a debilitating collision. How, then, to quantify the threat of space junk?\n\nEnter NASA’s Office of Technology, Policy, and Strategy. Its new study, distilled to its most basic elements, sought to put a price on avoiding space junk and then examined other potential solutions that would pay off in a reasonable amount of time. Its surprising finding, considering the alarm that space junk inspires, is that while it can be very expensive to maneuver the giant space station, avoiding junk costs US satellite operators a mere $58 million a year. For example, the estimated cost of moving a customised, $500 million commercial satellite out of the way of trackable space junk is $699, including labor.\n\nFor a price like that, it's hard to justify investing in some of the more speculative and expensive technologies that have been proposed over the years. Space tug boats, launched to grapple large pieces of space junk and fling them into the atmosphere, could cost as much as $6 billion. A more speculative spacecraft that “sweeps” smaller junk out of the way might cost as much as $900,000 per kilogram of debris. In both cases, the eventual “break-even” point at which the cost of remediation equals the cost of collision avoidance could be nearly a century into the future.\n\nFortunately, there are more affordable options for lowering risk today and into the future. The most obvious is to limit the amount of junk that’s being launched and left in space. And there are good ways to do that, starting with rules requiring satellite owners to take their spacecraft out of crowded orbits after they are no longer useful.\n\nThe US already has strict rules requiring just that, and there have long been ambitions to see those rules translated into an international treaty to reduce space junk. The Biden administration should seek to convince America’s space partners and allies to agree to the US standards, and then start wider talks. As other countries, especially China and India, become space powers in their own right, establishing rules for how to keep space safe and sustainable should be a global priority.\n\nIf global agreement can be achieved on preventing junk, the more difficult question of sharing the costs and burdens of remediating what’s already there can start. According to NASA’s new report, ground and space-based lasers that push junk out of the way without destroying it might achieve break-even economics within a decade. US rivals will need assurances that such lasers aren’t offensive weapons. A comprehensive space junk treaty could offer a pathway for doing that, especially as space becomes more congested with the assets of other countries. Space will be everyone’s problem.\n\nAdam Minter is a Bloomberg Opinion columnist covering Asia, technology and the environment. Views are personal and do not represent the stand of this publication.\n\nCredit: Bloomberg","pubDate":"2023-03-24 05:30:48","image_url":"https://images.moneycontrol.com/static-mcnews/2021/12/international-space-station-770x433.jpg","id":"defbe632-0366-468e-83e2-e38c6298e0ba"},{"title":"Shocking Truth About Gender Reassignment Surgeries","link":"https://rightwirereport.com/2023/03/24/shocking-truth-about-gender-reassignment-surgeries/","description":"Shocking Truth About Gender Reassignment Surgeries. One visit to a clinic and this 10-year-old’s statements to leading questions resulted in the child’s biological identity getting recorded falsely in the child’s medical record. Thirty minutes or less into a first visit! This is malpractice and detrimental to the child. While watching the excerpt below from our […]","content":"Shocking Truth About Gender Reassignment Surgeries by Bekah Lyons March 24, 2023, 00:48 30 Views 5 Votes Shocking Truth About Gender Reassignment Surgeries. One visit to a clinic and this 10-year-old’s statements to leading questions resulted in the child’s biological identity getting recorded falsely in the child’s medical record. Thirty minutes or less into a first visit! This is malpractice and detrimental to the child. While watching the excerpt below from our podcast ask why you may have never heard of the medical and emotional complications that arise from gender- affirming care, especially in youth populations. Why would media not be interested in reporting on the other side of the equation? Rumble: Bitchute: If you found this article informative, please consider a small donation to our coffee cup to help support Conservative Journalism – or spread the word. Thank you. RWR original article syndication source. Share this: Share","pubDate":"2023-03-24 04:48:09","image_url":null,"id":"1bc3d844-7f8e-4fed-bc18-59137aa82929"},{"title":"How to Add a Background in Microsoft Word","link":"https://www.maketecheasier.com/add-background-microsoft-word/","description":"If you’re creating a document, such as a flyer, brochure, calendar, or sign-up sheet, you may want something besides a plain, white background. In Microsoft Word, you can use a solid color, gradient, texture, pattern, or picture as your document background. This tutorial shows you the various ways to add a background in Word. ContentHow to Add a Background in WordUse a Solid Color BackgroundUse a Gradient BackgroundUse a Texture BackgroundUse a Pattern BackgroundUse a Picture BackgroundHow to Change or Remove a BackgroundChange a BackgroundRemove a BackgroundHow to Print a Background in WordFrequently Asked Questions.toc{background-color:#f3f4f6;font-size:16px;font-weight:500;padding:1em;}.toc h4{text-align:center;text-transform:uppercase;font-size:0.9375rem;margin-bottom:1rem;}.toc ul{margin:0;padding:0;font-size:15px;}.toc-content{overflow-y:auto;max-height:600px;}.toc-content li{list-style:none!important;margin-bottom:1em;}.toc-content a{color:rgba(74,85,104,var(--text-opacity));text-decoration:none;}.toc-content a:hover{color:#C72F29;}.toc-content li.active a{color:#C72F29;font-weight:bold;}@media (min-width:1340px){.toc-wrap{position:absolute;float:left;margin-left:-9rem;top:0;left:-90px;height:100%;width:200px;background-color:white;}.toc{position:sticky;top:50px;font-size:14px;padding:0.5em;}.toc-content li{margin-bottom:0.5em;}} Tip: you can also insert a PDF document into Word. How to Add a Background in Word When you’re ready to add a background in Word, you can do so in just a few steps. The background you select applies to your entire document. Go to the “Design” tab to get started and choose one of the options below. ... Read more","content":"If you’re creating a document, such as a flyer, brochure, calendar, or sign-up sheet, you may want something besides a plain, white background. In Microsoft Word, you can use a solid color, gradient, texture, pattern, or picture as your document background. This tutorial shows you the various ways to add a background in Word. Tip: you can also insert a PDF document into Word . When you’re ready to add a background in Word, you can do so in just a few steps. The background you select applies to your entire document. Go to the “Design” tab to get started and choose one of the options below. You can choose a single color from Word’s color palette or a custom color as your background. Note : while you can use this and the options below in Word on Windows, a color background is currently the only available option in Word on Mac. As of this writing, you cannot add a document background in Word on the Web. Perhaps you would like to add a bit of color to your background but make it more eye-catching than a single color. Why not use a gradient, which offers a color-changing effect? Note : the Transparency and Rotate Fill settings are unavailable for page backgrounds. Would your document look nice with a texture background, such as wood grain, marble, or paper? Use a built-in texture background or one of your own. Note : the Rotate Fill setting is unavailable for page backgrounds. If you’d like more than a solid color, such as something with polka dots, lines, or a grid, you can use a pattern background in Word. Note : the Rotate Fill setting is unavailable for page backgrounds. You may want a beach background for your resort brochure or a musical instrument for your private lesson flyer. You can insert a background image easily in Word. Note : the Lock Aspect Ratio and Rotate Fill Effect settings are unavailable for page backgrounds. If you added a background in Word but want to change it to a new one or simply remove it, both can be done simply. Return to the “Design” tab and select the “Page Color” drop-down box. Choose a color from the palette, a custom color using “More Colors,” or a different gradient, texture, pattern, or picture by picking “Fill Effects.” By choosing a new background, you’ll automatically and immediately replace the existing one. To get rid of a background altogether, return to the “Design” tab, select the “Page Color” drop-down box, and select “No Color.” Regardless of which type of background you added, it will be immediately removed. If you plan to print your document, you have the option to print the background along with it. For items like signs and flyers, this is a great option. Note that you’ll need to use a color printer if you use any type of background with color. Note: to preserve its formatting, it’s better to export your Word document as a PDF , then print the PDF document. Because the background feature in Word currently applies to the entire document, you’ll need to use a workaround for a background on only a single page. With your cursor on the page, go to the “Insert” tab, open the “Shapes” menu, and pick the rectangle. Drag to resize the rectangle to cover the entire page. Select the rectangle and use the “Shape Fill” drop-down menu on the “Shape Format” tab to add a color, gradient, texture, or picture to the shape. Open the “Wrap Text” menu in the same tab and select “Behind Text” to place the rectangle in the background. You may want a word like “Confidential” or your company logo as a watermark (dimmed background) in your document. Go to the “Design” tab and select the “Watermark” drop-down menu. Choose a built-in option or “Custom Watermark” to use your own text or a picture. Read on for complete details on how to add a watermark in Word . You can change the background of the Word application to dark mode for a different look or to make it easier on your eyes. Go to “File -> Account” and use the “Office Theme” drop-down menu to choose “Dark Gray” or “Black.” Also check out our tutorial on using dark mode in Word on your other devices. Image credit: Pixabay . All screenshots by Sandy Writtenhouse. With her BS in Information Technology, Sandy worked for many years in the IT industry as a Project Manager, Department Manager, and PMO Lead. She wanted to help others learn how technology can enrich business and personal lives and has shared her suggestions and how-tos across thousands of articles. Our latest tutorials delivered straight to your inbox","pubDate":"2023-03-24 00:25:00","image_url":null,"id":"70353084-9fdf-4424-b01f-3f31c270ebd8"},{"title":"Crypto Founder Do Kwon Indicted in US Hours after Montenegro Arrest","link":"https://www.news18.com/tech/crypto-founder-do-kwon-indicted-in-us-hours-after-montenegro-arrest-7371229.html","description":"Lawyers for Kwon in the United States did not immediately respond to requests for comment after business hours","content":"Do Kwon, the cryptocurrency entrepreneur behind two digital currencies that lost an estimated $40 billion or more last year, has been charged with fraud by U.S. prosecutors. An eight-count indictment against Kwon was made public in the U.S. District Court in Manhattan, several hours after news of his arrest earlier Thursday in Montenegro. Lawyers for Kwon in the United States did not immediately respond to requests for comment after business hours. Thursday’s indictment charges Kwon, a South Korean national who co-founded Terraform Labs and developed the TerraUSD and Luna currencies, with two counts each of securities fraud, wire fraud, commodities fraud and conspiracy. The criminal case follows related U.S. Securities and Exchange Commission civil charges against Kwon and Terraform last month. Kwon had been a fugitive for several months, and South Korean authorities issued an arrest warrant for him last September. Montenegro’s interior ministry said local police detained a person thought to be Kwon and a second suspect, who were trying to board a flight to Dubai at Podgorica airport. Police found forged passports of Costa Rica and Belgium during the encounter, the ministry said. ”The person is suspected of being one of the most wanted fugitives, South Korean national Do Kwon, a co-founder and CEO of the Singapore-based Terraform Labs,” Interior Minister Filip Adzic wrote on Twitter. ”The former cryptocurrency king who is behind losses of over $40 billion, has been apprehended at the Podgorica airport with forged documents,” Adzic added. TerraUSD was a so-called ”stablecoin” designed to maintain a constant $1 price, while Luna’s value fluctuated. But authorities have said TerraUSD and Luna were paired, such that a decline in one could take down the other. They also said Kwon misrepresented the stability of TerraUSD, once among the top 10 cryptocurrencies by market value. Both currencies crashed last May, with TerraUSD’s price sinking to less than one penny. In its civil case, the SEC accused Kwon and Terraform of ”orchestrating a multi-billion dollar crypto asset securities fraud. ”We also allege that they committed fraud by repeating false and misleading statements to build trust before causing devastating losses for investors,” SEC Chair Gary Gensler said in a statement at the time. Read all the Latest Tech News here","pubDate":"2023-03-23 23:51:31","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/untitled-design-99-16796146803x2.png","id":"e2dc12de-ac17-48cc-ae5b-edb837f8b844"},{"title":"Terran 1, world's first (mostly) 3D printed rocket lifts off but fails to reach orbit","link":"https://go.theregister.com/feed/www.theregister.com/2023/03/23/terran_rocket_fail/","description":"Mission named 'Good Luck Have Fun' needed more of both, but launch outfit insists it's a win The world's 3D-printed rocket, Terran 1, blasted off into the sky but failed to make orbit during its maiden voyage on Wednesday.…","content":"Mission named 'Good Luck Have Fun' needed more of both, but launch outfit insists it's a win The world's 3D-printed rocket, Terran 1, blasted off into the sky but failed to make orbit during its maiden voyage on Wednesday.…","pubDate":"2023-03-23 23:50:37","image_url":null,"id":"b4c2ece2-2b08-4e3e-853d-854de3dd0f95"},{"title":"The Room director Tommy Wiseau made a new shark movie, or maybe… underwear ad?","link":"https://www.polygon.com/23654119/tommy-wiseau-big-shark-trailer-underwear-ad","description":"Since the late 2000s, Tommy Wiseau’s misbegotten f","content":"Since the late 2000s, Tommy Wiseau’s misbegotten feature film The Room has held a special place in the hearts of cult-movie fans, as a midnight movie, collective interactive theater experience, and conversation-starter like no other. The film’s sheer extremity — its comical line readings, its baffling plot, its off-putting sex scenes — propelled it to such infamy that the story behind its creation eventually became an Oscar-nominated movie , and one of the best films of 2017 . Wiseau has spent a surprisingly large percentage of the last 15 years or so on tour behind the movie’s many ironic public screenings, in between creating a TV series , appearing in guest spots on television and in films, and pursuing various minor projects, from music videos to making a short about homelessness in America . But he never made a second movie — until now. At least, it seems like he may have made a movie. The trailer for his upcoming project Big Shark debuted on Thursday, in its first online appearance after making the rounds at Room screenings. The thing is, the trailer is roughly 50 percent movie trailer and 50 percent stylized, black-and-white ad for the (very real) Tommy Wiseau underwear line TW Underwear — or, as the logo appears to call it, TWUNDERWEAR. The movie’s logline, according to the film’s YouTube listing: “Three firefighters /George, Patrick & Tim) must save New Orleans from a gigantic shark. Can New Orleans survive?” That doesn’t necessarily explain why half the movie-trailer part of the trailer is focused on boxing, with nary a fire in sight, much less anyone fighting it. The boxers are also apparently named Jimmy and Tommy, which suggests they aren’t even the subjects of the movie. Also, there’s a big CGI shark slapped in the middle of it all, launching into the middle of the city streets in what looks like a lost scene from Sharknado . And then the whole thing suddenly cuts to a TWUNDERWEAR ad, featuring various shirtless men tossing a basketball around in slow motion, as Wiseau himself, in a particularly strange Andy Warhol-style wig, arrives to repeat “love is blind.” What does love have to do with men’s underwear, slo-mo basketball, or giant sharks threatening New Orleans? Might as well ask why there’s spoon art on a random wall in The Room , or why Philip Haldiman’s character Denny graphically eats an apple in the movie. Some things can only be explained with Tommy Wiseau logic. It’s going to take audiences a while to find out how it all fits together, whether Big Shark features more graphically veiny shots of Wiseau’s bared and flexing buttocks, and whether Big Shark is destined to become a Room -level interactive viewing experience. Variety says the film will debut in Portland, Oregon on April 2 , with an eight-month tour of the United States to follow, one city at a time.","pubDate":"2023-03-23 23:06:48","image_url":null,"id":"87755acc-a7f5-40c8-9cc4-099a8ccfafb8"},{"title":"All the John Wick: Chapter 5 news so far ","link":"https://www.polygon.com/23652236/john-wick-5-release-date-cast-news","description":"Image: Lionsgate A fifth movie has already been gr","content":"Image: Lionsgate A fifth movie has already been greenlit — here’s what Chapter 4’s writers and directors say about what’s next Continue reading…","pubDate":"2023-03-23 23:01:00","image_url":null,"id":"187af4f9-8f44-474e-bc03-fe7eecf39fca"},{"title":"\"CBS Evening News\" headlines for Thursday, March 23, 2023","link":"https://www.cbsnews.com/video/cbs-evening-news-headlines-for-thursday-march-23-2023/","description":"Here's a look at the top stories making headlines on the \"CBS Evening News with Norah O'Donnell.\"","content":"Here's a look at the top stories making headlines on the \"CBS Evening News with Norah O'Donnell.\"","pubDate":"2023-03-23 22:52:04","image_url":"https://assets2.cbsnewsstatic.com/hub/i/r/2023/03/23/d51b410d-dcc2-49a5-a2f6-a8e302550842/thumbnail/60x60/0edc9bcf2f3a25d461dc93d29868c88b/cbsn-fusion-cbs-evening-news-headlines-for-thursday-march-23-2023-thumbnail-1822701-640x360.jpg","id":"b604d3e6-fc8f-4bf8-863c-1014bf8ad0bf"},{"title":"Who is Shou Zi Chew? What to know about the TikTok CEO","link":"https://www.cbsnews.com/news/tiktok-ceo-shou-zi-chew/","description":"The TikTok CEO, a former Goldman Sachs banker and Harvard grad, is on the hot seat as lawmakers consider banning the app.","content":"The TikTok CEO, a former Goldman Sachs banker and Harvard grad, is on the hot seat as lawmakers consider banning the app.","pubDate":"2023-03-23 22:49:00","image_url":"https://assets1.cbsnewsstatic.com/hub/i/r/2023/03/22/bb26df71-5815-459b-ae79-d9f9757a3671/thumbnail/60x60/e5b8c43cbbf2bc35f559d49209e8cd0d/gettyimages-1248482890.jpg","id":"12348d17-8fa4-425f-8fff-8a969273c373"},{"title":"TikTok CEO grilled on Capitol Hill","link":"https://www.cbsnews.com/video/tiktok-ceo-grilled-on-capitol-hill/","description":"TikTok CEO Shou Zi Chew faced tough questions from a House panel Thursday as he sought to convince lawmakers the social media platform is not an arm of the Chinese government that's being used to spy on Americans. Nikole Killion reports on the contentious hearing.","content":"TikTok CEO Shou Zi Chew faced tough questions from a House panel Thursday as he sought to convince lawmakers the social media platform is not an arm of the Chinese government that's being used to spy on Americans. Nikole Killion reports on the contentious hearing.","pubDate":"2023-03-23 22:47:40","image_url":"https://assets3.cbsnewsstatic.com/hub/i/r/2023/03/23/0fbe5fca-dfd0-4225-9a9b-037d68e0da83/thumbnail/60x60/790291cd8b8fe963ecc594ac18af4bc2/cbsn-fusion-tiktok-ceo-grilled-on-capitol-hill-thumbnail-1822730-640x360.jpg","id":"729e463c-a2c1-4960-90aa-213538c6afea"},{"title":"TikTok CEO fails to convince Congress that the app is not a “weapon” for China","link":"https://arstechnica.com/?p=1926478","description":"Passing a data privacy bill is \"the only way to stop TikTok,\" committee says.","content":"Enlarge / TikTok Chief Executive Officer Shou Zi Chew testifies before the House Energy and Commerce Committee. Kent Nishimura / Contributor | Los Angeles Times reader comments 118 with Share this story Share on Facebook Share on Twitter Share on Reddit For nearly five hours, Congress members of the House Committee on Energy & Commerce grilled TikTok CEO Shou Zi Chew over concerns about the platform's risks to minor safety, data privacy, and national security for American users. “The American people need the truth about the threat TikTok poses to our national and personal security,” committee chair Cathy McMorris Rodgers (R-Wa.) said in her opening statement, concluding that “TikTok is a weapon.” Rodgers suggested that even for Americans who have never used the app, “TikTok surveils us all, and the Chinese Communist Party (CCP) is able to use this as a tool to manipulate America as a whole.” In his testimony, Chew defended TikTok’s $1.5 billion solution to these concerns, Project Texas , as a more appropriate measure than forcing a sale of TikTok from its owner, China-controlled ByteDance, or banning TikTok in the US. Chew said that with Project Texas, TikTok has launched an “unprecedented” effort to be more transparent about its algorithm and data collection than any other big tech company. “American companies don’t have a good track record with data privacy,” Chew reminded the committee while repeatedly telling Congress members that the questions that they had about TikTok reflected industry-wide problems that go well beyond one app. Chew also said that he’s seen “no evidence” that Project Texas—which he said would ensure TikTok data is behind a US firewall and out of China’s reach—doesn’t address Congress’ national security concerns. However, he refused to comment on a whistleblower report from Tech Workers Coalition , where a TikTok content moderator confirmed one of Congress’ worst suspicions: that ByteDance has access to user data that could be used to track and spy on Americans. Advertisement But Congress members like Jay Obernolte (R-Calif.)—who said he has more extensive experience with Internet technologies than many of his committee colleagues—led a swarm of Congress members disputing that Project Texas was the cure-all that Chew claimed. Obernolte said that, in his opinion, it was not “technically possible” for Project Texas to keep American user data out of China’s reach. Not only could nefarious actors working within Project Texas potentially access user data for China, but also there are concerns that if TikTok is not fully transparent about its data sales, China could potentially purchase US user data. Because The Wall Street Journal reported that China has stated that it will act to stop the forced sale of TikTok, Chew was pressed on how involved China—and the CCP—might be in TikTok operations and whether he thought China had the power to stop a sale. Chew did not directly deny that China could step in. After being called “evasive” during his testimony by several committee members, Chew shared some insights into TikTok-China connections, confirming that he directly reports to China-owned ByteDance’s CEO Liang Rubo and affirming that he personally owns shares in ByteDance. Although Chew said that ByteDance does not require that employees disclose this information, he also seemed to agree that it’s likely that many ByteDance employees are CCP members. Things got personal for Chew—who lives in Singapore, not China—when Congress members pressured him to disclose his own connections to the CCP, which he repeatedly evaded. He reminded the committee that his testimony was exclusively about TikTok. He also consistently resisted responding to several committee members asking if he condemned Chinese human rights abuses against a Turkish ethnic minority in China, the Uyghurs. Advertisement “You have absolutely tied yourself in knots to avoid criticizing CCP’s treatment of Uyghurs,” Kelly Armstrong (R-ND) told Chew. Nothing that Chew said seemed to weaken the bipartisan united front against TikTok that was presented by committee members. Rick Allen (R-Ga.) pointedly said that Chew gave him “no reason to believe” that TikTok would comply with any American orders that conflict with what the CCP wants. Although Chew continually denied that the CCP controlled TikTok—while remaining vague on many other questions—Diana Harshbarger (R-Tenn.) said it was clear to her that “ByteDance puts China first and America last.” Jan Schakowsky (D-Ill.) told Chew that because the WSJ report said that China’s commerce minister has confirmed that China could block a sale of TikTok, “all of what you've been saying about the distance between TikTok and China has been said to be not true.” There were many questions that Chew failed to answer, promising instead to follow up. Committee members were given 10 business days to submit written questions to TikTok. Outstanding questions covered everything from how (and to whom) TikTok sells user data, to how much TikTok revenue ByteDance retains, and how many tech resources are shared between TikTok and other ByteDance-owned companies. In his written testimony that was prepared ahead of the hearing, Chew maintained that “ByteDance is not an agent of China” and made four promises to both Congress and to American TikTok users. He vowed to keep user safety as a top priority, to prevent unauthorized foreign access to American user data, to prevent any government from manipulating TikTok content, and to be transparent and accountable for all these promises by giving access to independent third-party monitors to review changes in TikTok code. But after Chew provided his first testimony ever to Congress, Marc Veasey (D-Texas) told Chew that he considered TikTok’s assurances “worthless.” Perhaps Russ Fulcher (R-Idaho) summed up the disappointing hearing best when he told Chew, “This hasn’t been a fun day” for TikTok or for Congress. TikTok did not respond to Ars’ request for comment on the hearing.","pubDate":"2023-03-23 22:21:10","image_url":null,"id":"5413d376-15f9-40fc-a0e9-0a259279c931"},{"title":"Counter-Strike 2 data mine reveals Valorant-style anti-cheat coming - Dexerto","link":"https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmRleGVydG8uY29tL2NvdW50ZXItc3RyaWtlLTIvY291bnRlci1zdHJpa2UtMi1kYXRhLW1pbmUtcmV2ZWFscy12YWxvcmFudC1zdHlsZS1hbnRpLWNoZWF0LWNvbWluZy0yMDk1MTc4L9IBAA?oc=5","description":"Counter-Strike 2 data mine reveals Valorant-style anti-cheat coming  DexertoEarly Counter-Strike 2 footage unveils key feature inspired by VALORANT  Dot EsportsWith Counter-Strike 2 looming, how does the biggest game on Steam pass the torch?  GamesradarCounter-Strike 2 beta test shows new grenade preview feature, players can see landing spot  SportskeedaShroud loves how Counter-Strike 2 copied one feature from VALORANT  Dot EsportsView Full coverage on Google News","content":"Counter-Strike 2 data mine reveals Valorant-style anti-cheat coming  DexertoEarly Counter-Strike 2 footage unveils key feature inspired by VALORANT  Dot EsportsWith Counter-Strike 2 looming, how does the biggest game on Steam pass the torch?  GamesradarCounter-Strike 2 beta test shows new grenade preview feature, players can see landing spot  SportskeedaShroud loves how Counter-Strike 2 copied one feature from VALORANT  Dot EsportsView Full coverage on Google News","pubDate":"2023-03-23 22:14:45","image_url":null,"id":"9d13024c-c8e9-4dea-a263-17126f6e9814"},{"title":"Critical infrastructure gear is full of flaws, but hey, at least it's certified","link":"https://go.theregister.com/feed/www.theregister.com/2023/03/23/critical_infrastructure_hardware_flaws/","description":"Security researchers find bugs, big and small, in every industrial box probed Devices used in critical infrastructure are riddled with vulnerabilities that can cause denial of service, allow configuration manipulation, and achieve remote code execution, according to security researchers.…","content":"Security researchers find bugs, big and small, in every industrial box probed Devices used in critical infrastructure are riddled with vulnerabilities that can cause denial of service, allow configuration manipulation, and achieve remote code execution, according to security researchers.…","pubDate":"2023-03-23 21:59:11","image_url":null,"id":"958cb847-bfa8-49b2-8b23-4244e519ac0e"},{"title":"From war torn Damascus to success as an aviation engineer and pilot, a refugee’s journey","link":"https://physicsworld.com/a/from-war-torn-damascus-to-success-as-an-aviation-engineer-and-pilot-a-refugees-journey/","description":"Maya Ghazal talks about her successes in aeronautics despite facing prejudice in secondary education The post From war torn Damascus to success as an aviation engineer and pilot, a refugee’s journey appeared first on Physics World.","content":"This episode of the Physics World weekly podcast features an in-depth interview with the engineer and pilot Maya Ghazal , who fled from the war in Syria and arrived in the UK in 2016. Despite facing prejudice when she first tried to resume her education, Ghazal gained a degree in aviation engineering and pilot studies and is now a graduate research engineer at the UK’s Manufacturing Technology Centre in Coventry. Ghazal is a Goodwill Ambassador for UNHCR (the UN Refugee Agency). She speaks to the science journalist Anna Demming about her journey from war torn Damascus to the UK and how she overcame barriers faced by refugees and found an unexpected passion for all things aeronautical.","pubDate":"2023-03-23 18:41:55","image_url":"https://physicsworld.com/wp-content/uploads/2023/03/Maya-Ghazal-pilot-list.jpg","id":"ae58a03c-8a20-40c1-b934-b683f5657ee4"},{"title":"How purposely-installed vape detectors are being set off 22 TIMES a day in schools","link":"https://www.dailymail.co.uk/health/article-11891095/How-purposely-installed-vape-detectors-set-22-TIMES-day-schools.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","description":"Devices installed in schools to detect whether children are vaping are being set off up to 22 times a day. The sensors send a phone notification to teachers when a hint of vapour is detected.","content":"Britain's vaping crisis in schools laid bare: How e-cig detectors are being set off 22 TIMES a day VapeGuardian sensors have been installed at schools up and down the country They detected children are being caught vaping at school 17 to 22 times a day The sensor designer said we are 'creating a new generation of nicotine addicts' By Hannah Mcdonald For Mailonline Updated: 13:05 EDT, 23 March 2023 e-mail 103 View comments Devices installed in schools to detect whether children are vaping are being set off up to 22 times a day, data has revealed. The VapeGuardian sensors send a phone notification to teachers when the smallest hint of vapour is detected. They have been installed in nearly 100 schools across the UK and Ireland. The shocking figure, released by the device's Southampton-based manufacturer SMF Systems, comes amid the UK's teen vaping crisis, with nearly one in 10 children now using e-cigarettes. Simon Hassett, the software engineer behind VapeGuardian, which he claims is the first device of its kind made in the UK, said some pupils are so anxious for their next 'fix' they are begging teachers to let them vape at school. 'We are unwittingly creating a new generation of nicotine addicts,' he said. NHS Digital, which quizzed nearly 10,000 students aged 11 to 15 on their smoking, drug and drinking habits last year, found that nine per cent currently vape — the highest rate logged since the survey began in 2014 Mr Hassett stressed his concern at children not being fully aware of the contents of e-cigarettes, with many so anxious for their next 'fix' they are begging teachers to let them vape at school The VapeGuardian sensor (pictured) is the first of its kind manufactured in the UK and can detect the smallest hint of vapour The sensors detect vapour and the chemicals released from a person's mouth after they have puffed on an e-cigarette. It then immediately sends an alert — in the form of a text, email or push notification — to a designated teacher. The message includes the exact time and location the sensor was set off — so staff can catch those vaping in the act. The device measures 3.7mx3.7m and costs £260. To date, 77 have been installed in Britain's schools since the product launched six months ago. Schools have to buy the sensors themselves. Data from the devices across 77 secondary schools suggests they are being set off 17 to 22 times a day. The company says that schools with VapeGuardian sensors see this figure half after one week to an average of 8-11 alerts and these figures continue to decline consistently week after week. Vaping has become an epidemic across UK schools, according to leading health experts such as Dr Mike McKean, vice-president of policy for the Royal College of Paediatricians and Child Health. READ MORE: Vape manufacturers should pay a polluter TAX, public health experts argue <!- - ad: https://mads.dailymail.co.uk/v8/ca/health/none/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement A report from Action on Smoking and Health (Ash) last year found the proportion of children aged 11 to 17 currently vaping jumped from 4 per cent in 2020 to 7 per cent in 2022. In 2013, just 3 per cent of children aged 11 to 15 had ever vaped, but this rose to 8 per cent in 2020 and 10 per cent in 2022. Plain packaging for cigarettes and hand-rolled tobacco products was introduced in the UK in 2017. Dr McKean recently said that if this growth continues, almost all children could be vaping within five years. Mr Hassett said vaping is a problem for teachers but that he and his team were shocked when they saw the extent of the e-cigarette use in schools. Schools have told Mr Hassett that they are increasingly concerned about the physical and mental health and safety of their pupils who vape. Many teachers say pupils who vape are becoming anxious in lessons, which he put down to the addictiveness of the high levels of nicotine present in most e-cigarettes. One teacher in Salisbury told Mr Hassett that pupils are even 'pleading' to be able to vape in school as they need to get a fix. The sensor was designed by software engineer, Simon Hassett (pictured), 36, who stressed his concern at children not being fully aware of the contents of e-cigarettes One in 10 secondary school pupils are now vape-users, despite the uncertainty surrounding their long-term impact on health Mr Hassett said that his concerns as a father about the risks of vaping inspired him to try to tackle the ever-growing issue. The sensors detect vapour once it has come out of someone's lungs and Mr Hassett said he has been 'particularly shocked' by the amount of nicotine and microplastics in each puff. Studies have shown that disposable e-cigarettes are increasing in popularity, in part because they cost around £5 each and come in a wide range of colours and fruity flavours. Mr Hassett said that he and his team are 'fully committed to supporting schools across the UK', but that tighter regulations are need to 'reduce the attractiveness of vaping'. He said without these regulations, the 'popularity pandemic will continue to rise.' Mr Hassett added: 'We want to collaborate with the health and education sector to ensure regulations go further to protect children from taking up vaping in the first place, as well as explore better guidance to support schools in reducing the problem.' The father-of-four, from Southampton, launched the product in October 2022 under his company SMF Systems, employing a couple of PHD students to find out the specific ingredients used within vapes. He was then able to programme his device to detect these ingredients in the vapour they release. Share or comment on this article: How purposely-installed vape detectors are being set off 22 TIMES a day in schools e-mail Add comment Comments 103 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-03-23 17:05:30","image_url":"https://i.dailymail.co.uk/1s/2023/03/23/16/69025583-0-image-m-11_1679587633161.jpg","id":"1197f921-e845-49f3-a786-ff64eaa1119e"},{"title":"More than 1.8 MILLION bacteria may be lurking in your refrigerator","link":"https://www.dailymail.co.uk/sciencetech/article-11891867/More-1-8-MILLION-bacteria-lurking-fridge-heres-filthy-spots.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","description":"Your refrigerator is a playground for bacteria linked to respiratory and urinary infections, food poisoning and miscarriages. And here are the filthiest places inside the cooling container.","content":"REVEALED: More than 1.8 MILLION bacteria linked to miscarriages and respiratory infections may be lurking in your fridge - here are the filthiest spots Your refrigerator is teeming with more than 1.8 million bacteria units These microbes are growing in veggie and meat drawers and on shelves READ MORE: Dirtiest places in your work kitchen revealed by swabbing test By Stacy Liberatore For Dailymail.com Published: 10:50 EDT, 23 March 2023 | Updated: 12:11 EDT, 23 March 2023 e-mail 21 shares 128 View comments Spring has sprung, which means the seasonal cleaning of the home is in full swing, but it is not just cluttered you should be worried about - more than 1.8 million bacteria units are lurking in your refrigerator. These invisible microbes are linked to respiratory and urinary infections, food poisoning and miscarriages among pregnant women. And the filthiest spots in the fridge are the veggie and meat drawers and shelves where dairy products are kept. Most bacteria thriving in refrigerators develop from unwashed vegetables or cross-contamination, so experts recommend covering all food before placing it inside. The US Department of Agriculture (USDA) notes that leftovers should be placed in airtight containers to avoid bacterial growth and placed on the upper shelves. The agency warns not to store eggs on the door but in the carton and on a shelf. More than 1.8 million bacteria units are lurking in your refrigerator. These invisible microbes are linked to respiratory and urinary infections, food poisoning and miscarriages among pregnant women Spring cleaning dates back 3,000 years ago, when ancient Persians participated in a spring tradition called Khāne-takānī, meaning 'shaking the house.' It was believed that sweeping up dust and removing clutter from one's home would prevent ill fortune in the upcoming year. And people are still upholding the tradition thousands of years later. Nearly eight in ten Americans report spring cleaning at least once a year, typically around or after the first day of spring, March 20. The refrigerator may be one of the last places people think to attack with a scrubber, but the container houses bacteria that lead to illnesses. The average refrigerator size is 62 inches in height and 29 inches wide, and previous research has found that there are more than 1,200 bacteria units living on every square inch of the container. Two different families of microbes live in your refrigerator: pathogenic bacteria and spoilage bacteria. Pathogenic bacteria flourish in the 'Danger Zone,' between 40 and 140 degrees Fahrenheit. This group causes foodborne illnesses but typically does not impact food's taste, smell or appearance. Spoilage bacteria can grow at low temperatures, such as in the refrigerator, and are detected when the food spoils. Listeria is a pathogenic bacteria that primarily impacts pregnant women, children and the elderly. In pregnant women, listeriosis can cause miscarriage, stillbirth and severe illness or death of newborn babies. Listeria is a pathogenic bacteria that primarily impacts pregnant women, children and the elderly. In pregnant women, listeriosis can cause miscarriage, stillbirth and severe illness or death of newborn babies (pictured is a 3D illustration of the bacteria on meat) The refrigerator may be one of the last places people think to attack with a scrubber, but the container houses bacteria that lead to illnesses Symptoms of the infection include fever, stiff neck, confusion, weakness, and vomiting, sometimes preceded by diarrhea. The incubation period can be 3 to 70 days, and the illness may last days or weeks, depending on the person's health before the illness settles in. Listeria can survive on cold surfaces and multiply slowly at 24 degrees Fahrenheit. And this deadly bacteria can be found throughout the fridge, specifically where meats and dairy items are stored. A study conducted in 2019 , in which scientists took five swabs from different locations in 10 refrigerators, found 19 of the 50 samples contained Aeromonas bacteria, Enterobactera clocae and Klebsiella oxytoca. Aeromonas bacteria is linked to gastrointestinal infections, which result in watery diarrhea to dysenteric or bloody diarrhea. Enterobacter cloacae can cause bone and heart infections, while Klebsiella oxytoca is linked to severe infections that lead to septic shock. However, the refrigerator is not the only playground for germs - they thrive on kitchen countertops, sponges and rags, and the more than 500,000 units live in sink drains. Share or comment on this article: More than 1.8 MILLION bacteria may be lurking in your refrigerator e-mail 21 shares Add comment","pubDate":"2023-03-23 16:11:05","image_url":"https://i.dailymail.co.uk/1s/2023/03/23/14/69034155-0-image-a-19_1679582803626.jpg","id":"4b4d7894-22b0-4363-b324-1becf27be798"},{"title":"Huawei P60, P60 Pro, P60 Art becomes official!","link":"https://www.yugatech.com/news/huawei-p60-p60-pro-p60-art-becomes-official/","description":"Huawei announced a bunch of smartphones and werables today for a China-exclusive launch of the P60 series. So, aside from the Mate X3, a... The post Huawei P60, P60 Pro, P60 Art becomes official! appeared first on YugaTech | Philippines Tech News & Reviews.","content":"Huawei announced a bunch of smartphones and werables today for a China-exclusive launch of the P60 series. So, aside from the , a triplet of P series phones were also announced — the , and . One of the unique features of the P60 series is the ability to send and receive Beidou satellite messages. specs: 6.67-inch OLED LTPO, 2700 x 1220 pixels, 120Hz adaptive refresh rate Kunlun Glass Qualcomm Snapdragon 8+ Gen 1 4G 8GB LPDDR5 RAM 256GB, 512GB UFS 4.0 internal storage 48MP main camera, f/1.4-4.0, OIS 13MP f/2.2 ultra-wide 12MP telephoto, f/3.4, OIS XMAGE Imaging 4K @ 30fps, 60fps 13MP, f/2.4 front camera Fingerprint sensor IP68 dust and water resistance HarmonyOS 3.1 4,815 mAh Li-Po battery, 66W wired, 50W wireless Feather Purple, Feather Black, Emerald Emerald, limited Rococo White specs: 6.67-inch OLED LTPO, 2700 x 1220 pixels, 120Hz adaptive refresh rate Kunlun Glass Qualcomm Snapdragon 8+ Gen 1 4G 8GB LPDDR5 RAM 256GB, 512GB UFS 4.0 internal storage 48MP main camera, f/1.4-4.0, OIS 13MP f/2.2 ultra-wide 48MP telephoto, f/2.1, 3.5x optical zoom, 100x digital zoom, OIS XMAGE Imaging 4K @ 30fps, 60fps 13MP, f/2.4 front camera Fingerprint sensor IP68 dust and water resistance HarmonyOS 3.1 4,815 mAh Li-Po battery, 66W wired, 50W wireless Feather Purple, Feather Black, Emerald Emerald, limited Rococo White specs: 6.67-inch OLED LTPO, 2700 x 1220 pixels, 120Hz adaptive refresh rate Kunlun Glass Qualcomm Snapdragon 8+ Gen 1 4G 8GB LPDDR5 RAM 512GB, 1TB UFS 4.0 internal storage 48MP main camera, f/1.4-4.0, OIS 13MP f/2.2 ultra-wide 48MP telephoto, f/2.1, 3.5x optical zoom, 100x digital zoom, OIS XMAGE Imaging 4K @ 30fps, 60fps 13MP, f/2.4 front camera Fingerprint sensor IP68 dust and water resistance HarmonyOS 3.1 5,100mAh Silicon-Carbon battery, 88W wired, 50W wireless Blue Sea and Quicksand Gold Global pricing for the Huawei P60 starts at CNY4,488 (Php35,700) for the base 8GB/128GB and goes up to CNY5,988 (Php47,600) for the 8GB/512GB variant. The Huawei P60 Pro starts at CNY6,988 (Php55,600) for the 8GB/256GB model and CNY7,988 (Php63,500) for the 8GB/512GB variant. The Huawei P60 Art comes in either 8GB/512GB for CNY8,988 (Php71,500) and a 8GB/1TB model for CNY10,988 (Php87,300).","pubDate":"2023-03-23 15:46:30","image_url":null,"id":"46f35462-7e14-4867-a8db-109f93dee9ae"},{"title":"Is YOUR car spying on you? Chinese-made EVs are set to go on sale in the UK","link":"https://www.dailymail.co.uk/sciencetech/article-11894013/Is-car-spying-Chinese-EVs-set-sale-UK.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","description":"Chinese vehicle maker BYD has launched its first vehicle in the UK this month, equipped with a 360-degree camera, radar and sensors to assist the driver.","content":"Is YOUR car spying on you? Cheap Chinese-made electric vehicles are set to go on sale in the UK, packed full of sensors that could be used to track your movements Chinese vehicle maker BYD has launched its first vehicle in the UK this month It's equipped with a 360-degree camera, radar and sensors to assist the driver READ MORE: China has filled the UK with gadgets that could be used for spying By Jonathan Chadwick For Mailonline Published: 15:31 GMT, 23 March 2023 | Updated: 18:47 GMT, 23 March 2023 e-mail 99 shares 220 View comments From apps to smartphones and mobile infrastructure, Chinese technology has infiltrated Britain in recent years. But a fresh arrival in the form of electric cars could further expand China 's tech empire while potentially edging out competition from Western manufacturers. BYD, a vehicle maker based in Shenzhen, has partnered with British car dealership Pendragon to sell its electric vehicle (EV) models in the UK. They come equipped with all the latest high-tech features such as 360-degree cameras and sensors to assist the driver and help avoid obstacles. But this could stoke fears they could be used to track movements, just like concerns surrounding Chinese phones from the likes of Huawei and apps such as TikTok . Electric cars made by Chinese firm BYD have more attractive prices than those from the likes of rival Tesla, owned by Elon Musk and based in California BYD's first electric car to enter the UK market – the Atto 3 – is now available to order with customer deliveries starting this month. It starts from £36,000, but Pendragon CEO Bill Berman thinks the Chinese firm will bring an affordable EV to Britain that will be as cheap as a Ford Focus – around the £20,000 mark. BYD Atto 3: Specs Range : 200 miles Battery : 60 kWh Acceleration : 0-62 mph in 7 seconds Price : £36,490 UK availability : March 2023 <!- - ad: https://mads.dailymail.co.uk/v8/de/sciencetech/none/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement These cheaper BYD models will also be half the cost of EVs sold by Tesla, owned by Elon Musk and based in California. Teslas start from around £50,000 and push well past £100,000 – and this price is a barrier to adoption. 'You can look at the average price point for a Ford Focus right now, in the mid to high 20s,' Berman told the Telegraph. 'My take would be they'll probably be in line with that.' BYD – which is one of a handful of Chinese brands entering the UK market alongside Great Wall Motor and Chery – makes electric trucks, buses and bicycles as well as passenger cars. But they're equipped with a range of features – including cameras, sensors, radar and internet connectivity – that could be used for remote surveillance on behalf of the Chinese government, it's believed. Smart EVs also collect metrics such as route history, vehicle speeds and even local weather, and this data can be hacked and data accessed remotely and shared, as demonstrated by a German programmer who hacked a Tesla last year . James Bore, tech expert and security consultant at Bores Group, said smart EVs are as much as a security threat as Chinese-made phones and apps such as TikTok, which was banned from UK government smartphones earlier this month. The government has already excluded Chinese tech firm Huawei's technology from the UK's 5G infrastructure . BYD, an electric vehicle company based in Shenzhen, has partnered with British car dealership Pendragon to sell its electric vehicle (EV) models in the UK BYD cars come equipped with all the latest high-tech features such as 360-degree camera, radar and sensors to assist the driver and help avoid obstacles The BYD Atto 3 is equipped with a 150kW motor and accelerates from 0-62 mph in 7.3 seconds 'Smart EVs are just as much a security/privacy threat as Chinese phones, smart devices, apps, etc,' Bore told MailOnline. From phones to TVs and light bulbs: The very real fears China has filled Britain's homes with spy gadgets - READ MORE From apps to smartphones and mobile infrastructure, Chinese technology has infiltrated Britain in recent years <!- - ad: https://mads.dailymail.co.uk/v8/de/sciencetech/none/article/other/mpu_factbox.html?id=mpu_factbox_2 - -> Advertisement 'China's not really capable of gathering any more data than, say, Facebook through the same tools,' Bore told MailOnline. 'The difference comes down to political opposition and that China's government is much, much more involved in Chinese companies than US/EU political entities are with their respective companies. 'Ultimately the focus on China should be taken to highlight how our current technological ecosystem is designed to exploit individual personal data on an industrial scale in order to manipulate people.' Currently, the vast majority of BYD's vehicles are sold in China apart from a few select export markets such as Bahrain and Moldova, but it now plans to rapidly expand all over Europe. In China, BYD outsold Tesla by more than five times in the first two months of the year. The firm has been enticing customers by offering more affordable price tags and shorter delivery windows, as well as all the latest tech gizmos. BYD has already denied it equips its trucks with technology that can be used to secretly spy on US citizens and provide data to the Chinese government. Following the allegations in 2020, BYD said in a statement that it 'does not build buses that spy on Americans' but builds buses that are 'technologically superior to any other product on the market'. BYD electric vehicles (EV) are displayed at a car dealership in Shanghai, China, February 3, 2023 'BYD is driving innovation and partnering with many American start-up ventures in the battle against climate change,' it told FreightWaves . 'It is unfortunate that BYD's competitors have chosen to use the legislative process to gain a competitive advantage in the market.' Tense relations between Washington and Beijing and President Joe Biden's move to prioritise home-grown production of EVs and batteries may also prove to be barriers to BYD's rollout in the US. Chinese authorities also appear to have recognised the threat posed by Tesla cars in China, although this has stopped short of an outright ban. Last year, China banned Teslas in Beidaihe for two weeks when the town hosted the Chinese Communist Party's secretive annual meeting there, over fears the vehicles could send sensitive video footage to the US. BYD electric car models include the Atto 3, Han, Yuan and Tang (pictured) Currently, BYD has 19 models in China – including vans – and will be selecting the 'right ones' for Europe, AM reports . Among the Chinese firm's other partners for the UK launch are Arnold Clark, Lookers and LSH Auto UK. As part of the new partnership, Pendragon is opening BYD showrooms in Birmingham and Milton Keynes, which will be followed by a flagship showroom in Mayfair later this year. Some of the other newest BYD models include the the 'Han', 'Yuan' and 'Tang', which could soon join UK showrooms along with the Atto 3. Berman said the expansion of BYD to Britain will help achieve the ambitious aim of ramping up EV sales for environmental and health reasons. The government is banning sales of petrol and diesel cars from 2030, to help eliminate greenhouse gas emissions and achieve its net zero emissions target by 2050. 'It is a privilege and honour to be a pivotal part of BYD’s launch into the UK market,' Berman said. 'We are certain our new EV partner will excite automotive fans across the country. 'As we move closer to the government’s 2030 EV plan and British drivers’ appetite for greener vehicles, the launch of our first all-electric showrooms is a special moment in history for Pendragon.' Explained: the UK's net zero emissions target A target set by the government in June 2019 will require the UK to bring all greenhouse gas emissions to net zero by 2050. Former Prime Minister Theresa May had announced the target, saying the plans were ambitious but crucial for protecting the planet for future generations. The move will require huge changes such as more renewable electricity generation, phasing out new petrol and diesel cars by at least 2035 and a 20 per cent cut in beef and lamb consumption. 'The UK kick-started the Industrial Revolution, which was responsible for economic growth across the globe but also for increasing emissions,' said said Energy and Clean Growth Minister Chris Skidmore at the time. 'We’re leading the world yet again in becoming the first major economy to pass new laws to reduce emissions to net zero by 2050 while remaining committed to growing the economy - putting clean growth at the heart of our modern Industrial Strategy.' Net zero means any emissions would be balanced by schemes to offset an equivalent amount of greenhouse gases from the atmosphere, such as planting trees or using technology like carbon capture and storage. Share or comment on this article: Is YOUR car spying on you? Chinese-made EVs are set to go on sale in the UK e-mail 99 shares Add comment","pubDate":"2023-03-23 15:36:11","image_url":"https://i.dailymail.co.uk/1s/2023/03/23/12/69028603-0-image-a-45_1679575965036.jpg","id":"f5cabb21-25d8-4cec-9bfc-ffec2ce0d79c"},{"content":"Hardware startups have a serious disadvantage over SaaS companies: Once you ship, it’s somewhere in the hard-to-impossible range to make changes to the product. That means you’d best get it right. But knowing what to ship can be challenging. Prelaunch.com first caught my eye at CES in Las Vegas this year, where the company had a “wall of flops”: products that were manufactured but didn’t find commercial success. Earlier this year, the company raised a $1.5 million seed round , and I already talked with the company’s founder about what it takes to de-risk hardware products . As part of that interview, I managed to talk the team into letting me take a closer look at the pitch deck it used to raise the $1.5 million. We’re looking for more unique pitch decks to tear down, so if you want to submit your own, here’s how you can do that . Prelaunch obviously has a very clear idea of where it wants to go, and it presents that beautifully in its slide deck. At the same time, the company makes some pretty elementary mistakes, and the deck is missing some important information. Still, there’s a lot to love here, so let’s dive in and take a look. On Slide 8, the company shows the measured efficacy of what it does, essentially suggesting that it has developed a crystal ball of sorts. [Slide 8] Being able to predict how much demand there will be for a product with more than 85% accuracy is a hell of a feat. Image Credits: Prelaunch In Slides 1-7, Prelaunch sets up its problem space and the challenges it is addressing in the hardware ecosystem. On this slide, it brings it full circle, claiming that what it is doing works extremely well. To hardware manufacturers and the people who know how they work, an 86% accuracy of product demand forecasting is as good as it gets; it may as well be a crystal ball. This is an incredibly powerful claim that goes a long way toward confirming that the company is building something that may well be an indispensable tool for hardware manufacturers. When you are putting together your own slide deck, think about whether you have a similar metric you can refer to, one that illustrates how much better your customers’ lives will be if they use your product. It’s a great storytelling tool — if it stands up to scrutiny. [Slide 12] Plenty of space to grow. Image Credits: Prelaunch [Slide 11] Showing what the tool does is helps explain why it’s useful. Image Credits: Prelaunch Stop spending so much time on your product when pitching to investors This part of the story is very show-don’t-tell, and it describes a couple of important things about the company and its product: It’s able to create complex dashboards that convey large amounts of information simply, and it’s able to build a product that’s intuitive and actionable. I usually only add three things I like, but I had to include this slide as well … [Slide 14] In the four months since launch, Prelaunch has seen incredible growth. Image Credits: Prelaunch","description":"Prelaunch.com has quite a few wins in its pitch deck, but it's missing some fundamentals as well. Pitch Deck Teardown: Prelaunch.com’s $1.5M seed deck by Haje Jan Kamps originally published on TechCrunch","id":"1a637a90-576e-45f5-be65-a062a9111f22","link":"https://techcrunch.com/2023/03/23/sample-seed-pitch-deck-prelaunch-dot-com/","pubDate":"2023-03-23 15:00:30","title":"Pitch Deck Teardown: Prelaunch.com’s $1.5M seed deck"},{"content":"If Reddit and Stack Overflow were ever to create an offspring, it might look a little something like Daily.dev , perhaps with a little bit of Hacker News somewhere in the genetic makeup too. Founded out of Tel Aviv, Daily.dev wants to help like-minded software developers connect, share knowledge and discuss all that’s happening across their ecosystems. The three-year-old startup is today announcing its first institutional funding, securing a $11 million seed tranche from a slew of backers including lead investor Aleph , an early-stage VC firm that has previously backed the likes of WeWork , Lemonade , and Houseparty . Daily.dev can be accessed through a number of channels , including a web app, Android , a progressive web app ( PWA ), and a browser extension . During the initial onboarding process, users are first asked to select topics that interest them — such as databases, developer tools or data science — and then they sign up using either their email address or credentials associated with Facebook, Google, GitHub, or Apple. Daily.dev: Choose topics Image Credits : TechCrunch / screenshot Users can then see a personalized feed based on their stated preferences, which might include how-to guides, news articles, questions, and general discussions, or they can filter by the most popular posts. Anyone is free to bookmark threads, upvote posts of comments, and kickstart their own conversations. Daily.dev: “Most upvoted” Image Credits : TechCrunch / screenshot Over time, users accumulate a “ reputation ” score based on their upvotes from the broader Daily.dev community. While this kudos can serve as an at-a-glance indicator of trust, in time it will also be used to determine access to special privileges, though the company hasn’t yet announced what type of perks this will include. Image Credits: Daily.dev While this voting system is certainly reminiscent of something like Reddit or Stack Overflow, Daily.dev is notable in that there is no downvote button — a move partially designed to avoid the kind of toxicity and negativity that has plagued other similar online communities. “Establishing a healthy and sustainable community has to do a lot with managing emotions, negativity in particular,” Daily.dev co-founder and CEO Nimrod Kramer explained to TechCrunch. “So far, we haven’t built a downvote feature, mostly due to that logic.” However, it’s worth noting that users can still lose reputation points, for example if one of their posts is reported by other users and that post is banned by platform moderators. Kramer also said that they’re thinking about other ways to embrace the ethos of a downvote button without compromising the “healthy” vibes they’re trying to foster. “We are considering non-toxic ways to implement a new downvote mechanism to allow us to better personalize the platform, and also to let developers express criticism, without the potentially offensive implications,” he said. There’s no escaping the fact that there are plenty of developer-focused communities out their on the web, from Discord and Hacker News, to GitHub and Stack Overflow. So what, exactly, is Daily.dev hoping to bring to the mix? Kramer reckons that most of the incumbents are either too general or too focused on specific problems. “There’s a gap — when developers gather around general social platforms like Reddit, Discord and Twitter, the professional content they get is mixed with general content, marginalizing the domain-specific and highly-professional insights that fuel them,” Kramer said. “ When they collaborate on developer platforms such as GitHub and Stack Overflow, the social experience they get is mostly siloed to specific repositories and Q&As. With Daily.dev, developers get a platform that’s built to their very specific preferences, values and language and offers a wide breadth of opportunities for learning, community and collaboration.” As a bonus, Daily.dev has made large chunks of its platform available on GitHub under an open source license, a move that’s common to many companies looking to ingratiate themselves with the software development fray. Developers love open source tools, as it allows them to tinker with the underlying technology and even contribute fresh code themselves. “We strategically decided to open-source big parts of our code base to establish trust and transparency with our global developer community,” Kramer said. “It’s a win-win, because our users are developers. Being open source allows users to give feedback, contribute features, and fix bugs.” In terms of business model, Kramer said that Daily.dev currently makes money from tech companies running paid promotions on initiatives that might be of interest to developers, which for now translates into promoted discussions like this: Daily.dev: Promoted posts and discussions As for its user base, Kramer said that Daily.dev has around 100,000 active daily users, including developers from all the big tech companies such as Apple, Google, Amazon, Microsoft, and Meta. Some 90% of these users also use the browser extension, according to Kramer, meaning they will see Daily.dev whenever they launch a new tab. While Daily.dev has grown over the past few years off the back of bootstrapping, its fresh $11 million cash injection will allow it to bolster the platform with new features. This includes something called “Daily.dev squads,” which are effectively private spaces for developer groups to coalesce. “This feature is currently in closed beta with several hundreds of our most active power users, and will be released publicly later this year,” Kramer said. In the future, Daily.dev may also monetize through companies looking to foster relationships with developers, perhaps serving as a gateway to solicit feedback on new products, for example, or maybe even to recruit. “We see massive potential in the B2B space to enable meaningful, relevant communication between companies and developers,” Kramer said. “Tech companies are hungry for developer-specific audiences to engage with, whilst developers are looking for new solutions when brought to them relevantly and respectfully.” Although Daily.dev’s three co-founders (Kramer, Ido Shamun and Tsahi Matsliah ) are all based out of Israel, the company says that it’s “remote native,” with 16 employees spread across 7 countries. Aside from lead investor Aleph, other backers in Daily.dev’s seed round included Jibe Ventures, Secret Chord Ventures, and a handful of angel investors.","description":"If Reddit and Stack Overflow were ever to create an offspring, it might look a little something like Daily.dev, perhaps with a little bit of Hacker News somewhere in the genetic makeup too. Founded out of Tel Aviv, Daily.dev wants to help like-minded software developers connect, share knowledge and discuss all that’s happening across their […] Daily.dev is like Reddit meets Stack Overflow by Paul Sawers originally published on TechCrunch","id":"a640521a-2192-4c5b-9883-4e74e2ae8a2c","link":"https://techcrunch.com/2023/03/23/daily-dev-is-like-reddit-meets-stack-overflow/","pubDate":"2023-03-23 15:00:21","title":"Daily.dev is like Reddit meets Stack Overflow"},{"content":"Do Kwon, the founder of Terraform Labs, has reportedly been arrested in Montenegro, according to a local government official. On Thursday morning, Filip Adzic, the minister of interior of Montenegro, tweeted in Bosnian that Kwon was arrested at the airport in Podgorica, the capital of Montenegro, with falsified documents. Adzic added that they were waiting for official confirmation of Kwon’s identity. The interior ministry of Montenegro did not immediately respond to an email seeking confirmation. Its phone number was unreachable. Interpol’s website did not have any update about Kwon’s arrest. Interpol did not immediately respond to an email seeking comment. It appears though that the person arrested was indeed Kwon. The Korean news agency, Yonhap, quoted a National Police Agency official as saying: “We checked the age, nationality, and name with the identification card the person had, and confirmed that he was the same person as CEO Kwon with photo data.” Kwon has been under investigation for the past 11 months since the Terra/LUNA collapse, which wiped out about $40 billion from the cryptocurrency market. In mid-September, Kwon tweeted , “I am not ‘on the run’ or anything similar – for any government agency that has shown interest to communicate, we are in full cooperation and we don’t have anything to hide.” “We are in the process of defending ourselves in multiple jurisdictions – we have held ourselves to an extremely high bar of integrity, and look forward to clarifying the truth over the next few months,” he said at the time. While Kwon declined claims he wasn’t hiding from authorities, prosecutors have refuted those claims. In late September, his whereabouts were unknown and Interpol issued a red notice requesting law enforcement agencies worldwide search for and arrest him. Shortly after, the South Korean government ordered Kwon to surrender his passport or risk it getting revoked. Do Kwon has said that charges leveled against him by the South Korean prosecutors are not legitimate and are politically motivated, TechCrunch previously reported . “Every sovereign nation can interpret the red notice the way it sees fit,” he told journalist Laura Shin on her podcast Unchained in mid-October. At the time, he said he plans to address, appeal and do everything to get to a “better result.” Fast-forward to February, prosecutors in South Korea traveled to Serbia, suspecting that was where Kwon was staying. In mid-February, The U.S. Securities and Exchange Commission charged Terraform Labs and Kwon with defrauding U.S. investors who purchased its crypto assets, LUNA and the not-so-stable stablecoin, Terra.","description":"Do Kwon, the founder of Terraform Labs, has reportedly been arrested in Montenegro, according to a local government official. Terra creator Do Kwon reportedly arrested at Montenegro airport by Jacquelyn Melinek originally published on TechCrunch","id":"5016929f-cced-472f-a848-81ea150c783a","link":"https://techcrunch.com/2023/03/23/terra-creator-do-kwon-reportedly-arrested-at-montenegro-airport/","pubDate":"2023-03-23 14:47:05","title":"Terra creator Do Kwon reportedly arrested at Montenegro airport"},{"title":"Apple Is Reportedly Taking Attendance Amid Back to Office Push","link":"https://www.gizmodo.com.au/2023/03/apple-is-reportedly-taking-attendance-amid-back-to-office-push/","description":"Apple has struggled to force its employees back into the office with its hybrid work plan, even though its employees... The post Apple Is Reportedly Taking Attendance Amid Back to Office Push appeared first on Gizmodo Australia.","content":"Apple has struggled to force its employees back into the office with its hybrid work plan, even though its employees have largely been antagonistic to the Cupertino company’s in-office working whims. Like we’re all back in grade school, Apple is just the next company that is reportedly taking attendance to make sure its staff are commuting at least three days a week to the office. Zoë Schiffer, the managing editor of the Platformer tech blog, tweeted Wednesday based on unnamed sources that Apple would use badge sign in records to track if they’re coming into the office. Those who don’t will get “warnings” if they don’t come in the mandatory three days a week. Some teams are telling staff if they don’t comply they could be shown the door. Schiffer has had experience reporting on Apple’s remote work policy for The Verge, though the tweet didn’t offer much about her source. Still, this isn’t exactly groundbreaking stuff, as recent reports from longtime Apple analyst Mark Gurman have noted that the tech giant is doing whatever it can to avoid layoffs . Part of this reportedly includes threatening to lay off employees who don’t go in to work Tuesday, Wednesday, and Thursday. Last May, employees protesting the company’s work from home plans managed to delay the mandatory three day in-office policy . Apple’s former Director of Machine Learning Ian Goodfellow allegedly jumped ship to Google’s parent company Alphabet after Apple started to crack down on remote work. Apple workers have circulated petitions in protest of their company’s work mandates that finally went into effect last September. Of course, it’s not just Apple that’s now apparently checking daily attendance to make sure employees are clocking into the office. Though as far as other tech companies go, it’s hard to see how Apple stacks up. The Alphabet-owned Google requires staff to show up three days in-person with plans to eventually end all hybrid work altogether . At the same time, Googlers in the company’s cloud business are only expected to work in office two days a week, but they also might have to share or rotate desks due to downsizing. Last month, YouTube Music contractors went on strike over a return to in-person work order and alleged union busting tactics . In February, Amazon also issued a three-day hybrid work order to its office employees. CEO Andy Jassy said up until that point, some teams had been working exclusively from home while others were working hybrid, but that was somehow impacting their employees ability to “absorb” the company “culture.” Microsoft, on the other hand, has been more open to cushier hybrid work policies which lets employees work remotely 50% of the time. The company’s own Work Trends study seems to back up the claim that “hybrid work is just work.” Still, CEO Satya Nadella spoke at the recent Yahoo Finance’s All Markets Summit and said that employers are still too concerned about how productive employees are being when they’re working from home.","pubDate":"2023-03-23 14:40:13","image_url":"https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/24/e84b4ec94b38a204c35209539c82dfa9.jpg?quality=80=1280,720","id":"b8f53a4b-bb57-4e7c-ab89-b255975b4122"},{"title":"Why you should NOT be loyal at work, according to scientists","link":"https://www.dailymail.co.uk/sciencetech/article-11894943/Why-NOT-loyal-work-according-scientists.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","description":"Researchers from Duke University have discovered company loyalty is a double-edged sword as managers exploit loyal workers over less committed colleagues.","content":"Why you should NOT be loyal at work: Devoted employees are more likely to be given extra tasks and asked for unpaid overtime, study finds Researchers have discovered company loyalty is a double-edged sword Managers exploit loyal workers over less committed colleagues By Xantha Leatham Deputy Science Editor For The Daily Mail Published: 14:32 GMT, 23 March 2023 | Updated: 14:32 GMT, 23 March 2023 e-mail 16 View comments You might think being a loyal worker is key to going far in your career. But being a devoted employee could make you more likely to be tasked with extra work and unpaid overtime, a study suggests. Researchers have discovered company loyalty is a double-edged sword as managers exploit loyal workers over less committed colleagues. The team, led by Duke University, conducted a series of experiments involving nearly 1,400 managers online. Participants read about a fictional 29-year-old employee called John, and the managers all learned that John's company was on a tight budget. Being a devoted employee could make you more likely to be tasked with extra work and unpaid overtime, a study suggests (stock image) The core traits of TOXIC bosses: Scientists identify 5 key characteristics- READ MORE From Miranda Priestly in The Devil Wears Prada (pictured) to Mr Burns in The Simpsons, bad bosses have been staple features of blockbuster hits for years <!- - ad: https://mads.dailymail.co.uk/v8/fr/sciencetech/none/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement To keep costs down, they had to decide how willing they would be to task John with extra hours and responsibilities without any extra pay. No matter how the researchers framed the scenario, branding John as 'loyal' led to an increased willingness to recruit him for unpaid work, compared to versions of John who were more 'honest', 'fair' or 'disloyal'. The findings, published in the Journal of Experimental Social Psychology, found the reverse was also true. When John was portrayed as having a reputation to accept extra hours and workload, managers rated him as more loyal than if he had a reputation to decline the same workload. Lead researcher Matthew Stanley said: 'It's a vicious cycle. 'Loyal workers tend to get picked out for exploitation. And then when they do something that's exploitative, they end up getting a boost in their reputation as a loyal workers, making them more likely to get picked out in the future.' The scientists said they believe managers target loyal workers because they think that loyalty comes with a duty to make personal sacrifices for their company. But they warned while company loyalty seems to come with consequence, it doesn't mean that we should just abandon work commitments or dodge uncompensated overtime. Instead, this is just an unfortunate side-effect of a mostly positive trait, they said. 'I don't want to suggest that the take-away of the paper is to not be loyal to anybody because it just leads to disaster,' Mr Stanley added. 'We value people who are loyal. We think about them in positive terms, and they get rewarded often. 'It's not just the negative side. It's really tricky and complex.' Bad news for bosses: 'Quiet quitting' trend for micro-breaks actually makes employees BETTER at their jobs 'Quiet quitting' is a trend that has taken over TikTok in recent weeks, in which Gen Z workers do the bare minimum at work to avoid burnout. The trend has been largely criticised by experts, with one calling it a 'short-term fix'. However, a new study suggests that the trend might actually make employees better at their jobs. Researchers from the West University of Timioara found that taking micro-breaks can boost energy and reduce fatigue at work. 'Micro-breaks are efficient in preserving high levels of vigour and alleviating fatigue,' the researchers wrote in their study, published in PLOS ONE . While micro-breaks did not appear to affect performance on tasks, the researchers found that longer breaks did. Based on the findings, the researchers suggest that bosses should offer their employees a combination of micro-breaks and longer breaks. Share or comment on this article: Why you should NOT be loyal at work, according to scientists e-mail Add comment","pubDate":"2023-03-23 14:32:29","image_url":"https://i.dailymail.co.uk/1s/2023/03/23/14/69033371-0-image-m-148_1679581866960.jpg","id":"9ba6b8ee-258b-4273-8ff8-733ba76f9643"},{"content":"We learned last night that the U.S. Securities and Exchange Commission served Coinbase with a Wells notice , a prelude to taking enforcement action against the U.S. crypto giant over potential “violations of the federal securities laws.” The company intends to put up a fight, according to its CEO. Separately, the CEO of TikTok, Shou Zi Chew, is expected to testify in front of Congress this morning. The stakes for the social media service are high. The app has engendered concerns across the U.S. political spectrum , including allegations concerning data security, user privacy and potential meddling by a foreign government. The Biden administration wants the app’s parent company to sell it so that TikTok can have ownership in a different country under a different code of law. The Chinese Communist Party doesn’t want it to sell . Chew is stuck in the middle. The Exchange explores startups, markets and money. Read it every morning on TechCrunch+ or get The Exchange newsletter every Saturday. That well-known tech products are in regulatory crosshairs should not surprise. The aggregated value of crypto assets is north of $1 trillion, lots of consumers are involved and Coinbase is a leading company in a market that has evolved faster than its regulatory oversight. TikTok is incredibly popular in the United States but suffers from sour relations between China, where its parent company is based, and the U.S. economy that generates a large chunk of its revenue. Even worse for TikTok, it has, at a minimum, operated in a manner in the past that has directly undercut its ability to claim that it is benign. It strikes me how distinct in substance the Coinbase and TikTok matters are and also in how we should feel about them. In case you are in a hurry, TikTok has failed to earn the sort of trust it requires to operate in its current form and should not be allowed to continue to do so. Coinbase, in contrast, is a far more sympathetic company to consider. Let’s talk about it. (To be clear, this is my thinking out loud about these issues, not my speaking for TechCrunch as a whole.)","description":"While regulatory action against TikTok feels rather simple, Coinbase's case has far more gray area. As TikTok and Coinbase face regulators, some questions are simpler than others by Alex Wilhelm originally published on TechCrunch","id":"12c614c1-303b-473b-b40e-b0ce4d564722","link":"https://techcrunch.com/2023/03/23/tiktok-coinbase-sec-regulations/","pubDate":"2023-03-23 14:30:33","title":"As TikTok and Coinbase face regulators, some questions are simpler than others"},{"content":"Many companies are struggling to get funding these days in an increasingly tight investment environment. It seems the days are gone when VC firms approach promising startups about funding instead of the other way around, but Hex , a data collaboration startup, has defied the odds. Company co-founder and CEO Barry McCardel says he wasn’t looking for funding when Sequoia came knocking on his door. The company ended up landing another $28 million from Sequoia with participation from existing investors Andreessen Horowitz, Amplify and Snowflake. McCardel says he still hasn’t touched the $52 million he had in the bank from his previous funding round last year. “We weren’t raising, and didn’t need the money — we hadn’t touched a dime of the last round. But Matt Miller at Sequoia approached us preemptively with an offer that gave us very little dilution, and let us put another 2-3 years of runway in the bank,” McCardel told TechCrunch. “This felt like a no-brainer coming into a time when we want to be investing deeply in our product and team, especially around the AI opportunity,” he said. One of the reasons for the investor interest is that the company has been growing at a rapid clip since its funding last year. “We’ve been on a tear. I think from a top line business perspective, we’ve grown revenue by 4x and the size of the business by 4x in one year, which has been great. We 10xed our user base because we launched a tier that just opened up access to a ton more people.” “So just the raw number of people using the product in the last year has been great. And I think that obviously caught the eye of new investors,” he said. The company now has 450 paying customers including Brex, Notion, Toast and Chegg, He believes that the collaborative approach to data and the growing recognition that AI is transforming workflows are the biggest reasons for the product’s growing popularity. Most recently, the company added a tool called Hex Magic , a generative AI approach to interacting with the data with plain language by asking questions about the data, or asking Hex to undertake a task like auto-completing a join, and the software responds to the requests. He sees this as a way to expand the user base beyond folks like data scientists and people who know SQL or Python. “Our product uniquely allows collaboration across different data personas. I think that’s also really powerful. And I think the AI stuff is just accretive to that. You don’t necessarily have to know how to write the perfect syntax in Python to do something because Hex can help you do that. So I think that’s a pretty powerful thing that we’ll just see become more and more important in terms of opening up [the platform] to more people,” he said. Hex was founded in 2019 and has now raised over $100 million dollars in just four years, per Crunchbase data . With the most recent round of funding. McCardel says he should have five years of runway, setting his company up to ride out whatever economic uncertainty may be out there, while giving him the freedom to grow the platform as needed.","description":"Many companies are struggling to get funding these days in an increasingly tight investment environment. It seems the days are gone when VC firms approach promising startups about funding instead of the other way around, but Hex, a data collaboration startup, has defied the odds. Company co-founder and CEO Barry McCardel says he wasn’t looking […] Hex lands another $28M as data collaboration platform continues to gain traction by Ron Miller originally published on TechCrunch","id":"b097c069-4efc-49aa-91f2-862fc1fb7229","link":"https://techcrunch.com/2023/03/23/hex-lands-another-28m-as-data-collaboration-platform-continues-to-gain-traction/","pubDate":"2023-03-23 14:00:49","title":"Hex lands another $28M as data collaboration platform continues to gain traction"},{"content":"has announced the first of its UK remote test drive hubs, which let prospective buyers try out one of its miles away from a Tesla Centre. However, the first of these is a bit of a trek from London. It is situated next to the Taste Perthshire restaurant, described as the best of the two restaurants in Bankfoot, a few kilometres away from in , by Tripadvisor. Tesla’s first UK remote test drive spot truly is pretty “remote”, but that suits the concept. You book a Tesla remote test drive online, completing all the necessary paperwork. You call a phone number when you reach the car, and the Tesla’s cameras are used to verify your identity. A Tesla rep then unlocks the car. They will also guide people through the car’s features, and how to control it. Drivers are then free to enjoy the 30-minute test drive of the car. SPONSORED This announcement comes only days after Tesla opened its first remote test drive hub, in Sweden’s Örebro. A self-checkout approach to car test drives, the driver is simply asked to return the car back to the starting spot, and to plug it back in. There are currently no remote test drive hubs in London, but they aren’t really needed when test drives are available at Tesla locations in London Park Royal, Dartford and Westfield White City. However, if you do find yourself near Perth, remote test drive slots are available daily from 10.30am to 5pm. Tesla cut its car prices two weeks ago, dropping up to £7,000 from entry-level models, bringing the Tesla Model 3 to £42,990 and the Tesla Model Y down to £44,990. The company’s stock valuation has taken repeated hammerings over the past 12 months; it is currently valued at less than half of its peaks during late 2021. This follows weakening demand, particularly in China, where there is increasing competition from lower-cost alternatives.","description":"Tesla’s first remote test drive site in the UK has launched, near Perth in Scotland","id":"e0fefacc-d4a2-4a4a-94f2-42eea32034ff","image_url":"https://static.standard.co.uk/2023/03/23/11/tesla.jpg?width=1200&auto=webp","link":"https://www.standard.co.uk/tech/tesla-cars-electric-test-perth-scotland-b1069423.html","pubDate":"2023-03-23 13:07:54","title":"Tesla launches UK contact-free test drives, but there’s a catch"},{"content":"DoorDash is adding three new retail partners and updating its shopping features, the company announced on Thursday. Starting today, users can start placing orders for items at Lush Cosmetics, Victoria’s Secret and Party City. The announcement is part of DoorDash’s ongoing efforts to expand into new retail categories. The new partners join DoorDash’s current retail offerings across apparel, cosmetics, sporting goods, household essentials and more. As for the new shopping features, DoorDash is optimizing the search and discovery experience on its platform to make it easier for users to search within a retail store to find specific items that they need. The new update brings more relevant in-stock options that users can quickly add to their cart. The company is also making scheduling ahead options available to more consumers, and now with more options. A spokesperson for the company told TechCrunch in an email that some users will now see three options for delivery time windows, including “express” (typically under an hour), “standard” (or within two hours) and “schedule ahead” (up to 5 days in advance). Last, DoorDash is making it easier for users to choose substitutions. In instances when the store is out of an item that a user ordered, the company has built in messaging automation to make communication between the customer and delivery person more seamless. When the delivery person marks an item as out-of-stock, the customer will receive a prompt in app to pick between other available options. The delivery service has been working to develop its platform to become more than just a way to order meals from local restaurants. For instance, the company recently launched a way for DoorDash drivers to pick up consumers’ e-commerce returns and other packages for drop-off at UPS, FedEx or USPS locations. Today’s announcement comes two days after DoorDash revealed that it will begin supporting the ability for customers to pay with cash for their online orders through a new feature for DoorDash’s white-label delivery solution for restaurants, DoorDash Drive , which allows restaurant owners to offer delivery from their own website or app while tapping into DoorDash’s courier network. The company says Chinese restaurants and pizza shops have been early adopters of the feature. DoorDash is adding support for cash — but not in its main app","description":"DoorDash is adding three new retail partners and updating its shopping features, the company announced on Thursday. Starting today, users can start placing orders for items at Lush Cosmetics, Victoria’s Secret and Party City. The announcement is part of DoorDash’s ongoing efforts to expand into new retail categories. The new partners join DoorDash’s current retail […] DoorDash is adding three new retail partners and updating its shopping features by Aisha Malik originally published on TechCrunch","id":"725abe86-58c2-4afe-bd56-f4e93830d96d","link":"https://techcrunch.com/2023/03/23/doordash-new-retail-partners-updating-shopping-features/","pubDate":"2023-03-23 13:00:56","title":"DoorDash is adding three new retail partners and updating its shopping features"},{"content":"Japanese industrial conglomerate Toshiba Corp. said Thursday it has agreed to a deal worth ¥2 trillion, equivalent to $15 billion, to take the company private. Toshiba said the buyout would be led by Japan Industrial Partners Inc., a Tokyo-based investment fund. It said the buyers were offering ¥4,620 a share, about 10% above the closing price of ¥4,213 in Tokyo Stock Exchange trading Thursday. That values the company at about ¥2 trillion. If the deal wins support from shareholders and regulators, it would mark the conclusion of years of turmoil at Toshiba, a former leader in Japan’s corporate world that has shed many of its well-known businesses including laptop computers and medical equipment. MORE FROM THIS SECTION See All Premium Premium Would You Pay $1,000 for a Smartphone Without 5G? Huawe ... Premium Premium Koo introduces new safety features for content moderation Premium Premium “India currently holds 127 patents for 6G,” says Teleco ... Premium Premium Nothing Ear 2 with enhanced battery life, ANC launched. ... In March 2022, Toshiba shareholders rejected a management plan to split the company into two parts, reflecting opposition from foreign shareholders including some who wanted the company to be auctioned to the highest bidder. The next month Toshiba put itself up for auction, soliciting options to strategically reorganize itself, including privatization. OPEN IN APP","description":"Japanese industrial conglomerate agrees to takeover by Tokyo-based investment fund","id":"b3174276-1f68-46c1-9a5f-f7cf16f73a36","image_url":"https://images.livemint.com/img/2023/03/23/1600x900/JAPAN-SHAREHOLDERS-ADVISORY-0_1679575922211_1679575922211_1679575987886_1679575987886.JPG","link":"https://www.livemint.com/technology/tech-news/toshiba-announces-15-billion-plan-to-be-taken-private-11679575898972.html","pubDate":"2023-03-23 12:53:38","title":"Toshiba Announces $15 Billion Plan to Be Taken Private"},{"content":"TikTok Chief Executive Shou Zi Chew testifies Thursday morning at a high-stakes congressional hearing, as safety and security concerns over the Chinese-controlled platform deepen even as its popularity in the U.S. grows. Mr. Chew, a Harvard-educated Singaporean army reservist and former Goldman Sachs Group Inc. banker, will testify before the House Energy and Commerce Committee, whose members have already signaled concerns that Beijing could influence TikTok content and harvest user data. TRENDING STORIES See All Premium Toshiba Announces $15 Billion Plan to Be Taken Private Premium UBS Faces Tough Choices as It Weighs Up Credit Suisse’s ... Premium Ford Projects $3 Billion Loss on EV Business for 2023 Premium FTC Proposes Penalizing Firms for Onerous ‘Call-to-Canc ... In his prepared testimony, Mr. Chew pledged to firewall U.S. user data from foreign access and shield the platform from government interference. He also said the platform would work to ensure a safe environment for young people, another concern of committee members. Despite those promises, many in Congress are skeptical that TikTok can ever be beyond the reach of the Chinese government as long as it is owned by Beijing-based ByteDance Ltd. The Biden administration recently demanded that TikTok’s Chinese owners sell their stakes or face a possible ban. That makes Thursday’s appearance something of a gamble for Mr. Chew. The company is hoping he can persuade lawmakers that the company’s $1.5 billion plan to secure user data makes a forced sale unnecessary. But the hearing could also serve as a platform to amplify concerns about the app’s security, adding to pressure to block access to the app in the U.S. “The evidence against TikTok’s Chinese-controlled parent company, ByteDance, is overwhelming, which makes this a high-risk hearing for the company and its defenders,\" said Sen. Marco Rubio (R., Fla.), a leading critic of the company. Any stumble, he added, “will increase calls for a ban.\" Mr. Chew has said he doesn’t consider Thursday’s hearing a do-or-die moment. But he risks accelerating TikTok’s banishment from the U.S. with a poor performance, said Bill Plummer, who ran government and public relations for Huawei Technologies Co.’s Washington office from 2010 to 2018. Huawei, a Chinese telecommunications-equipment company, ultimately failed to persuade U.S. leaders from effectively banning it from major U.S. business. TOP GADGETS See All MORE FROM THIS SECTION See All Premium Premium Would You Pay $1,000 for a Smartphone Without 5G? Huawe ... Premium Premium Koo introduces new safety features for content moderation Premium Premium “India currently holds 127 patents for 6G,” says Teleco ... Premium Premium Nothing Ear 2 with enhanced battery life, ANC launched. ... Since some Biden administration officials and Congress members have already dismissed Mr. Chew’s plan to silo off TikTok’s U.S. operations from China, his best strategy is expressing openness to divesting some of TikTok’s Chinese ownership, Mr. Plummer said. “It doesn’t matter if that’s the best thing to do,\" Mr. Plummer said. “What matters is what the government wants.\" Several bills are under consideration in Congress that would ban TikTok outright, typically by banning U.S. companies from doing business with it. Some would also allow the government to ban or restrict other apps with ties to hostile foreign governments. Mr. Chew likely will also spend time on Thursday responding to lawmakers’ concerns about exploitation of children through the platform. Many lawmakers also are unhappy that TikTok’s parent company serves very different content to children within China. In his prepared testimony, Mr. Chew said that the platform has taken a number of proactive steps to better protect children—including measures that go beyond those employed by other platforms. For example, accounts registered to teens under 16 are set to private by default, and they also can’t send direct messages. Their content is ineligible for recommendation. Democrats have generally been more supportive of TikTok than Republicans, calling a ban overly broad. A handful of congressional supporters led by Rep. Jamaal Bowman (D., N.Y.) rallied on the Capitol steps Wednesday evening to show their support for TikTok and its creator community. An actual ban on TikTok faces an array of practical and legal hurdles, and two federal judges struck down former President Donald Trump’s earlier attempts to do so. Any new attempt would likely hurt Democrats more than Republicans, as TikTok’s dominant audience is composed of younger people who are more likely to vote Democratic. That said, the app’s wild popularity—the platform now claims to have 150 million monthly users—adds to the political risks of any crackdown. “Some politicians have started talking about banning TikTok,\" Mr. Chew said in a TikTok video this week. “Now this could take TikTok away from all 150 million of you.\" On Wednesday morning, TikTok helped organize a news conference at the Capitol featuring dozens of TikTok personalities, who made their own case that banning the app would suppress Americans’ speech. The company has also recently expanded its lobbying and public-relations efforts and run ads at Washington subway stops and elsewhere touting the company’s commitment to user safety. Mr. Chew has also been meeting with members of the House committee, including Rep. Buddy Carter (R., Ga.). The meeting “did not alleviate the congressman’s concerns\" about TikTok’s impacts on national security as well as mental health, a spokesman said, adding, “He plans to address all these issues during the Thursday hearing.\" Rep. Tim Walberg (R., Mich.) even refused a meeting with Mr. Chew ahead of the hearing, a senior aide said. Some Democrats appear more open-minded, but still skeptical. Rep. Yvette Clarke (D., N.Y.), a senior member of the House panel, said she wants to hear Mr. Chew address concerns about the impact of TikTok’s recommendation algorithm as well as explain why the company has occasionally stumbled in its handling of American users’ data. Ms. Clarke didn’t say she supported a ban, but she also didn’t rule it out. “I’m open to whatever it takes to protect the American people, their data, [and] our national security. \" she said. OPEN IN APP","description":"A stumble by Shou Zi Chew ‘will increase calls for a ban,’ Sen. Marco Rubio says","id":"4da17c94-1df2-449c-af50-471d1b6b876d","image_url":"https://images.livemint.com/img/2023/03/23/1600x900/im-748663_1679575335551_1679575340802_1679575340802.jpg","link":"https://www.livemint.com/technology/tech-news/tiktok-ceo-seeks-to-convince-congress-chinese-owned-app-isn-t-security-threat-11679575238634.html","pubDate":"2023-03-23 12:42:56","title":"TikTok CEO Seeks to Convince Congress Chinese-Owned App Isn’t Security Threat"},{"content":"Huawei Technologies Co. is doubling down on its bet that customers are willing to pay top dollar for a premium smartphone even if it doesn’t have 5G.","description":"Chinese tech vendor’s new P60 smartphone is latest top-end device to launch without 5G, counting on camera and other features to stand out","id":"401eb199-b611-4d09-85bc-37c257dafdac","image_url":"https://images.livemint.com/img/2023/03/23/1600x900/2021-01-11T010721ZYNXMPEH0A00S_RTROPTP_3_INDIA_1679574870621_1679574870798_1679574870798.JPG","link":"https://www.livemint.com/technology/gadgets/would-you-pay-1-000-for-a-smartphone-without-5g-huawei-thinks-so-11679574691948.html","pubDate":"2023-03-23 12:34:58","title":"Would You Pay $1,000 for a Smartphone Without 5G? Huawei Thinks So"}]