[{"title":"GWS names Harry Rowston for AFL debut against West Coast","link":"https://www.perthnow.com.au/sport/gws-names-harry-rowston-for-afl-debut-against-west-coast-c-10143082","description":"The Giants will blood a highly touted pick against West Coast in Perth, but another draftee will have to wait longer for his chance.","content":"The Giants will blood highly rated on-baller Harry Rowston against West Coast, but last year’s No.1 pick will have to bide his time despite another bag of goals. Rowston, who was taken by the Giants with pick 16 after they were forced to match Sydney’s bid for their academy player, has won his chance in Perth amid injuries to midfielders Josh Kelly (concussion) and Harry Perryman (hamstring). The 18-year-old was told on Friday by captain Toby Greene in front of the Giants players and coaches that he would make his debut against the Eagles. He said the prospect of a debut had been playing on his mind after it was confirmed at the start of the week that Kelly, Perryman and Lachie Whitfield (concussion) would all be unavailable to play. “I haven’t slept all week, just been thinking about it … it’s pretty exciting,” Rowston said. “To finally know, I couldn’t be happier. “I’ll get in there and compete … hit bodies, tackle hard – those are the things I got drafted for and the things that Kingers (coach Adam Kingsley) has wanted me to show out on the footy field.” Top draft pick Aaron Cadman will have a longer wait for his first game but impressed Kingsley with his haul of six goals in a VFL practice match against Sydney last weekend. “Cads had a really strong game in the VFL, so he’s continually putting his hand up, so we’ll have a decision to make at some point, whether that’s this week or beyond, around do we want to see him at AFL level right now,” Kingsley said on Monday. “What’s the mix in the forward line, do we play four talls, is three enough, who makes way if we bring Aaron in? All these sorts of decision-making is attached to Aaron and we’re working our way through that. “But we’re in no rush to play him. He’s here for a career, not the first month of the season.” Rowston, who hails from a farm near Griffith in southern NSW, was part of the GWS academy all through his junior career until he was drafted last year. The 182cm right-footer received rave reviews over the pre-season from fellow on-ballers Tom Green, Callan Ward and Finn Callaghan, who all touted him as front of the queue for a midfield spot. He will be joined in the side by hard-running wingman Cooper Hamilton, with Callaghan likely to shift from the wing into an inside role after his impressive round 1 performance against Adelaide. Last week’s substitute, foundation player Adam Kennedy, has also broken into the starting 22 and will play his 150th game for the club.","pubDate":"2023-03-24 06:11:48","image_url":"https://images.perthnow.com.au/publication/C-10143082/1e7435cc38a3c8c98b6768e9a4e5b93d5fdace8e-16x9-x0y129w1382h777.jpg","id":"19497928-c082-47b9-b18d-e06e45de57fa"},{"title":"Highly rated Nakamba believes Luton will play in the EPL next season","link":"https://nehandaradio.com/2023/03/24/highly-rated-nakamba-believes-luton-will-play-in-the-epl-next-season/","description":"Luton Town Football Club new 'fan favourite' Marvelous Nakamba who expressed his disappointment following Saturday's 1-1 draw to Sunderland still believes the Hatters can secure promotion into the English Premier League (EPL). The post Highly rated Nakamba believes Luton will play in the EPL next season appeared first on Nehanda Radio.","content":"The 28-year-old who has turned out to be a vital cog in Luton’s midfield department after joining the club on loan from Aston Villa in January, is said to be positive Town will play in the EPL next season. His sentiments come after the Hatters as Luton Town are nicknamed, are playoffs hopefuls seated fourth on the log table with 68 points from 38 matches with eight games left to finish the campaign. “Town midfielder Marvelous Nakamba was frustrated to only pick up a point during the 1-1 draw at Sunderland on Saturday but remains confident the Hatters can join his parent club Aston Villa in the Premier League in May,” wrote the Luton Today website in their article on Tuesday. Luton thought they had won the match to make it four in a row, but Sunderland through Manchester United loanee Amad Diallo levelled matters in the 86th minute after being awarded a ‘dubious’ penalty. “The visitors had looked like they were going to secure a fourth straight victory with Nakamba to the fore, the Zimbabwe international making nine tackles, two interceptions, one clearance and blocking one shot for good measure too.”","pubDate":"2023-03-24 06:10:28","image_url":null,"id":"48d1ff74-2ecf-4913-af79-a62355aaca2f"},{"title":"Billiat linked with SuperSport United move; could reunite with Hunt","link":"https://nehandaradio.com/2023/03/24/billiat-linked-with-supersport-united-move-could-reunite-with-hunt/","description":"Soweto giants Kaizer Chiefs' attacking midfielder and former Warriors talisman Khama Billiat is reportedly being linked with a move to SuperSport United following an increasingly uncertain future at Naturena. The post Billiat linked with SuperSport United move; could reunite with Hunt appeared first on Nehanda Radio.","content":"Billiat’s contract with Amakhosi is set to expire at the end of the ongoing season in July and the club is reluctantly yet to table a new deal for the gifted forward. Following the situation, chances are high the 33-year-old former Ajax Cape Town midfielder won’t be with Chiefs in 2024. Several reports suggest that the former Zimbabwe international is nearing his Amakhosi exit having joined the club in 2018 from giants Mamelodi Sundowns. This can further be confirmed by the latest reports by Soccer-Laduma that Billiat is lined up for a reunion with his former coach (at Chiefs) Gavin Hunt who is the current gaffer of SuperSport United. “Soccer-Laduma reports that his (Billiat) former coach at Kaizer Chiefs, Gavin Hunt is interested in luring the player to his current club, SuperSport United,” another publication, the South African was qouted in a story published Tuesday. “The biggest stumbling block, however, is thought to be his salary at Amakhosi, unsurprisingly. “Billiat is thought to be earning around R500 000 a month at the moment and will almost certainly have to lower that salary if he is to join any other team in the DStv Premiership league.” Recently, the Harare-born football star was linked with a move to Saudi Arabia were it was believed he is eyeing another reunion with ex-coach Pitso Mosimane. He was also rumoured to be heading to another Middle East country, Egypt.","pubDate":"2023-03-24 06:05:40","image_url":null,"id":"f0220632-8e91-4c6e-a92c-148b5b68c4fa"},{"title":"News24.com | From Semenya to Thomas: 5 sportspeople who changed the gender rules","link":"https://www.news24.com/sport/OtherSport/Athletics/from-semenya-to-thomas-5-sportspeople-who-changed-the-gender-rules-20230324","description":"The decision taken by World Athletics on Thursday to ban male-to-female transgender athletes from women's competition is likely to have a wider effect on global sports.","content":"The decision taken by World Athletics on Thursday to ban male-to-female transgender athletes from women's competition is likely to have a wider effect on global sports. READ | Trans women banned from female athletics, Semenya's career hits another stumbling block AFP Sport looks at five sportspeople who have previously found themselves at the heart of the gender debate. Caster Semenya: hyperandrogenism A double Olympic champion and triple world champion in the 800m, South Africa's Caster Semenya raised all manner of questions about her hyperandrogenism, which causes an elevated level of testosterone. After a controversial victory at the 2009 world championships when she was just 18, the IAAF - as World Athletics was previously known - introduced rules two years later, for the first time, allowing hyperandrogenic athletes to compete on condition that they display androgen levels below those recorded for men. But in 2018 the IAAF made it mandatory for athletes, via drug treatments, to lower their testosterone levels to under 5 nanomoles per litre of blood for six months in order to compete in international events from 400m to the mile. The decision was badly received in South Africa where it was interpreted as a way to \"slow down\" Semenya who unsuccessfully challenged the ruling in court and was unable to defend her 800m title in the 2019 Doha world championships. She did not make the qualifying for the Tokyo Olympics in the 200m and failed to reach the final of the 5000m at the world championships in Eugene. Laurel Hubbard: Olympic pioneer In August 2021, in Tokyo, New Zealand weightlifter Laurel Hubbard, then 43 years old, made history by becoming the first openly transgender woman to take part in an Olympic event. Hubbard met the qualification criteria for the Olympics, which required that her testosterone level be maintained below 10 nmol per litre for at least 12 months. In spite of meeting the requirements, Hubbard's participation was widely criticised. Subsequently, the IOC gave up at the end of 2021 on establishing uniform guidelines for the participation criteria of intersex and transgender athletes, leaving it to the separate international federations. Emily Bridges: wheels in motion Transgender cyclist Emily Bridges, who had previously competed at elite level as Zach Bridges, was initially allowed to compete in last year's British National Omnium Championships, after having met the criteria laid down by the national cycling federation. However, Bridges, now 22, was forced to pull out because she was not eligible under International Cycling Union (UCI) rules. A week later, British Cycling decided to suspend its rules regarding the participation of transgender and non-binary athletes in competitions. In November, the policy was \"still under review\". Lia Thomas: making waves In February 2022, USA Swimming decided to revise its rules, limiting testosterone levels to less than 5 nmol/l for a period of at least 36 months for any transgender athletes wanting to compete at the elite level. The change was prompted by the controversy surrounding the performance of swimmer Lia Thomas in the university championship. Born male and having begun transition in 2019, Thomas was adjudged by detractors to be physiologically advantaged. Barely a month later, the University of Pennsylvania swimmer won the women's 500-yard freestyle final. It was an historic victory, made possible by the refusal of the NCAA, which governs college sports, not to apply the new USA federation rules. In June 2022, FINA, the international swimming federation, announced that it wanted to create an open category for transgender athletes. But it limited entry to its women's categories to swimmers who \"became women before puberty\". Hannah Mouncey: Aussie rules Hannah Mouncey was a top level men's handball player, picking up 22 selections for Australia. Mouncey began transitioning in 2015 and switched attentions to women's Australian Rules Football. In 2017, however, Mouncey was banned by the Australian Football League (AFL) from participating in the AFLW draft. The federation then admitted that Mouncey, now 33, \"has taken part in a process that will contribute... to the development of policies and procedures with regard to transgender people\". Mouncey went on to play one season in 2018 before reverting to handball, going on to represent Australia's women's team.","pubDate":"2023-03-24 05:21:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"70d4398f-13d2-4c9b-bde3-e9172e24bda1"},{"title":"LIVE STREAM: Benavidez vs Plant weigh-in, 4 pm ET","link":"https://www.badlefthook.com/2023/3/24/23654297/live-stream-benavidez-vs-plant-weigh-in-4-pm-et-march-24-boxing-news-2023","description":"David Benavidez and Caleb Plant weigh in today ahead of Saturday’s fight!","content":"The wait is almost over! David Benavidez and Caleb Plant will hit the scales today in Las Vegas, the final step before tomorrow’s Showtime PPV main event.\n\nThe weigh-in will stream live at 4 pm ET today, and we’ll have live coverage for the full show tomorrow, March 25, with the PPV beginning at 9 pm ET.\n\nIf you can’t watch, we’ll have updates and weigh-in results LIVE as they happen in this stream:\n\nHere’s the full lineup for tomorrow’s show:\n\nFull card lineup\n\nPPV (9 pm ET):\n\nDavid Benavidez (26-0, 23 KO) vs Caleb Plant (22-1, 13 KO), super middleweights, 12 rounds, for Benavidez’s interim WBC title\n\nJesus Ramos (19-0, 15 KO) vs Joey Spencer (16-0, 10 KO), junior middleweights, 10 rounds\n\nChris Colbert (16-1, 6 KO) vs Jose Valenzuela (12-1, 8 KO), lightweights, 10 rounds\n\nCody Crowley (21-0, 9 KO) vs Abel Ramos (27-5-2, 21 KO), welterweights, 12 rounds, WBC eliminator\n\nPrelims (7 pm ET):","pubDate":"2023-03-24 05:00:00","image_url":"https://cdn.vox-cdn.com/thumbor/BXp6YAC_ZyC5KXROSNoah-HMI58=/0x0:3600x1885/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24532464/0036_David_Benavidez_and_Caleb_Plant.jpg","id":"4c716644-c924-4aaa-9de7-b32d895f19d0"},{"title":"AFG vs PAK Dream11 Team Prediction Fantasy Hints, First T20I; Pakistan vs Afghanistan 1st T20I At Sharjah Cricket Stadium 9.30 PM IST Mar 24, Fri","link":"https://www.thetimesofbengal.com/sports/afg-vs-pak-dream11-team-prediction-fantasy-hints-first-t20i-pakistan-vs-afghanistan-1st-t20i-at-sharjah-cricket-stadium-9-30-pm-ist-mar-24-fri/","description":"Home Sports AFG vs PAK Dream11 Team Prediction Fantasy Hints, First T20I: Captain, Vice-Captain – Afghanistan vs Pakistan, Playing 11s For Today’s Match Sharjah Cricket Stadium 9.30 PM IST March 24, Friday Here is the Dream11 Team Prediction – Dream11 Guru Tips Prediction and AFG vs PAK Dream11 Team Prediction, AFG vs PAK Fantasy Cricket […]","content":"Home\n\nSports\n\nAFG vs PAK Dream11 Team Prediction Fantasy Hints, First T20I: Captain, Vice-Captain – Afghanistan vs Pakistan, Playing 11s For Today’s Match Sharjah Cricket Stadium 9.30 PM IST March 24, Friday\n\nHere is the Dream11 Team Prediction – Dream11 Guru Tips Prediction and AFG vs PAK Dream11 Team Prediction, AFG vs PAK Fantasy Cricket Prediction, AFG vs PAK Playing 11s, Fantasy Cricket Prediction Afghanistan vs Pakistan, Fantasy Playing Tips.\n\n\n\nAFG vs PAK Dream11 Team Prediction: All You Need To Know\n\nDubai: Afghanistan will lock horns against Pakistan for the first T20I match which will be played at Sharjah Cricket Stadium on Friday at 9.30 PM IST. Both teams will look to win the first game to take an early lead in the three-match T20I series. Shahdab Khan is leading Pakistan in absence of regular captain Babar Azam. Afghanistan were originally slated to kickstart their season with an ODI series against Australia this month in the UAE but Cricket Australia shelved its plans to play in protest at the curbs placed on women’s cricket in Afghanistan, paving the way for this series. Here is the Dream11 Team Prediction – Dream11 Guru Tips Prediction and AFG vs PAK Dream11 Team Prediction, AFG vs PAK Fantasy Cricket Prediction, AFG vs PAK Playing 11s, Fantasy Cricket Prediction Afghanistan vs Pakistan, Fantasy Playing Tips. AFG vs PAK Dream11 Team Prediction Fantasy Hints, First T20I: Captain, Vice-Captain – Afghanistan vs Pakistan, Playing 11s For Today’s Match Sharjah Cricket Stadium 9.30 PM IST March 24, Friday\n\nTOSS – Afghanistan vs Pakistan 1st T20I toss will take place on 9 PM IST on Friday\n\nTime – 9.30 PM IST, March 24, Friday.\n\nVenue: Sharjah Cricket Stadium.\n\nAFG vs PAK Dream11 Team\n\nWicketkeeper: Azam Khan (vc)\n\nBatsman: Najibullah Zadran, Shan Masood\n\nAll-rounder: Shadab Khan, Imad Wasim, Rashid Khan (c)\n\nBowler: Naseem Shah, Fazalhaq Farooqui, Mohammad Wasim Jr.\n\nAFG vs PAK Probable Playing XIs\n\nPakistan: Shan Masood, Saim Ayub, Iftikhar Ahmed, Mohammad Haris, Shadab Khan (c), Azam Khan (wk), Imad Wasim, Mohammad Nawaz, Mohammad Wasim Jr, Naseem Shah, Zaman Khan\n\nAfghanistan: Ibrahim Zadran, Najibullah Zadran, Usman Ghani, Sediqullah Atal, Rahmanullah Gurbaz (wk), Rashid Khan (c), Mohammad Nabi, Gulbadin Naib, Mujeeb Ur Rahman, Naveel-ul-Haq, Fazalhaq Farooqi\n\n\n\n\n\n\n\n\n\n\n\n","pubDate":"2023-03-24 04:41:50","image_url":"https://www.thetimesofbengal.com/wp-content/uploads/2023/02/cropped-1519896213114-300x300.png","id":"8d79f0a6-8c17-4da2-ac9f-316562574c80"},{"title":"Rybakina overcomes determined Kalinskaya, Americans progress","link":"https://www.malaymail.com/news/sports/2023/03/24/rybakina-overcomes-determined-kalinskaya-americans-progress/61332","description":"MIAMI GARDENS, March 24 — Wimbledon champion Elena Rybakina survived a spirited comeback from Russian Anna Kalinskaya at...","content":"MIAMI GARDENS, March 24 — Wimbledon champion Elena Rybakina survived a spirited comeback from Russian Anna Kalinskaya at the Miami Open on Thursday, progressing to the third round with a 7-5, 4-6, 6-3 win. Americans Jessica Pegula and Coco Gauff advanced with less complication enjoying straight sets wins at Hard Rock Stadium. Rybakina is aiming for the ‘Sunshine Double’ after defeating Aryna Sabalenka to win the Indian Wells final last week and she came into the match on the back of wins in each of the last eight games she has started. Kalinskaya broke early in the first set but failed to hold serving for the set at 5-4 up and her Kazakh opponent broke again to turn the set around. The Russian received medical attention between sets and started the second poorly but trailing 4-2 she produced a brilliant cross-court winner to break back. She broke again with Rybakina going long and wrapped up the set with a magnificent shot down the line to force the match into a deciding set. It was tight until Rybakina broke in the sixth game, Kalinskaya going for one deep effort too many but the Russian’s resilience was evident again as she responded with a break of her own. But a tiring Kalinskaya was unable to hold her serve and Rybakina saw the match out to set up a meeting with Spain’s Paula Badosa. World number three Pegula got her campaign under way with a confident 6-3, 6-1 second round win over Canada’s Katherine Sebov. With top-ranked Iga Swiatek having withdrawn, American Pegula is among the favourites to challenge for the title. “I had to adjust my game plan a little bit in that first set and then was able to close it out pretty easily,” said Pegula, a semi-finalist in Miami in 2022. Pegula will face fellow American Danielle Collins in the second round after she beat Bulgarian Viktoriya Tomova 7-6 (7/3), 6-2. Up and down Sixth-seed Gauff, beaten finalist in the French Open last year, saw off Canada’s Rebecca Marino 6-4, 6-3, converting five of her nine break points and twice coming back from a break down in the second set. “It was an up-and-down match honestly. A lot of breaks. I mean, I did well in the returning part, considering she’s a big server,” said the 19-year-old. Belgium’s Elise Mertens upset eighth seed Daria Kasatkina 4-6, 6-2, 6-2. After letting a 3-0 advantage slip in the first set, Mertens dominated as Kasatkina struggled physically, needing a medical time-out in the second set. Spain’s Badosa battled to a 7-6 (7/2), 4-6, 6-3 win over Germany’s Laura Siegemund while Russian Anastasia Potapova defeated Ukrainian Marta Kostyuk 6-1, 6-3. Kostyuk, enjoying plenty of support on the small outer court from Ukrainian fans gathered behind national flags, was never able to put her opponent under pressure. There was no handshake from the two players at the end of the game as they left the court without acknowledging each other. Potapova will face Gauff next. Three-times Miami Open winner Victoria Azarenka beat Italy’s Camila Giorgi 6-3, 6-1 to book her place in the third round. In first-round ATP action, big-hitting Czech Jiri Lehecka cruised to a 6-3, 6-4 win over Argentine Federico Coria. Italy’s Lorenzo Sonego ended a run of six straight defeats at Masters 1000 level by defeating Austrian former world number three Dominic Thiem 7-6 (9/7), 6-2. Sonego took a grip on the match by claiming the first four games of the second set taking advantage of a series of unforced errors. “I wanted to be aggressive on the return and I was very aggressive overall. I’ve wanted to play closer to the baseline this year,” Sonego said. “I like to play in Miami because the conditions are really fast.” Chile’s Cristian Garin beat American Marcos Giron 6-4, 2-6, 6-4 and will face Argentine Sebastian Baez next. France’s Richard Gasquet beat Australian lucky loser Christopher O’Connell 6-4, 3-6, 6-1 to set-up a meeting with second-seeded Stefanos Tsitsipas of Greece. World number one Carlos Alcaraz starts his campaign on Friday against Argentine Facundo Bagnis. —AFP","pubDate":"2023-03-24 04:38:21","image_url":null,"id":"deef4d6d-a46b-44b6-9f2d-763def15c526"},{"title":"Aston Villa's dream summer transfer window as Unai Emery priority becomes clear","link":"https://www.birminghammail.co.uk/sport/football/football-news/aston-villas-dream-summer-transfer-26546853","description":"BirminghamLive brings you the latest Aston Villa headlines on Friday, March 24","content":"Here are your headlines... Wrestling, pimping cars - What these Villa stars did next When footballers retire, they tend to pursue careers in coaching or punditry, but some former Aston Villa stars have gone down very different paths. Players are now urged to line themselves up a second career even whilst they are still turning out for their clubs each week to fill the void that football leaves behind. These ten ex-Villa players broke the mould when they retired... READ MORE HERE READ MORE: Everton urged to sign Aston Villa’s John McGinn READ MORE: Villa reveal exciting new ‘terrace’ plan at Villa Park How Emery's starting XI could look next season Nassef Sawiris and Wes Edens plan to give Unai Emery exactly what he needs in the summer to kick-start Aston Villa’s push for European football. The owners were both in the Trinity Road Stand last weekend purring as Emery’s Villa cruised past Bournemouth with elegance and style thanks to goals from Douglas Luiz , Jacob Ramsey and Emiliano Buendia . Sawiris and Edens were sat alongside chief executive Christian Purslow who has already informed supporters that Villa will be “extremely busy” across the summer transfer window. READ MORE HERE Villa's summer transfer priority is now clear Aston Villa manager Unai Emery will be backed with the funds he needs to continue building a squad capable of challenging for European football next season, when the summer transfer window opens in July. The Spaniard has made two additions to the squad of players he inherited from Steven Gerrard in November, with Alex Moreno joining from Real Betis and and Jhon Duran arriving from MLS club Chicago Fire in a deal which could be worth up to £18 million. Both new signings have impressed in their first months at Villa Park, with Moreno appearing to have nailed down his spot at left-back ahead of Lucas Digne, while Duran has made a handful of appearances off the bench and is already causing problems for Premier League centre-backs. Emery has himself made a stunning return to Premier League management with Villa, after taking over the club following a poor start to the league campaign with Gerrard as boss. Under the Liverpool legend, Villa had only won twice in their first 11 games and were heading towards the bottom of the table ahead of the break for the World Cup. READ MORE HERE What happened to Villa players humiliated by Rapid Vienna Unai Emery’s big challenge at Aston Villa is to secure European football. Villa could well achieve it this season should their impressive form continue knowing a win in their next game against Chelsea can put them within just one point of the top seven. Villa will aim for a Europa Conference League slot first before attempting to cement a place in the Europa League , with the Champions League a sincere target for Villa’s ambitious owners. Villa, meanwhile, have been out of Europe since the summer of 2010 when Kevin MacDonald's side were humbled by Rapid Vienna of Austria. Villa drew 1-1 in Vienna as Barry Bannan scored in the 12th-minute. It was back to Villa Park seven days later as interim boss MacDonald named his strongest-possible XI. However, it backfired as Villa were beaten 3-2 having led twice with Rapid winning 4-3 on aggregate. READ MORE HERE How Tim Sherwood tried to sign Jack Grealish for Spurs Former Aston Villa boss Tim Shwerwood has revealed he wanted to sign Jack Grealish for Tottenham Hotspur before he even turned professional. Sherwood managed Grealish at Villa Park and handed the midfielder his Premier League debut in 2015. He took over at Villa after Paul Lambert’s sacking, and helped the club remain in the top-flight, before he was sacked the following season in in the relegation campaign of 2015/16. On talkSPORT , Sherwood explained that he was well aware of Grealish talents before he joined Villa as manager. He even proposed a swap deal to former Spurs boss Harry Redknapp in order to sign him. READ MORE HERE READ NEXT Diego Carlos starts, Alex Moreno experiment - Villa predicted XI vs Bristol Rovers Iroegbunam explains Villa loan lessons ahead of Unai Emery decision Chris Kamara reacts as Soccer AM shelved after three decades on Sky Chelsea expected to welcome back Raheem Sterling and five others for Villa Jack Grealish makes fresh Aston Villa claim after proving Man City point","pubDate":"2023-03-24 04:30:00","image_url":"https://i2-prod.birminghammail.co.uk/sport/football/football-news/article26039023.ece/ALTERNATES/s615/1_JS288786689.jpg","id":"6592fbb6-83b3-4d37-a686-f19a8ef1f642"},{"title":"Chelsea news: Todd Boehly responds to banner backlash as big money signing imminent","link":"https://www.irishmirror.ie/sport/soccer/chelsea-todd-boehly-banner-potter-29536508","description":"The Blues are struggling to turn the tide on what has been a disastrous season so far and appear to be suffering blow after blow in recent months as Todd Boehly addresses the latest drama","content":"Chelsea's season has been a miserable one so far with Graham Potter failing to inspire a significant upturn in fortune for the Blues since his arrival in September. On the contrary, Chelsea currently languish as low as 10th in the Premier League table, one point and one place below local rivals Fulham . Potter's men are way off the pace and well behind the rest of their big-six rivals, with Chelsea an astonishing 31 points behind London rivals and league leaders Arsenal . With that being said, the Blues remain in the race for Champions League glory and are gearing up for a quarter-final meeting with reigning champions Real Madrid next month. Potter will be keeping a keen eye on the international break and hoping none of his stars pick up an injury. Here are three main headlines centred around the Blues on Friday, March 24. Boehly breaks silence Chelsea owner Todd Boehly has broken his silence after the club were criticised for a banner that sits inside Stamford Bridge appeared on Apple TV series Ted Lasso in an altered state. The club after they faced allegations of disrespecting Blues legend Ray Wilkins, who has been remembered at Stamford Bridge with a banner at the stadium that references a quote from club icon Frank Lampard. Chelsea's record goalscorer once said: \"They don't make them like Ray anymore\", a phrase that now sits proudly on the banner. Ted Lasso has utilised a play on words to reference one of the main characters Roy Kent so that it now reads: \"They don't make them like Roy anymore\". Boehly has since issued a response after coming in for criticism as he explained: \"We had nothing to do these arrangements. The deal w/ apple was struck in 1Q/22. \"We are sorry it affected so many and mostly we care about Ray and his family. We would also point out that none of the “Chelsea” players were actual Chelsea players. Hopefully, that was clear.\" Find the full story HERE. Surprise big money signing inbound Chelsea's next expected arrival is looking to make a difference on the pitch, but not in the way you might think. The Blues sacked head groundsman Jason Griffin after three decades at the club as well as his son Reisse. However, they are gearing up to appoint former Real Madrid and Arsenal groundsman Paul Burgess in his place. Burgess is widely considered as the best in his field despite pursuing other interests since his departure from the Spanish capital in 2020. He won rave reviews for the way he kept the Santiago Bernabeu turf in perfect condition and it was a similar story years prior at the Emirates. Now on the verge of a return to London, Burgess will be aiming to achieve a similar level of success at the Bridge. Read the full story HERE. Cucurella's transfer confession Marc Cucurella has admitted he didn't know who British record transfer Enzo Fernandez was and had to google the Argentine before his arrival in January. Speaking to ESPN’s Sports Centre, the Spanish defender said: “I liked to watch matches in which my friends were playing, so I was watching Argentina because of Alexis [MacAllister]. “I think I said, ‘I really like number 24, he’s very good!’ But I didn’t even know where he played! I had to go and search on my phone! As I watched more games, I told my family and friends that I really liked him a lot. And then he came to Chelsea ! “I told Enzo that I had liked him at the World Cup. He’s a good guy, I’m waiting for him to cook me a barbecue.\" Read Cucurella's comments in full HERE.","pubDate":"2023-03-24 04:30:00","image_url":"https://i2-prod.mirror.co.uk/incoming/article29184066.ece/ALTERNATES/s98/2_GettyImages-1244146690-1.jpg","id":"a552812b-34bc-4417-b40c-ac098540d9b3"},{"title":"Birmingham City hero seals shock transfer as major EFL change considered","link":"https://www.birminghammail.co.uk/sport/football/football-news/birmingham-city-hero-seals-shock-26546892","description":"BirminghamLive brings you the latest Birmingham City headlines on Friday, March 24","content":"Here are your headlines... Ben Foster comes out of retirement to seal free transfer Former Birmingham City goalkeeper Ben Foster has come out of retirement and signed for non-league side Wrexham. Foster, who turns 40 at the beginning of April, announced his retirement from football in September after a lengthy career which included spells with Manchester United, Blues, West Bromwich Albion and Watford. But he has decided to don his gloves again in a bid to help Wrexham win the National League title. “I’m over the moon,” said Foster. “I’ve been at the club an hour this morning and it seems a really nice place. Everyone is down to earth and the manager’s top class. READ: Birmingham City’s summer transfer priority has now become clear READ: Eight Blues players who failed to live up to their big transfer billing Blues supporting presenter issues ‘annoying’ Villa verdict A Birmingham City-supporting presenter has begrudgingly lavished praise on Aston Villa and manager Unai Emery. Following Steven Gerrard’s ill-fated reign, Villa looked destined to be involved in a relegation scrap. However, Emery has completely turned their fortunes around, with Villa comfortably in mid-table and with an outside chance of securing European football. Villa maintained their fine form with a comfortable 3-0 win over Bournemouth at the weekend to go into the international break on a high. Following the weekend’s action, presenter and Blues fan Will Brazier joined Ben Foster on the Football Fill-In YouTube show. READ MORE HERE Media giant 'considering' bid for Premier League and EFL rights Apple is reportedly considering bidding for the rights to broadcast English football across all four top divisions. Bloomberg report that the media giant is interested in streaming the Premier League and EFL matches, meaning Aston Villa, Wolves, West Brom and Birmingham City could appear on the Apple TV+ streaming service, the home of popular comedy Ted Lasso, about an American coach in charge of fictional team AFC Richmond. Premier League matches are currently screened across Sky Sports, BT Sport and Amazon Video while Sky hold exclusive rights to live EFL action. READ MORE HERE Onel Hernandez and other free agents for Blues to look at Birmingham City will likely have to delve into the free agent market again this summer. Blues have had to rebuild their squad on the cheap in recent years with free agents, loan deals and low-cost permanent transfers the remit given to technical director Craig Gardner. Gardner is now being supported by the newly-appointed head of recruitment Frank McParland and chief scout Joe Carnall. Speaking at the time of their appointments in February, Gardner said: “I have spoken before about the need to be creative when it comes to recruitment and these appointments ensure fresh impetus and ideas are added to the department.” READ MORE HERE READ NEXT Inside Birmingham City's new £4m training ground after Wast Hills fire Blues takeover: Fresh EFL talks, Jeremy Dale consortium active, accounts due Three John Eustace decisions paid off as Blues found their ‘best solution’ Jeremy Dale, the loan stars who could sign & the player Blues should keep Follow BirminghamLive's Birmingham City coverage","pubDate":"2023-03-24 04:30:00","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article10958238.ece/ALTERNATES/s615/1_BenFosterBluesCarlingCup.jpg","id":"4773f61e-621f-4d6a-bd92-6f6cfd9bda47"},{"title":"WATCH: Siuuuu! Cristiano Ronaldo nets twice on milestone appearance","link":"https://www.iol.co.za/sport/soccer/watch-siuuuu-cristiano-ronaldo-nets-twice-on-milestone-appearance-1a03b5a7-b722-5459-b0fe-0708b7cd13da","description":"Cristiano Ronaldo tucked away a penalty and slammed home a free kick as he set a new record for the most international caps in Portugal's 4-0 win over Liechtenstein in their opening Euro 2024 qualifier.","content":"Lisbon - Cristiano Ronaldo tucked away a penalty and slammed home a free kick as he set a new record for the most international caps in Portugal's 4-0 win over Liechtenstein in their opening Euro 2024 qualifier on Thursday. Ronaldo celebrated his 197th cap, surpassing Kuwait's Bader Al-Mutawa, with a double as he returned to the starting line-up for their Group J qualifier at the Jose Alvalade Stadium. He converted a 51st-minute penalty – his first goal against the tiny Alpine principality – as the home side went 3-0 up and added the fourth with a trademark free kick that bent back the hands of visiting goalkeeper Benjamin Buchel. Joao Cancelo had put Portugal into an eighth-minute lead with a long-range half volley that took a slight deflection through a crowd of players, but Portugal were frustrated by solid defending from the visitors. Seventy seconds into the second half, however, Bernardo Silva picked up a loose ball after Cancelo’s progress to goal was halted and rifled home for a 2-0 lead. ALSO READ: Kylian Mbappe promises not to change after being handed France captaincy Ronaldo, who turned 38 last month, tucked in a penalty after Cancelo had been brought down before his rasping free kick in the 63rd minute extended his record for the most goals in international football to 120. Earlier the Portugal captain, taken off in the 78th minute before he could bag a hat-trick, missed gilt-edged chances when he skied the ball in front of goal and glanced a header wide. ALSO READ: Bafana Bafana coach Hugo Broos happy to have a fully fit Percy Tau at camp Ronaldo had been benched by former coach Fernando Santos for Portugal's final two games at last year's World Cup in Qatar where they lost in the quarter-finals to Morocco. Reuters Share","pubDate":"2023-03-24 04:17:24","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/a551264b-9a36-5859-b70e-0b526c8a3387&operation=CROP&offset=0x185&resize=1765x992","id":"a4015063-f30e-4160-9d0c-ee64aca1630c"},{"title":"Asia Cup to be held in Pakistan with India playing on neutral venue: report","link":"https://www.nation.com.pk/24-Mar-2023/asia-cup-to-be-held-in-pakistan-with-india-playing-on-neutral-venue-report","description":"Asia Cup 2023 is likely to be played in Pakistan with India playing their matches on a neutral venue.","content":"2023 is likely to be played in Pakistan with India playing their matches on a neutral venue. According to a report, the Pakistan Cricket Board (PCB) and Board of Control for Cricket in India (BCCI) are moving “swiftly towards brokering a resolution” to save the Asian event, which will be held in a 50-over format later this year. The option was discussed during a meeting of Asian Cricket Council (ACC) held last weekend in Dubai. PCB representatives, under the leadership of Najam Sethi, met BCCI team comprised its secretary Jay Shah and Arun Dhumal, the IPL governing council chairman, for an informal discussion. During the meeting, it was discussed that Pakistan will host 2023 while India will play their matches on neutral venue. The possibility of India and Pakistan playing three times remains, the report stated. The venues where India could play their matches are likely to be Oman, UAE, England, Sri Lanka and Bangladesh. However, the decision will be taken later. Pakistan will host the 50-over 2023 before the ICC Cricket World Cup in India, scheduled in October and November. A total of 13 matches will be played across 13 days including the final. As per the format for the 2022 , the top two teams from each group advance to the Super 4s and the top two teams then contest the final. Earlier in October, Asian Cricket Council (ACC) President Jay Shah, who is also a BCCI secretary, said that India will not be travelling to Pakistan for the next year, according to a report by Indian media. The development occurred on the day of the BCCI’s annual general meeting in Mumbai, where Asian Cricket Council (ACC) president Jay Shah suggested that the would have to be played at a neutral venue.","pubDate":"2023-03-24 04:14:38","image_url":"https://www.nation.com.pk/digital_images/large/2023-03-24/asia-cup-to-be-held-in-pakistan-with-india-playing-on-neutral-venue-report-1679631252-6814.png","id":"1edd27a2-0bd0-4a4d-abf3-738ee0f145c4"},{"title":"'No Reply From WTA Following Request for Meeting', Says Ukrainian Marta Kostyuk Amid Rising Tensions","link":"https://www.news18.com/sports/no-reply-from-wta-following-request-for-meeting-says-ukrainian-marta-kostyuk-amid-rising-tensions-7371925.html","description":"Kostyuk's compatriot, Lesia Tsurenko, had said earlier this month that the players had asked for a meeting after she pulled out of Indian Wells ahead of a clash with Aryna Sabelenka of Belarus, and Kostyuk revealed the request had so far been ignored","content":"Ukraine’s Marta Kostyuk says the WTA Tour has ignored a request for a meeting with players from the war-torn nation in the latest signs of the conflict-related tensions in women’s tennis. Kostyuk, cheered on by Ukrainian fans seated behind national flags, was beaten by Russian Anastasia Potapova at the Miami Open on Thursday and left the court without shaking the hand of her opponent. Speaking to reporters after the loss, Kostyuk opened up about the frustration she and other Ukrainian players are feeling. Her compatriot, Lesia Tsurenko, had said earlier this month that the players had asked for a meeting after she pulled out of Indian Wells ahead of a clash with Aryna Sabelenka of Belarus. Kostyuk said the request had so far been ignored. ALSO READ| Miami Open: Coco Gauff Breezes Past Rebecca Marino, Jessica Pegula Downs Katherine Sebov “Yes, we wanted to have the meeting with the board and we didn’t get one. No reply, nothing, just silence,\" she told reporters. The WTA did not immediately respond to a request for comment from AFP. Kostyuk said she did not want to go into details about the issues that the players wished to discuss. “I mean, once we’re in the meeting we can talk about it. Before the meeting, I don’t think it’s a good idea to talk about what we want to talk about there,\" she said. Potapova received a formal warning from the WTA after wearing a Spartak Moscow football shirt before a match in Indian Wells and Kostyuk did not appear impressed by that response. “There are a lot of things that I don’t agree with that WTA is doing. This not going to change anything,\" she said. “I’ll just get more hate online. Whatever I say, I will get a lot of hate. I don’t know. Warning, whatever. You give her a warning… You can suspend someone, I don’t know. I can’t comment on that really, it’s just funny,\" she said. Tsurenko’s coach, Nikita Vlasov, has been highly critical of the WTA in comments reported by Ukrainian websites and world number one Iga Swiatek of Poland has called for more to be done. “I feel more should be done to help Ukrainian players because everything we discuss in tennis is about Belarusian and Russian players,\" she said. On Tuesday Sabalenka said she had faced “hate\" in the locker room and suggested she had been in a row with Vlasov. Asked about tensions, the 20-year-old Kostyuk said she had not been involved in any incidents but said there was an obvious reality. “I might not say, ‘Hi,’ to some players, but I never approached anyone, never talked to anyone. Maybe I myself spread hate just by being there,\" she said. “I don’t know what people come up with. Obviously, there is tension, we’re not friends, we’re at war at the moment.\" Kostyuk, ranked 38th in the world, won her first WTA title earlier this month, beating Russian Varvara Gracheva at the ATX Open in Austin. Asked whether she was able to block out thoughts of war when she was on court, Kostyuk said: “It depends on the day. I never know. I can think what I want to think, I can do what I can do, but the moment I step out on the court I don’t know what I’m going to get out of myself,\" she said, adding that she did try to avoid news ahead of games. “I think it’s just healthy to avoid any kind of news because mostly for the past year most of the news I receive are horrible and bad. “I think it’s drowning to just read the news overall no matter what it is about.\" Read all the Latest Sports News here","pubDate":"2023-03-24 04:08:59","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-24t092635.613-16796302383x2.jpg","id":"7d832def-1553-405a-b718-2fc545f634e1"},{"title":"Miami Open: Coco Gauff Breezes Past Rebecca Marino, Jessica Pegula Downs Katherine Sebov","link":"https://www.news18.com/sports/miami-open-coco-gauff-breezes-past-rebecca-marino-jessica-pegula-downs-katherine-sebov-7371799.html","description":"Gauff got the better of Marino in a 6-4, 6-3 win on Thursday to reach the third round in Miami, while Pegula breezed past the challenge of Sebov 6-3, 6-1","content":"Sixth-seeded Coco Gauff opened her 2023 Miami Open with a 6-4, 6-3 victory over Rebecca Marino on Thursday and advanced to the third round where she will face 27th-seeded Anastasia Potapova. After her victory, Gauff, coming off a quarterfinals appearance at Indian Wells, said in a television interview that it wasn’t her best outing, despite converting five of her nine break points. “It was a shaky performance honestly,” Gauff said. “I knew it wasn’t going to be a straightforward match, even if I was up a break sometimes.” ALSO READ| Lionel Messi Nets 800th Career Goal in Argentina’s 2-0 Win Over Panama Gauff came back from a breakdown twice in the second set to claim her second career win versus Marino. Gauff defeated Marino in the first round at Roland Garros in 2022. Gauff said she was a bit nervous playing in her hometown — she’s a native of Delray Beach, Florida, a small city about 40 miles north of Hard Rock Stadium, where the tournament is played. Jimmy Butler of the Miami Heat was among those in attendance Thursday. “Jimmy Butler is here so I was a little bit nervous when I saw him,” Gauff said with a laugh in her post-match interview. “Playing home is something I look forward to, but it’s also a little bit of extra pressure because everyone wants you to do well here.” Gauff’s doubles teammate, world No. 3 Jessica Pegula beat Katherine Sebov 6-3, 6-1 and advanced to the third round. She will face fellow American and No. 30 Danielle Collins next. Collins defeated Viktoriya Tomova on Thursday. Pegula made the Miami Open semifinals in 2022 and is among the favourites to win the tournament this year after No. 1-ranked and defending champion Iga Swiatek pulled out of the tournament because of a rib injury. No. 21 Paula Badosa won 7-6(2), 4-6, 6-2 against Laura Siegemund in a match that lasted two hours and 51 minutes. Badosa will face either Elena Rybakina, who defeated Badosa en route to the Indian Wells title, or Anna Kalinskaya. Badosa hit with a ball kid during the match to stay warm after Siegemund called for a medical timeout and left the court for treatment, which took nearly 15 minutes. In other action, Elise Mertens eliminated No. 8 seed Daria Kasatkina 4-6, 6-2, 6-2 to advance and face No. 29 Petra Martic next; No. 23 Qinwen Zheng picked up a 2-6, 6-1, 6-1 win over Irina-Camelia Begu; and No. 13 seed Beatriz Haddad Maia defeated Tereza Martincová 7-6 (4), 0-6, 6-0. Read all the Latest Sports News here","pubDate":"2023-03-24 03:28:31","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-24t085127.739-16796281573x2.jpg","id":"9860b642-c290-473b-bd9e-4aed0edbe27a"},{"title":"LA Olympics generating excitement, seen as good for city, poll finds","link":"https://www.deseret.com/utah/2023/3/23/23653375/la-olympics-2028-summer-games-poll-salt-lake-2030-2034-bid","description":"Nearly 60% of Los Angeles residents say they’re excited about hosting the 2028 Summer Olympics. Utahns may be even more enthusiastic about bidding for another Winter Games, in 2030 or 2034.","content":"Los Angeles residents are pretty pumped about the 2028 Summer Games.\n\nNearly 60% of Angelenos believe the multibillion-dollar event will be good for their California city, and almost as many say they’re also excited about hosting another Olympics, according to a new Los Angeles Times/Suffolk University poll.\n\nStill, the level of enthusiasm for the Olympics in L.A. falls considerably short of how much support Utahns have shown for bringing another Winter Games to Salt Lake City, either in 2030 or 2034.\n\nA Deseret News/Hinckley Institute of Politics poll of Utahns last month found 82% of the Beehive State’s residents want another Olympics after hosting the 2002 Winter Games — up from 79% when the same question was asked six months earlier.\n\nOf course, the questions asked by the Boston-based Suffolk University for the Los Angeles Times were different. In fact, the question about whether the 2028 Olympics would be good for L.A. spelled out some potential concerns.\n\nThe question noted the 2028 Summer Games have an estimated price tag of nearly $7 billion in private funds, and are expected to “bring thousands of people to the city for a month of events.”\n\nEven so, slightly more than 20% said the Olympics would be bad for Los Angeles, while about 16% said hosting wouldn’t matter to their city, 5% are undecided and 1% refused to answer. The rest, just over 57%, see the Games as good for where they live.\n\nA similar number said they’re excited about hosting, including 27% who labeled themselves “very excited,” compared to about a quarter who said they’re “not at all excited,” and just over 15% who are not very excited.\n\nMatthew Burbank, a University of Utah political science professor who’s written books about the Olympics, didn’t expect to see that much support for the Summer Games in Los Angeles.\n\n“I’m actually surprised that at this point, it’s that high,” Burbank said, adding “the very fact that you have that many people in the city of Los Angeles saying that they’re excited or that they think it’s going to be a good thing, I think it’s not too bad.”\n\nLos Angeles hosted two previous Summer Games, in 1932 and 1980, and had been trying for a third for years when the International Olympic Committee decided six years ago to award both the 2024 and 2028 Summer Games at the same time.\n\nThe 2024 Summer Games went to Paris, and Los Angeles ended up with several extra years to prepare for 2028. Burbank said L.A. organizers have done little yet to promote the upcoming Olympics to the public.\n\n“In all honesty, the Games have been almost under the radar there because they were picked early and because the organizing committee has really gone out of its way not to attract a lot of attention,” he said.\n\nUnlike Los Angeles, Salt Lake City is still waiting to hear if another Olympics is coming. After postponing a pick last December, the IOC is likely to name the hosts of both the 2030 and 2034 Winter Games some time next year.\n\nSix places have expressed interest in hosting a Winter Games — Sapporo, Japan; Vancouver, Canada; a yet to be determined city in Sweden; and two contenders the IOC has declined to name, possibly including a so-called “European super bid.”\n\nBurbank said support for hosting an Olympics tends to be higher during the bid process, when “it’s all happy talk, all the time.” But the professor said Utahns seem to be “much more positive” about the Games.\n\n“There’s a general sense of goodwill towards the Olympics. People thought the last Games were successful,” he said. “There’s this residual sense among lots of Utahns, ‘Oh, yeah, that was a good thing and that we benefited from it.’ That’s a big part of what’s driving opinion.”\n\nGiven that underlying sentiment, Burbank said even if Salt Lake City gets another Games, he doesn’t expect public opinion to change dramatically.\n\nThat may already be happening in Los Angeles, though. The Los Angeles Times reported its new poll shows “support for hosting the massive sports event remains widespread, although it may have begun to dip.”\n\nPrevious polls conducted since L.A. was awarded the Games found 76% to 83% approval for hosting, according to the newspaper, but noted those surveyed county and even regional residents, too.\n\nThe latest poll, which also covered a wide range of other topics, was conducted March 9-12 of 500 people living in the city of Los Angeles and has a margin of error of plus or minus 4.4 percentage points.\n\nThe Sports Examiner, a California-based Olympic newsletter, pointed out there was more support in the poll for hosting the Summer Games than for L.A. “as a place to live.” Less than half of the Angelenos surveyed rated their hometown as excellent or even good.\n\n","pubDate":"2023-03-24 02:43:16","image_url":"https://deseret.brightspotcdn.com/dims4/default/7d4568c/2147483647/strip/true/crop/3507x2002+0+239/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2Fc85DUKku1nSKSELhoEqyA7SRXZY%3D%2F0x0%3A3507x2480%2F3507x2480%2Ffilters%3Afocal%281754x1240%3A1755x1241%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F24531264%2FAP753876098100.jpg","id":"a4f65af1-67b0-4b15-bf66-2cc5c93e6d93"},{"title":"The oldest, complete Hebrew Bible is up for auction — for $50 million","link":"https://www.deseret.com/faith/2023/2/17/23594492/oldest-hebrew-bible-sothebys-auction","description":"This manuscript is expected to be sold for the highest amount of money that any document has ever been sold for when it’s auctioned off on May 16. What is the Codex Sassoon?","content":"David Solomon Sassoon was the owner of one of the most impressive private collections of Hebrew manuscripts. Among his manuscripts was an early and complete Hebrew Bible, which was called the Codex Sassoon after him.\n\nNow this manuscript, which is called “the earliest, most complete Hebrew Bible,” is up for auction at Sotheby’s. This document is expected to be sold for the highest amount of money that any document has ever been sold for when it’s auctioned off on May 16 — up to $50 million.\n\nSassoon knew the Hebrew Bible “practically by heart,” per Sotheby’s. He was both a religious man and a successful scholar who was learned in ancient languages and contributed much to Jewish studies. The crowning jewel of his collection — Codex Sassoon — has brought him into public consciousness.\n\nThis manuscript is immensely valuable to Biblical scholars and the general public because of the capacity it has to illuminate history. As a text, the Hebrew Bible is utilized by the Abrahamic faiths and has been significantly influential. With a manuscript like the Codex Sassoon, light could be shed on additional mysteries. Textual changes and variations can be understood in a different way and a manuscript’s provenance — the record of transmission — tells us something about how texts were used.\n\nIn the world of Hebrew Bible manuscripts, there are three that are worth mentioning for context here: the Dead Sea Scrolls, the Aleppo Codex and the Leningrad Codex.\n\nWhat are the Dead Sea Scrolls?\n\nWhen the Dead Sea Scrolls were discovered, it was something of a watershed moment for Biblical studies. They were found at the Qumran caves, which are in the desert of the West Bank, near the shores of the Dead Sea. The site itself is an enigma. Theories have circulated about the site ranging from a mysterious desert religious community (an offshoot from the Essenes) keeping these texts nearby to Jewish people fearing the destruction of their holy texts and hiding them in the desert. Scholars traditionally favored the former view, but it remains disputed while some modern scholars favor the latter view or a different theory.\n\nAround 230 Biblical scrolls were found, according to the Leon Levy Dead Seas Scrolls Digital Library. They were found starting in 1947 and are dated to third century B.C. up through first century A.D., before the destruction of the temple in 70 A.D.. The scrolls are written in Hebrew, Greek and Aramaic, and are partial or extant (extant is the term text scholars use that means complete) copies of books in the Bible.\n\nThese manuscripts are hugely important, not only because of the text itself, but also because of the way they can be used to better understand Biblical history and the language of Hebrew itself. Studies on Isaiah changed significantly due to the Dead Sea Scrolls.\n\nWhat is the Aleppo Codex?\n\nThe Aleppo Codex was written by scribes in Tiberias, Israel likely around 930 A.D. and is considered an important, early copy of the Hebrew Bible.\n\nNamed after where it remained for half a century (Aleppo, Syria), the Biblical Archaeology Society said that even though the Dead Sea Scrolls are older than this codex, this codex contains vowels and notes in the margins about the text. Having vowels in the text helps resolve some ambiguities about vocabulary and meaning while the marginal notations offer insight. It’s important to note that Biblical Hebrew does not use vowels traditionally.\n\nThis manuscript was scribed by Masoretes and punctuated by Aaron ben Asher. Masoretes is a general term that refers to Jewish scribes who were involved in what’s now known as the Masoretic Text, which is considered the authoritative text of the Hebrew Bible. They were in a school of thought that believed it’s imperative to try and reconstruct an authoritative version of the Hebrew Bible. The Masoretic text aligns quite well with the Dead Seas Scrolls, although there are some variants.\n\nScribes used manuscripts available to them and oral tradition to create this text. Oral tradition was critically important in ancient cultures, as production of texts was expensive and literacy rates were lower. The Hebrew Bible was transmitted orally as well.\n\nIn comparison to the Aleppo Codex, the Codex Sassoon was dated slightly later, originally to the 10th century, according to The New York Times. Carbon dating was done recently that confirmed the possibility of the Codex Sassoon actually being earlier than the Aleppo Codex and possibly the earliest extant manuscript. It’s also possible that the Codex Sassoon was written at around the same time as the Aleppo Codex.\n\nWhat is the Leningrad Codex?\n\nThe Leningrad Codex was written around 1010 A.D. (it’s sometimes dated a couple years earlier), according to the West Semitic Research Project. This manuscript is also one of the texts that is considered part of the Masoretic texts.\n\nOne of the most authoritative Hebrew Bible editions “Biblia Hebraica Stuttgartensia” uses the Leningrad Codex as the basis. Previously, the Leningrad Codex was the oldest, extant manuscript of the Hebrew Bible. CBS News said that the Codex Sassoon is now considered older than the Leningrad Codex.\n\nAs mentioned earlier, carbon dating led to this determination of the text being slightly older than the Leningrad Codex (older by a century). While carbon dating is generally reliable, its accuracy typically is understood to be in terms of decades. It doesn’t provide an exact date, instead providing a date range, which is how the Codex Sassoon was determined to be slightly older than the Leningrad Codex.\n\nWhy should we care about the Codex Sassoon?\n\nAs the oldest extant (minus a couple leaves) manuscript of the Hebrew Bible, the Codex Sassoon holds an important place in our history and culture.\n\nIt’s important to remember that for hundreds of years, people couldn’t read the text themselves. Oral tradition was many people’s main way of accessing the text and it is because of that oral tradition along with smaller manuscripts that the Hebrew Bible exists in extant form today.\n\nWhile we can pull out our phones and have access to dozens of translations of the Hebrew Bible in a whole slew of languages, this modern democratization of the text is only possible due to its preservation.\n\nAnd the price tag on the Codex Sassoon represents all that the text really means.","pubDate":"2023-03-24 02:40:01","image_url":"https://deseret.brightspotcdn.com/dims4/default/8b85484/2147483647/strip/true/crop/5129x2928+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FaXP4jDqZuPn0lN8cExV_NujZebA%3D%2F0x0%3A5129x3419%2F5129x3419%2Ffilters%3Afocal%282542x1235%3A2543x1236%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F24441033%2FAP23046575534435__1_.jpg","id":"97237434-c026-4ec7-a4fd-a6b9b9346b12"},{"title":"Lionel Messi Nets 800th Career Goal in Argentina's 2-0 Win Over Panama","link":"https://www.news18.com/football/lionel-messi-nets-800th-career-goal-in-argentinas-2-0-win-over-panama-7371601.html","description":"Seven-time Ballon d'Or winner, Messi, scored a stunning free-kick in the closing minutes came after 21-year-old Thiago Almada gave the world champions the lead in the 78th minute in their win over Panama at the Monumental","content":"Lionel Messi capped a night of unbridled joy with the 800th goal of his career as world champions Argentina celebrated their homecoming with a 2-0 friendly victory over stubborn Panama in Buenos Aires on Thursday. The 35-year-old seven-time Ballon d’Or winner’s stunning free-kick in the dying minutes came after 21-year-old MLS sensation Thiago Almada gave a glimpse of what the future holds with his first goal for the national team in only his third appearance. It was an emotional night as fireworks crackled overhead before kick-off at the impressive Monumental stadium where the 83,000 lucky fans that managed to get tickets among the more than 1.5 million people who tried, created an atmosphere that produced goosebumps. ALSO READ| UEFA Euro 2024 Qualifying: England Beat Italy, Portugal Rout Liechtenstein as Records Tumble Messi, coach Lionel Scaloni and numerous players came onto the pitch with their children and several seemed on the brink of tears as fans in unison sung Argentina’s World Cup anthem. It was clear that this was more a celebration than a football match but Panama clearly had not read the script. Despite fielding a weakened side, they were organized and disciplined and managed to frustrate the new world champions for 78 minutes before their defences were finally breached. Argentina, who started the game playing champagne football, created relatively little given their 73 per cent possession in the first period. Messi struck the woodwork with a freekick while Enzo Fernandez brought a diving one-handed save out of goalkeeper Jose Carlos Guerra with a shot from distance. Scaloni had picked the same starting XI that faced France in the World Cup final in December — when Argentina triumphed 4-2 on penalties after a sensational 3-3 draw — but after a goalless first half, he made three changes. In the second period, Argentina knuckled down to trying to win a football match but Guerra was twice equal to Messi’s free-kicks and also saved a low curling effort from veteran Angel Di Maria. As the minutes ticked by, the tension rose with Argentina acutely aware that their party risked falling flat if they did not win. But, eventually, their main man came to the fore and ensured Panama would not be party poopers. Messi had a hand in the opening goal, crashing another free-kick off the woodwork, with Almada, a second-half substitute, following up to slot home. The stadium erupted and the tension drained from Argentina’s players, by now mostly substitutes. With a minute to go, Messi was given yet another free-kick within shooting range — his fifth of the match — and this time he curled it into the top corner to seal the dream scenario for his delirious fans. Read all the Latest Sports News here","pubDate":"2023-03-24 02:33:55","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-24t080021.135-16796250593x2.jpg","id":"4dc2f026-ae99-4781-a658-89451ccabdc8"},{"title":"Where are the highest cases of distracted driving in Utah?","link":"https://www.deseret.com/utah/2023/3/23/23653843/distracted-driving-cases-rising-utah","description":"The Provo and Orem area has among the highest rates of distracted driving accidents in the state, said Orem Police spokesman Lt. Nick Thomas.","content":"The Provo and Orem area has among the highest rates of distracted driving accidents in the state, said Orem Police spokesman Lt. Nick Thomas.\n\nThe Utah Highway Safety Office recorded 1,128 car accidents caused by distracted driving in Utah County in 2021, including 622 injuries and two deaths. There were a total of 5,484 distracted driving accidents in the state of Utah in 2021.\n\n\"You look down at your phone, and that is as bad as drunk driving,\" said Thomas. \"A lot of the accidents we see here in town are accidents that could be prevented by people not being on their phones.\"\n\nOrem and Provo police are increasing their distracted driving enforcement to lower the amount of local car accidents, they announced in a Facebook post last week. Their efforts will likely extend through the summer, with periodic evaluations to adjust their patrolling methods.\n\n\"The number of accidents involving distracted drivers has increased over the last several years in the Orem and Provo area,\" the post said. \"Please remember to keep your hands on the steering wheel and eyes on the road while you are driving, removing all distractions you can.\"\n\nThe Utah Department of Health says that a car crash occurs in Utah every eight minutes, and a person is injured in a crash every 20 minutes.\n\nThomas implored drivers to exercise self-control against distracted driving.\n\n\"Wait until you get somewhere safer to answer the phone,\" Thomas said. \"If it's that important, pull over to the side of the road and take your phone call or return your text message, but most things can wait until you're at your next destination.\"\n\nLeslee’s story\n\n\"Are you precious to someone?\" That's what Provo resident Kaye Nelson asks when she rolls up at a stoplight next to someone who is texting while driving.\n\nShe tells drivers, \"Then you need to put your phone away and not look at it while you're driving.\"\n\nNelson's passion for distraction-free driving came after her longtime friends David and Leslee Henson were hit by a texting driver.\n\nOn March 4, 2013, the Hensons were on a walk along Dixie Drive in St. George. Carla Brennan was texting on her way to work and speeding at 60 mph in a 40-mph zone, according to investigators. She rear-ended another car, which veered out of control and onto the sidewalk, hitting the Hensons.\n\nDavid Henson pushed his wife out of the way, Nelson said. He was killed on impact.\n\nLeslee Henson was flown to Utah Valley Hospital in Provo, where her head trauma was treated with more than 5,000 stitches and staples. She had also sustained back and neck fractures and was put in a neck brace.\n\nLeslee Henson receives 5,000 stitches and staples after being hit by a distracted driver on March 4, 2013. Distracted driving accidents are on the rise in Provo and Orem. Family photo\n\n\"She had a scar that started in the corner of one eye and went all the way to the back of her head,\" Nelson said. \"She had gravel in her scalp, and they had to shave her head, and her eyes were black. Her head was basically like a watermelon that had been dropped and split open.\"\n\nAfter her recovery, Leslee Henson spent the next 10 years speaking out against distracted driving. She gave presentations about distracted driving at BYU, local high schools, drivers ed classes and public safety meetings before dying from breast and liver cancer on Feb. 20.\n\nHenson also worked closely with Rep. Carol Moss, D-Holladay, to promote legislation against distracted driving.\n\nCurrent Utah laws make it illegal to use your phone while on the road but allow drivers to use hands-free devices, such as those with Bluetooth connectivity. Moss's distracted driving bill, HB336, would have enforced stricter consequences for distracted driving.\n\n\"My bills have all had the same intent — to make holding a phone and talking or texting a primary offense,\" Moss said. \"What good is a law if it can't be enforced unless you break another law, especially when it comes to driving, when an accident can cause serious injuries or death?\"\n\nMoss's urgency comes from knowing that the sooner legislation is passed, the sooner tragedies like the Hensons' can be prevented.\n\n\"I remind people that it took 10 years to make the seat belt law a primary offense,\" Moss said. \"How many lives were lost in those 10 years?\"\n\nBut Moss's bill was not prioritized in the most recent legislative session, and it died in committee on March 3.\n\nNelson said she saw a disconnect between legislators' words and actions.\n\n\"We would talk to a lot of legislators who would be very adamant that 'Oh yes, we need (to be) hands-free,' and they tell us stories about 'I was on the freeway and somebody was texting and they rear-ended me,'\" Nelson said. \"But when it came down to it, they voted against it.\"\n\nMoss expressed a similar frustration.\n\n\"It is discouraging when both the majority leader, Mike Schultz, and Rules Chair Rep. Casey Snider wouldn't even let the bill go to a committee for a hearing,\" Moss said.\n\nNelson said she and Leslee Henson's daughter Haley Warner are adamant about continuing Leslee's work in future legislative sessions.\n\n\"We'll keep working at it,\" Nelson said. \"It's going to save many, many lives.\"\n\n","pubDate":"2023-03-24 02:30:00","image_url":"https://deseret.brightspotcdn.com/dims4/default/c98fb66/2147483647/strip/true/crop/2962x1691+19+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FM0O50J0_oXf3gvdp2mo48V0QZa8%3D%2F0x0%3A3000x1691%2F3000x1691%2Ffilters%3Afocal%281500x846%3A1501x847%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F24369498%2Fmerlin_2949513.jpg","id":"c5f3c676-1ee1-476e-abe7-1d6d49975e1f"},{"title":"We’re good to go—Marinica","link":"https://mwnation.com/were-good-to-go-marinica/","description":"Malawi National Football Team coach Mario Marinica says tonight’s 2023 Africa Cup of Nations (Afcon) Group D qualifier between the Flames and Egypt’s Pharaohs is a 50-50 affair. The two sides clash in the first leg of a double header at the Air Defence Stadium in Cairo before the second leg slated for Bingu National","content":"Listen\n\nMalawi National Football Team coach Mario Marinica says tonight’s 2023 Africa Cup of Nations (Afcon) Group D qualifier between the Flames and Egypt’s Pharaohs is a 50-50 affair.\n\nThe two sides clash in the first leg of a double header at the Air Defence Stadium in Cairo before the second leg slated for Bingu National Stadium in Lilongwe on Tuesday.\n\nThe Romanian tactician said much as he is aware that Egypt, led by Liverpool marksman Mohammed Salah, is a star studded outfit, both sides go into the match with equal chances.\n\nMarinica said: “Like before with Senegal, Morocco or other teams we faced, we believe as the game starts, there are 50-50 chances. We want to defend chance to finish the game with good results for us.”\n\nThe coach, who had earlier exressed reservations with the late kickoff at 9pm, said despite the challenges he faced during the preparations, the Flames are ready for the match.\n\nMalawi and Egypt in a previous match\n\nMarinica said: “I could say that we are ready and good to go for the game. Our preparations by large were good.\n\n“The preparations could have been better, but we talked about that before in terms of having the players in camp for more time to increase chances of getting them fitter.\n\n“At the same time, it could have been better if the players played several matches for their clubs. But that’s the situation. We are prepared. We will adapt and we are ready to face a strong squad like Egypt.”\n\nMarinica’s squad looks slightly different from the one that lost 1-0 to Guinea in Conakry in the last 2023 Afcon qualifier in June.\n\nThe squad comprises goalkeeper Charles Thom, defenders: Stanley Sanudi, Chembezi Dennis, Anthony Lungu, Gomezgani Chirwa and Lawrence Chaziya. There are also midfielders John CJ Banda, Chimwemwe Idana, Charles Petro, Micium Mhone and Yamikani Chester as well as strikers Frank Gabadinho Mhango, Khuda Myaba and Stain Davie.\n\nNew faces in this qualifier are Frank Willard, Patrick Mwaungulu, Miracle Gabeya and Kelvin Kadzinje while regulars Mark Fodya, Peter Banda and Brighton Munthali are returning to the squad, having missed the last assignment.\n\nThe Pharaohs, on the other hand, have a full squad led by skipper Salah and other foreign-based players Emam Ashour (FC Midtjylland, Denmark), Ahmed Hassan Kouka (Alanyaspor, Turkey), Mostafa Mohamed (FC Nantes, France), Omar Marmoush (VfL Wolfsburg, Germany) and Ahmed Hegaz (Ittihad Jeddah, Saudi Arabia).\n\nOn his part, captain CJ Banda said the match is crucial for the Flames as they aim for back-to-back Afcon qualification.\n\nHe said: “Egypt is a good team. But they are beatable. Every player knows how important the game is. We just have to remain focused. If we win or draw here, it means as we go home, psychologically we will have an upper hand.”\n\nSoccer analyst Charles Nyirenda said he agrees with Marinica that the match is a 50-50 affair.\n\nHe said: “History will tell you that Egypt have never been a threat to us. We just have to get our tactics right.”\n\nThe two sides have faced each other 10 times since 1978. Egypt have won five of the matches while Malawi won three of them. The other two ended in draws.","pubDate":"2023-03-24 02:05:00","image_url":"https://mwnation.com/wp-content/uploads/2023/03/match.jpg","id":"832ada39-75d7-467d-b3a3-b7d1e91511fd"},{"title":"UEFA Euro 2024 Qualifying: England Beat Italy, Portugal Rout Liechtenstein as Records Tumble","link":"https://www.news18.com/football/uefa-euro-2024-qualifying-england-beat-italy-portugal-rout-liechtenstein-as-records-tumble-7371511.html","description":"England avenged their Euro 2020 title match defeat with a 2-1 win over Italy. Declan Rice and Harry Kane found the back of the net as the English skipper became the nation's outright top scorer in international football, while Cristiano Ronaldo netted twice on his record 197th appearance for Portugal in their 4-0 win over Liechtenstein","content":"It was a record-breaking night for Cristiano Ronaldo and Harry Kane as qualifying for the European Championship in 2024 got underway on Thursday. Already the leading scorer in men’s international soccer, the 38-year-old Ronaldo now has more international appearances than any other male player after racking up No. 197 in Portugal’s 4-0 win over Liechtenstein. The former Real Madrid and Manchester United striker marked the occasion by converting a penalty and adding another second-half goal — a powerful free kick from the edge of the area — to move onto 120 in international matches. Kane, meanwhile, became England’s outright leading scorer of all time by netting a first-half penalty in a 2-1 win at Italy. It lifted Kane to 54 goals for his country, one more than Wayne Rooney. Qualifying for Euro 2024, which will take place in Germany, started three months after the World Cup finished. ALSO READ| Harry Kane Breaks England All-Time Goal Record With Italy Strike, Surpasses Wayne Rooney BELATED REVENGE Call it belated revenge for England. The meeting with Italy in Naples was a repeat of the Euro 2020 final won by the Azzurri at Wembley Stadium. The teams have met since then — twice, in fact, with Italy gaining a win and a draw in Nations League qualifying last year. This time, England held on after first-half goals by Declan Rice and Kane, who tucked away a spot kick awarded following a VAR review after it was determined that Italy defender Giovanni Di Lorenzo touched the ball with his hand while attempting to prevent Kane from reaching a corner. Kane had missed his last penalty attempt for his country, late in the 2-1 loss to France in the World Cup quarterfinals last year. “It had to be a penalty, of course,” a smiling Kane said of his record goal. Argentina-born forward Mateo Retegui, who has Italian citizenship through his maternal grandmother, pulled a goal back on his debut and England played with 10 men from the 80th after left-back Luke Shaw collected two yellow cards in the space of 54 seconds. Italy lost to England in a competitive match for the first time since a World Cup qualifier at Wembley back in 1977. It was a disappointing way for the Azzurri to start their latest qualifying campaign for a major tournament, having failed to get into the last two World Cups. “We might be starting with an uphill struggle this time,\" Italy coach Roberto Mancini said, “but let’s hope we end it better.” North Macedonia beat Malta 2-1 in the other match in Group C, which also contains Ukraine. EASY FOR PORTUGAL Roberto Martinez enjoyed a comfortable start to his tenure as Portugal coach after handing Ronaldo a start against Liechtenstein. The striker was left out of Portugal’s knockout-stage matches at the World Cup but was selected up front alongside Joao Felix — and repaid the faith shown in him by Martinez, who left his role as Belgium after the tournament in Qatar. Joao Cancelo and Bernardo Silva scored before Ronaldo’s double in Lisbon. “It’s a new cycle,\" Martinez said. “It is very important that a player shows commitment and that he can use his experience. Cristiano has that: A lot of experience and a lot of commitment to the national team.” Also in Group J, Bosnia-Herzegovina beat Iceland 3-0, while Slovakia and Luxembourg drew 0-0. ALSO READ| Cristiano Ronaldo Breaks All-Time Men’s International Caps Record POIGNANT AT PARKEN There was a sense of poignancy when Denmark and Finland met for their opening Group H qualifier at Parken Stadium in Copenhagen. The last time the teams met was at Euro 2020 and it was the game — and same venue — when Denmark playmaker Christian Eriksen collapsed with cardiac arrest. Nearly two years later, Denmark won 3-1 thanks to a hat trick from striker Rasmus Hojlund in his first start for his country. Slovenia beat Kazakhstan 2-1 and Northern Ireland defeated San Marino 2-0. RUSSIA FRIENDLY For the first time since the country’s invasion of Ukraine, Russia played a soccer match against a nation from outside the borders of the old Soviet Union. A 1-1 draw with Iran in Tehran was played in front of 78,000 spectators and comes after months of Russia seeking closer ties with the Asian Football Confederation. Russia is banned by UEFA from competing in qualifying for Euro 2024. Both goals came from the penalty spot. Iran striker Mehdi Taremi canceled out the opener by Anton Miranchuk, one of those selected in an entirely Russia-based squad. Russia has previously played Kyrgyzstan, winning 2-1, along with 0-0s against Uzbekistan and Tajikistan. Read all the Latest Sports News here","pubDate":"2023-03-24 01:57:43","image_url":"https://images.news18.com/ibnlive/uploads/2023/03/copy-of-sports-2023-03-24t072023.053-16796226453x2.jpg","id":"74094652-f20b-4733-bf2c-240ee899efb3"},{"title":"France looks to AI-powered surveillance to secure Olympics","link":"https://cyprus-mail.com/2023/03/23/france-looks-to-ai-powered-surveillance-to-secure-olympics/","description":"France’s National Assembly on Thursday approved the use of Artificial Intelligence (AI) video surveillance during the 2024 Paris Olympics, overlooking warnings from civil rights groups that the technology posed a threat to civil liberties. The government says algorithmic video surveillance can detect “pre-determined events”, abnormal behaviour and crowd surges, helping...","content":"France’s National Assembly on Thursday approved the use of Artificial Intelligence (AI) video surveillance during the 2024 Paris Olympics, overlooking warnings from civil rights groups that the technology posed a threat to civil liberties. The government says algorithmic video surveillance can detect “pre-determined events”, abnormal behaviour and crowd surges, helping ensure the safety of millions of tourists who are expected to flood the French capital next summer. With favourable preliminary votes in the Senate and Assembly, the biggest legislative hurdles have been cleared, though it could be challenged at the highest constitutional court. If formally adopted, France would become the first country in the European Union to legalise AI-powered surveillance. That would be setting a worrying surveillance precedent, a group of several dozen European lawmakers said last week. Justifying the technology, Stephane Mazars, an MP with President Emmanuel Macron’s Renaissance party, said “in front of the whole world, France will need to rise to the meet the greatest security challenge in its history.” The plan to deploy AI surveillance has met strong resistance from rights groups such as Amnesty International and digital rights groups. They argue the technology poses a threat to civil freedoms and draws a dangerous line in the sand. The text was voted by a margin of 59-17 in favour, in the 577-seat chamber. The debate in France comes the European Union is discussing its own AI Act, a landmark piece of EU legislation governing the use of artificial intelligence in Europe that has been in the works for over two years. Apart from uses of AI by companies, the EU legislation will also look at AI used in public sector and law enforcement. France’s privacy watchdog, CNIL, is backing the French government’s bill on the condition that no biometric data is treated. Proponents of the bill say this is the case, but privacy specialists are sceptical. “You can do two things: object detection or analysis of human behaviour – the latter is the processing of biometric data,” said Daniel Leufer, policy advisor at digital rights organisation Access Now, which is advocating for the banning of biometric data collection in public spaces in the EU’s AI Act. Ruling party lawmaker Sacha Houlie, who chairs parliament’s Committee on Legal Affairs, told the lower house that AI could have helped prevent the 2016 Nice attack by identifying the movements of a truck used to plough through a crowd as suspicious. The technology could also have helped avert the crowd chaos at the Champions League Final in Paris last year, he said. Both the Senate and Assembly have now approved the bill text. A joint-chamber committee will seek compromise on any differences in the Access Now’s Leufer questioned the utility of AI in spotting would-be attackers because of the complexities in training algorithms on rare incidents. “AI is not good at that type of thing (because) on a technical level, you have to give a machine loads of examples,” he said.","pubDate":"2023-03-23 19:58:14","image_url":null,"id":"af3acab0-b9f1-4cbb-845c-57c4ff299516"},{"title":"News24.com | Despite England's woes, Premiership Rugby chief says ban on picking overseas players will stay","link":"https://www.news24.com/sport/Rugby/despite-englands-woes-premiership-rugby-chief-says-ban-on-picking-overseas-players-will-stay-20230323","description":"England's policy of refusing to select overseas-based players for international duty is set to remain, according to Premiership Rugby chief executive Simon Massie-Taylor.","content":"England's policy of refusing to select overseas-based players for international duty is set to remain, according to Premiership Rugby chief executive Simon Massie-Taylor. The aim of the approach is to ensure the country's leading stars remain at home, strengthening the Premiership and giving the England head coach greater control over his players. Jack Willis, however, was selected during the recent Six Nations under an \"exceptional circumstance\" clause after the flanker joined French giants Toulouse following the financial collapse of Wasps. England coach Steve Borthwick has called for an easing of the policy so he can select the \"best players available\", with several Test players, including hooker Luke Cowan-Dickie, lock David Ribbans and centre Joe Marchant all having signed to play for clubs in France's Top 14 from next season. But the new Professional Game Agreement that will take effect from July 2024 is set to be unchanged in this regard. \"From the RFU's (Rugby Football Union's), ours and even the players' perspective we all see the importance of England internationals playing domestically,\" Massie-Taylor told Britain's PA news agency. \"Provisions exist for exceptional circumstances that will probably still carry on going forward, but we all agree England international players should be playing in the Premiership.\" Saracens coach Mark McCall has urged the RFU to follow the example of other countries by bringing in central contracts for England players. Clubs are increasingly concerned that players they develop will end up spending large chunks of the season on England duty. Premiership clubs are operating in a precarious financial environment -- Worcester and Wasps were kicked out of the English top flight after going bust earlier this season. Massie-Taylor said the existing system has \"worked pretty well\" but added there were discussions about how it could be improved. But he acknowledged the financial pressures clubs were facing. \"That's clearly in quite a fragile state at the moment so we need to have a discussion around sharing more risk and around England stars as well,\" he said.","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"6dc61b0f-fdc4-40d6-bea4-c607cea3ffd8"},{"title":"News24.com | Trans women banned from female athletics, Semenya's career hits another stumbling block","link":"https://www.news24.com/sport/OtherSport/Athletics/world-athletics-set-to-tighten-dsd-transgender-rules-20230323","description":"World Athletics has tightened rules governing the participation of transgender women in female competition.","content":"Transgender women will no longer be allowed to compete in female track and field events regardless of their levels of testosterone, World Athletics president Sebastian Coe said Thursday, citing fairness over inclusion. Coe said no female transgender athlete who had gone through male puberty would be permitted to compete in female world ranking competitions from 31 March. Speaking after a meeting of the global track and field federation's decision-making body, Coe said World Athletics had consulted with stakeholders, including 40 national federations, the International Olympic Committee and trans groups about the issue of transgender athletes. The new ruling places a further hurdle in front of South Africa's double Olympic 800m gold medallist Caster Semenya and her career. Semenya, now 32, won gold at the London 2012 and Rio 2016 Olympics and has been at the forefront of the debate and legislation around intersex athletes competing at an elite level. Semenya has been engaged in a legal battle since 2019 over a ruling that dictated she takes medication to suppress her testosterone levels to compete in her preferred distances between 400m and 1 500m, and this latest move from World Athletics makes that fight even more difficult. \"The majority of those consulted stated that transgender athletes should not be competing in the female category,\" said Coe. \"Many believe there is insufficient evidence that trans women do not retain advantage over biological women and want more evidence that any physical advantages have been ameliorated before they are willing to consider an option for inclusion into the female category.\" He added: \"The judgement we took... was, I believe, in the best interests of our sport. He said a working group headed by a transgender person would be created to further monitor scientific developments. \"We're not saying 'no' forever,\" Coe said. \"Decisions are always difficult when they involve conflicting needs and rights between different groups, but we continue to take the view that we must maintain fairness for female athletes above all other considerations. \"We will be guided in this by the science around physical performance and male advantage which will inevitably develop over the coming years. As more evidence becomes available, we will review our position, but we believe the integrity of the female category in athletics is paramount.\" In a statement, World Athletics said it became apparent that there \"little support within the sport\" for an option that was presented to stakeholders, which required transgender athletes to maintain their testosterone levels below 2.5nmol/L (nanomoles per litre of blood) for 24 months to be eligible to compete internationally in the female category. \"There are currently no transgender athletes competing internationally in athletics and consequently no athletics-specific evidence of the impact these athletes would have on the fairness of female competition in athletics. \"In these circumstances, the Council decided to prioritise fairness and the integrity of the female competition before inclusion.\" World Athletics also amended regulations covering athletes classified as DSD, in other words having \"differences of sexual development\". Under the new regulations, in order to compete in the female category, DSD athletes will have to reduce their amount of blood testosterone to below 2.5 nanomoles per litre, down from the current level of five, and remain below this threshold for two years, rather than just one, as is the case now. World Athletics also removed the principle of restricted events for DSD athletes, meaning regulations now cover all events rather than the previously monitored ones, which were from 400m to one mile. .","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"50f69bdc-68c6-4591-9f27-2baf80a1ef7e"},{"title":"News24.com | Captain Markram primed to lead Proteas: 'I've had my eye on Aiden for a very long time'","link":"https://www.news24.com/sport/Cricket/Proteas/captain-markram-primed-to-lead-proteas-ive-had-my-eye-on-aiden-for-a-very-long-time-20230323","description":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram.","content":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram. READ | World Cup fate: Proteas seniors must stay at the wheel as Dutch date with destiny looms Markram, who captained the Proteas on Tuesday in a four-wicket win over the West Indies to level the ODI series 1-1, captains South Africa in the three-match T20 series against the same opponents that starts on Saturday. Speaking to reporters on Thursday, Walter acknowledged that Markram, who also captained the SA U19 side to World Cup glory in 2014 and the Sunrisers Eastern Cape to the inaugural SA20 title earlier this year, had done a fine job in Temba Bavuma's absence during the third ODI. \"It wasn't a clincher. I've had my eye on Aiden for a very long time from a leadership point of view and have watched him go about his work,\" said Walter. \"I thought he did a very good job, and it's not surprising. I'm fully aware of his leadership capabilities, and I thought he marshalled the troops quite nicely. \"He made some good tactical decisions around bowling changes, which was good to see, so I'm just looking for more of the same,\" Walter added. The Proteas limited-overs mentor confirmed there were other reasons why Markram was given the captain's armband of the T20 side. \"Part of Aiden's appointment is also looking forward and understanding where he is in his cricketing cycle and how many years he'll hopefully be dedicating to the Proteas.\" \"I think the SA20 gave us a glimpse into his style and his ability from a leadership point of view, so I don't think we'll see anything different from that.\"","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"c4acd0d0-0451-483e-b345-e3ba9a854949"},{"title":"News24.com | Man United owners await revised offers for Premier League giants","link":"https://www.news24.com/sport/Soccer/EnglishPremiership/man-united-owners-await-revised-offers-for-premier-league-giants-20230323","description":"Manchester United's owners were awaiting fresh bids Thursday from a Qatari banker and British billionaire Jim Ratcliffe after a deadline passed for revised offers to buy the Premier League giants.","content":"Manchester United's owners were awaiting fresh bids Thursday from a Qatari banker and British billionaire Jim Ratcliffe after a deadline passed for revised offers to buy the Premier League giants. Reports said bidders were initially told they had until 21:00 GMT on Wednesday to submit new offers, but that has now been extended. It is unclear when the new cut-off will be. Sheikh Jassim Bin Hamad Bin Jassim Bin Jaber AI Thani, the chairman of Qatar Islamic Bank, and Ratcliffe, the founder of chemicals giant INEOS, remain the front runners should the American Glazer family, who own United, give up control of the club. Finnish entrepreneur Thomas Zilliacus threw his hat into the ring on Thursday with a bid he said will give fans the chance to own 50 percent of the club. \"My bid is built on equality with the fans,\" Zilliacus, founder and chairman of investment company Mobile FutureWorks, said in a statement. \"My group will finance half of the sum needed to take over the club and will ask the fans, through a new company that is being set up for this specific purpose, to participate for the other half.\" The Glazers have angered many United supporters by saddling the club with huge debts since they took over in 2005. They appeared ready to cash out at an enormous profit when they invited external investment in November. However, they could yet shun the option of selling a controlling stake in the club, with other parties understood to be interested in a minority shareholding. The Times reported US hedge fund Elliott Investment Management, which sold AC Milan for $1.3 billion last year, had made a bid to buy a minority stake. A first round of bidding took place last month, and it has been reported there are as many as eight separate potential investors in the club. The BBC said several other proposed investors made their submissions by the Wednesday deadline. No figures have been revealed, but one or more of the initial bids was understood to be in the region of 4.5 billion ($5.5 billion). That would make Manchester United -- who have not won the Premier League for a decade -- the most expensive sports club in history, although it would be short of the 6 billion valuation reportedly placed on the Old Trafford side by the Glazers. Sheikh Jassim is bidding for 100 percent control, aiming to return the club to its \"former glories\". A source close to Sheikh Jassim's bid told AFP he remains confident his bid is \"the best for the club, fans and local community\". Ratcliffe, a boyhood United fan, wants to buy the combined Glazer shareholding of 69 percent of the 20-time English champions. The 70-year-old told the Wall Street Journal this week he was not interested in paying \"stupid prices\" for one of football's most iconic clubs. Ratcliffe, who already owns French club Nice, said his interest in United would be \"purely in winning things\", calling the club a \"community asset\" rather than a financial one. He visited Old Trafford last week along with INEOS representatives, a day after a delegation from Sheikh Jassim's group toured the club's stadium and training ground. A Qatari purchase of United would boost the sporting profile of the Gulf state months after it hosted the 2022 World Cup, but it would also be controversial. Sheikh Jassim is the son of a former Qatari prime minister, raising concerns over the potential growth of state influence in the Premier League. Reigning Premier League champions Manchester City's fortunes have been transformed since a takeover from Sheikh Mansour, a member of Abu Dhabi's ruling family, in 2008. In 2021, the Saudi sovereign wealth fund bought a controlling stake in Newcastle. Amnesty International has called on the Premier League to tighten ownership rules to ensure they are \"not an opportunity for more sportswashing\". If Sheikh Jassim's bid succeeds, it would also raise the question of whether Qatar is shifting its attention away from Paris Saint-Germain -- currently home to the trio of Lionel Messi, Neymar and Kylian Mbappe -- who were bought by Qatari investors in 2011. United, three-time European champions, have not won the Premier League since Alex Ferguson led them to a 20th English title in his final season before retiring in 2013. But they are enjoying a renaissance under Erik ten Hag's management this season and ended a six-year trophy drought by lifting the League Cup last month.","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"00565430-a382-4093-a492-c20a262e1634"},{"title":"News24.com | Stormers thinning in backline personnel but not potency ahead of Leinster clash","link":"https://www.news24.com/sport/Rugby/UnitedRugbyChampionship/stormers-thinning-in-backline-personnel-but-not-potency-ahead-of-leinster-clash-20230323","description":"Head coach John Dobson admitted the Stormers were thinning in the backline but they’d try to bring their bravado against Leinster on Friday night.","content":"Stormers head coach John Dobson admitted his team is looking thinner than they’d like in the backline after Ruhan Nel’s absence for family reasons and injuries to Angelo Davids and Sacha Feinberg-Mngomezulu. The long-term absence of wing Leolin Zas, who is nearing a return, has also hurt them at outside back, forcing breakthrough youngster Suleiman Hartzenberg to play wing instead of outside centre as planned. Dobson had prepared to have Hartzenberg front Leinster on Friday night in Dublin in the 13 jersey, but Davids going down in the Currie Cup against the Lions flipped plans upside down. READ | Bringing back the big guns: Springbok stars return as Stormers brace for unbeaten Leinster The flip side is that Seabelo Senatla is fit to start and Springbok Damian Willemse will slot into No 12 alongside Dan du Plessis (13), with the usual suspects Manie Libbok and Clayton Blommetjies pulling strings from flyhalf and fullback, respectively. \"We’ve not had the room to manoeuvre in the backs that we’d like to, even in the Currie Cup,\" said Dobson. \"Sacha’s injury changed things for us a little bit. Ruhan not being available, then we lost Angelo Davids and Zas is not quite back; we hope to have him back very soon but he wasn’t going to be ready for this. \"I think that put us under a bit more pressure in the outside backs. Without Zas and Angelo, Suleiman pretty much has to play wing and that means we have to find another 13. \"We had prepared this game for Suleiman to play 13 until Angelo hurt himself at Ellis Park, so that left no choice but Suleiman back to the wing. \"The better plan was to move Dan across than pull [Juan de Jongh] up from the Currie Cup. We’re a little thinner there because Ruhan is one of our 'ysters ' over the last little while, so it’s a pity to miss him. \"No team in this competition has been or will be at full strength. There’s Zas, Evan Roos and a couple of the locks (Salmaan Moerat and Adré Smith).\" The Stormers, though, will \"go for it\" against unbeaten United Rugby Championship (URC) log-leaders Leinster. The hosts are 15/15 this season and look set to finish top of the tree again this year but face the defending champions at home for the first time. Kick-off is at 21:35 (SA time). Stormers team: 15 Clayton Blommetjies, 14 Suleiman Hartzenberg, 13 Dan du Plessis, 12 Damian Willemse, 11 Seabelo Senatla, 10 Manie Libbok, 9 Paul de Wet, 8 Hacjivah Dayimani, 7 Ben-Jason Dixon, 6 Deon Fourie, 5 Marvin Orie, 4 Ruben van Heerden, 3 Frans Malherbe, 2 Joseph Dweba, 1 Steven Kitshoff (captain) Substitutes: 16 JJ Kotze, 17 Brok Harris, 18 Neethling Fouche, 19 Ernst van Rhyn, 20 Willie Engelbrecht, 21 Marcel Theunissen, 22 Herschel Jantjies, 23 Jean-Luc du Plessis","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"c69f9ff7-62a0-4927-8ab4-8c88810aeaee"},{"title":"Italy 0-0 England LIVE! Euro 2024 qualifier match stream, latest score and goal updates today","link":"https://www.standard.co.uk/sport/football/italy-vs-england-live-stream-euro-2024-qualifier-latest-score-result-watch-tv-team-news-b1069537.html","description":"Italy vs England LIVE!","content":"vs LIVE! qualification gets underway for the two favourites in Group C as the Three Lions travel to looking to avenge their heartbreak in the last Euros final. The lifted the trophy on a dramatic night at and now must defend their crown despite having missed out on a spot at the winter World Cup. is tonight as he looks to return Italy to winning ways against a side they have enjoyed plenty of success over. but should perhaps be considered favourites with a star-studded team that has genuine ambition to go all the way and win the Euros. It all starts here with Italy vs England live right here on Standard Sport, where you can follow every kick as well as expert analysis from Dan Kilpatrick at the Stadio Diego Armando Maradona. For the second time, Kane has the chance to break England’s all-time scoring record from the penalty spot... HARRY KANE BREAKS THE RECORD! The referee points to the spot! To the monitor! Di Lorenzo clearly handles it as Kane backs off, this should only be going one way. Big penalty appeal from Kane as he heads a deep corner back across goal - just how England created the opener. VAR has a look before we restart... Grealish denied a foul as Italy break and Stones blocks Retegui’s effort. Back tracks Saka to disrupt Spinazzola’s effort, winning a goal kick in the process. All rather comfortable for the Three Lions as Italy’s support raise the volume to try and get them back into it. Saka combines with Kane on the right but he’s crowded out - and England recollect the ball anway. It was billed as a 4-3-3 for England but Bellingham is very much the advanced midfielder ahead of Phillips and Rice. The visitors press high and it’s Phillips stealing in before having a go from 20 yards out... only just wide! Now Rice is booked for walking towards a free-kick and then turning away, in an apparent spot of timewasting. A superb tackle from Rice shuts down Barrella’s shooting opportunity from the D - Italy’s first proper foray forward for some time. Grealish wins a free-kick to kill the Azzurri’s momentum.","pubDate":"2023-03-23 19:45:30","image_url":"https://static.standard.co.uk/2023/03/23/19/newFile-1.jpg?width=1200&auto=webp","id":"7e4a84d8-b93e-45fc-b779-376c8bd46b0c"},{"title":"News24.com | 'It's the Percy I know': Back to his old self, says beaming Broos before crucial Afcon qualifier","link":"https://www.news24.com/sport/Soccer/BafanaBafana/its-the-percy-i-know-back-to-his-old-self-says-beaming-broos-before-crucial-afcon-qualifier-20230323","description":"Bafana Bafana head coach Hugo Broos smiled with pleasure when he spoke about Percy Tau, who is back to his old self of scoring and assisting in goals ahead of the Afcon qualifier against Liberia.","content":"Bafana Bafana head coach Hugo Broos smiled with pleasure when he spoke about Percy Tau, who, according to the Belgian mentor, is back to his old self of scoring and assisting in goals. The 28-year-old is part of Broos's 23-man squad that will take on Liberia in two crucial Africa Cup of Nation qualifiers on Friday at 18:00 at Orlando Stadium and away in Monrovia on Tuesday, 28 March, also at 18:00 (SA time). \"Last year, it was like he had 50kg on every leg,\" Broos told reporters in Johannesburg on Thursday. \"So, now you see he's fresh. It is the Percy that I like and that I know from Belgium,\" he said of the former Brighton signing who also earned himself European stints with Club Brugge and Anderlecht before he signed with Egyptian club Al Ahly in 2021. \"This is maybe the first time since I've been here that I see that,\" Broos continued. \"In the beginning [of my Bafana contract], my first games for qualifiers for World Cup, it was Percy on 50% or maybe less with all the injuries he got. \"But now, he recovered. He plays all the games [for his club], and you see what that does with a player like Percy's [quality]. So, I'm very happy with him.\" The Al Ahly attacker has had his fair share of spells on the sidelines in the past 24 months, nurturing knocks and playing when not fit. The former Mamelodi Sundowns ace netted during back-to-back league games in early December for the Red Devils before a torn muscle kept Tau in the doctor's office again. That medical episode was the turning point after a nearly two-month break from getting himself back to full fitness. After a late return in January and earning much-needed minutes in his legs again, Tau slowly began to soar again. The forward netted against his old club, the Brazilians, in Al Ahly's CAF Champions League Group A defeat at Loftus Stadium earlier in March, before inspiring the Egyptian giants past Cameroon's Coton Sport last weekend. \"I think Percy, little by little, is again to his best level for me. Certainly, against Sundowns he was the best player of his team. \"He is fresh again. I see it also in training. He is feeling good for the moment, and it's normal. He is also decisive. \"He scored here against Sundowns. He scored against Coton Sport and had a few assists. So, he's confident.\" However, Broos would not show his hand ahead of the matchday deadline, as he laughed and then shrugged off the notion that Tau would start against Liberia in Soweto on Friday. With three qualifiers remaining, winning both matches against the West Africans would mean that Bafana don't have to win their final Group K qualifier at home against Morocco.","pubDate":"2023-03-23 19:37:54","image_url":"https://scripts.24.co.za/img/sites/sport24.png","id":"bd5f43da-c2cf-4f69-b166-943fc60e0dbd"},{"title":"Antonio Conte stays away as Tottenham lose behind-closed-doors friendly","link":"https://www.standard.co.uk/sport/football/antonio-conte-tottenham-friendly-training-ipswich-b1069575.html","description":"Tottenham this afternoon lost a behind-closed-doors friendly to Ipswich Town, which under-fire head coach Antonio Conte skipped.","content":"this afternoon lost a behind-closed-doors friendly to , which under-fire head coach skipped. With Conte remaining in Italy, having flown out on Monday to spend time with his family as planned, assistant manager Cristian Stellini and coach took charge of the match. As few first-team players are still at Hotspur Way this week, due to international commitments, the squad largely consisted of Under-21s players. However, Spurs captain Hugo Lloris did play as he steps up his return from injury. Ipswich Town, who ply their trade in League One, boasted more senior players and won 3-2 at Spurs' training ground in a 70-minute game. Ipswich manager Kieran McKenna spent seven years in Spurs' academy before being forced to retire from playing. He then spent time as Under-18s coach at the club. SPONSORED Conte is widely expected to be sacked during the international break, with Mason touted as a possible interim option for the final 10 games of the season. Spurs are next in action on Monday, April 3 at Everton.","pubDate":"2023-03-23 19:32:33","image_url":"https://static.standard.co.uk/2023/02/19/19/newFile-3.jpg?width=1200&auto=webp","id":"732601d2-17bb-4925-aa67-2eacceb71f3d"},{"title":"World athletics’ bombshell transgender move","link":"https://www.cairnspost.com.au/sport/world-athletics-makes-bombshell-transgender-move/news-story/1c370b5584dbd8b32841c80a1012426a","description":"Transgender women will no longer be allowed to compete in female track and field events regardless of their levels of testosterone, World Athletics president Sebastian Coe said Friday.","content":"Don't miss out on the headlines from Sport. Followed categories will be added to My News.\n\nTransgender women will no longer be allowed to compete in female track and field events regardless of their levels of testosterone, World Athletics president Sebastian Coe said Friday.\n\nSpeaking after a meeting of the global track and field federation’s decision-making body, Coe sad: “The Council has agreed to exclude male or female transgender athletes who have been through male puberty from female world ranking competitions from March the 31st this year.”\n\nCoe said World Athletics had consulted with stakeholders including the International Olympic Committee and national federations about the issue of transgender athletes.\n\n“The majority of those consulted stated that transgender athletes should not be competing in the female category,” he said.\n\nSebastian Coe, president of World Athletics. (Photo by Alex Pantling/Getty Images)\n\n“Many believe there is insufficient evidence that trans women do not retain advantage over biological women and want more evidence that any physical advantages have been ameliorated before they are willing to consider an option for inclusion into the female category.”\n\nHe added: “The judgement we took … was, I believe, in the best interests of our sport.\n\n“We’re not saying ‘no’ forever,” he said, adding that a working group headed by a transgender person would be created to further monitor scientific developments.\n\nThe decision has divided opinion.\n\nFair Play For Women, a UK-based body which says its aim is to “defend the sex-based rights of women and girls”, welcomed the move.\n\n“This is a reversal of their unfair testosterone suppression policy and makes good on Coe’s commitment to protect female sport,” it tweeted.\n\nBut LGBTQ+ rights organisation Stonewall labelled it “disappointing”.\n\n“It is so disappointing to see World Athletics announce a unilateral ban on trans women in track and field events,” Stonewall tweeted.\n\n“Their own statement recognises that there are no trans women competing at an international level and that they have no specific evidence to justify the ban.”\n\nAthletes compete in the Women's 100m Hurdles Final at the Tokyo 2020 Olympic Games. (Photo by Ezra Shaw/Getty Images)\n\nCoe conceded the decision was difficult.\n\n“Decisions are always difficult when they involve conflicting needs and rights between different groups, but we continue to take the view that we must maintain fairness for female athletes above all other considerations,” he said.\n\n“We will be guided in this by the science around physical performance and male advantage which will inevitably develop over the coming years. As more evidence becomes available, we will review our position, but we believe the integrity of the female category in athletics is paramount.”\n\nWorld Athletics’ stance is similar to the position swimming’s world governing body FINA took earlier this year.\n\nSwimming also restricted the participation of male-to-female transgender athletes, ruling they must have completed their transition before the age of 12 to be able to compete at the highest levels.\n\n— with AFP\n\nOriginally published as World Athletics makes bombshell transgender move","pubDate":"2023-03-23 19:02:00","image_url":"https://content.api.news/v3/images/bin/83affc0846087559093847643f75c74c","id":"03622e6f-4d56-4077-84bd-3e4b23de86f4"},{"title":"Martin Zubimendi Oo Sharaxay Sababtii Uu Isaga Diiday Arsenal Suuqii January.","link":"https://kooxda.com/2023/03/23/martin-zubimendi-oo-sharaxay-sababtii-uu-isaga-diiday-arsenal-suuqii-january/","description":"Martin Zubimendi ayaa daaha ka qaaday inuu iska di","content":"Martin Zubimendi ayaa daaha ka qaaday inuu iska diiday u dhaqaaqista Arsenal suuqii january sabab la xidhiidha in ayna macquul ahayn in uu ka tago Real Sociedad bartamaha xilli ciyaareedka. Hogaamiyayaasha Premier League ayaa aad u doonayay in ay xoojiyaan khadka dhexe suuqii January waxana ay bartilmaameed ka dhigteen xiddiga reer Spain iyaga oo diyaar u ahaa in ay bixiyaan lacagta lagu bur-burinayay heshiiska xiddiga. Gunners ayaa xitaa dalab Rasmi ah oo dhan 52.8 milyan ka gudbisay saxiixa xiddiga 24 jirka ah si ay u helaan saxiixiisa. Laakiin xiddiga ayaa iska diiday waxana uu doorbiday in uu sii joogo kooxdiisa inta ka dhiman xilli ciyaareedkan. Markii la weydiiyay sababta uu u diiday Arsenal, waxa uu u sheegay Sport:”sababtoo ah waxaan u sheegay Tababarahayga in aanan doonayn in aan Real Sociedad ka tago bartamaha xilli ciyaareedka, gaar ahaan marka la eego xilli ciyaareedka fiican ee aan ku jirno, Halkan aad ayaan ugu faraxsanahay”.","pubDate":"2023-03-23 17:28:35","image_url":"https://i0.wp.com/kooxda.com/wp-content/uploads/2023/03/image_2023-03-23_045610798.png?fit=540%2C355&ssl=1","id":"290ce3fd-6e17-46bc-b042-ec7fbcc88b0a"},{"title":"Marcus Rashford Oo Joojiyay Wadahadaladii Heshiiska Cusub Ee Man United, Sabab.","link":"https://kooxda.com/2023/03/23/marcus-rashford-oo-joojiyay-wadahadaladii-heshiiska-cusub-ee-man-united-sabab/","description":"Marcus Rashford ayaa joojiyay wadahadalada qandara","content":"Marcus Rashford ayaa joojiyay wadahadalada qandaraaska cusub ee Man United, sbab la xidhiidha in uu doonayo in uu ogaado cida ay noqon doonaan miliilayaasha cusub ee kooxda. United oo haatan suuqa taala ayaa doonaysa in ay heshiis cusub ka saxiixato Rashford oo heshiiskiisa haatan dhici doono dhamaadka xilli ciyaareedka dambe. Kadib qaab ciyaareed cajiib ah oo uu soo bandhigay, Rashford ayaa dhaliyay 27 gool 44 kulan oo uu ciyaaray tartamada oo dhan. Rashford oo 25 sano jir ah ayaa la filayaa in uu saxiixo heshiiskii ugu weynaa xirfadiisa ciyaareed. Si kasta ha ahaatee wargayska The Sun ayaa sheegaya in uu xiddigu joojiyay wadahadaladii uu kula jiray kooxda ilaa inta laga ogaanayo Milkiilayaasha cusub ee kooxda. Man United ayaa haatan lala xidhiidhinayaa maal qabeenka Qatar ah iyo waliba Ninka ugu taajirsan dalka UK.","pubDate":"2023-03-23 16:00:53","image_url":"https://i0.wp.com/kooxda.com/wp-content/uploads/2023/03/image_2023-03-23_185539626.png?fit=636%2C382&ssl=1","id":"d0f24ca3-0afb-4826-9ca3-47d773787baf"},{"content":"Kiwi trainer Ben Foote finds an odd solace in Babylon Berlin’s nemesis Imperatriz having followed her to Melbourne for tonight’s A$1 million William Reid Stakes at The Valley. The speedy mares have dominated the major northern sprints this summer, Imperatriz winning the Railway and BCD Sprint at Te Rapa, with Babylon Berlin second in both. Tonight they try for an elusive and incredibly valuable Australian Group 1 sprint win in the same 1200m race, where expat Kiwi mare Roch ‘N’ Horse is seeking her third Australian major sprint victory. The form of Roch ‘N’ Horse, Levante and even Imperatriz, second in the Canterbury Stakes in Sydney last start, is the most consistent Group 1 sprint form by New Zealand campaigners in years, and Foote says Imperatriz’s form and price for tonight’s race boosts his confidence with Babylon Berlin. Advertisement Advertise with NZME. “When you see Imperatriz is favourite for this race, it actually gives me some confidence because we have been very competitive with her over 1200m back home,” said Foote from Melbourne. “She [Babylon Berlin] has arrived here and settled in great shape and she is really ready to go.” Foote is happy with barrier two but realistic enough to know it may not be a case of Babylon Berlin cruising to the lead as she often does in New Zealand, as the biggest sprints at The Valley can be super aggressive early. “There are some real flyers in there but I am still confident she will settle in the first three and get her chance.” Advertisement Advertise with NZME. While the William Reid (11.15pm) is a serious race with an enormous windfall for any mare who can win it, Foote and the Imperatriz camp have picked the right Group 1 to target, because with the TJ Smith on at Randwick next week many of Australia’s best sprinters are heading to Sydney. The Kiwi invasion on that Sydney carnival has already started and intensifies tomorrow as Prowess will start favourite in the A$600,000 Vinery Stud Stakes for three-year-old fillies while NZ Derby placegetter Full Of Sincerity heads the market for the A$250,000 Tulloch Stakes. He is using the race as a lead-up to next week’s ATC Derby in which Full Of Sincerity will be joined by Sharp ‘N’ Smart, Andalus and Mark Twain, so the first four home in the New Zealand Derby will tackle the Sydney equivalent. Prowess’ trainer Roger James says he couldn’t be happier with the filly coming off her weight-for-age win against the older horses in the Bonecrusher at Pukekohe, and isn’t too concerned by forecast rain. “If the track does get wet I think she will handle it,” says James. “She really hasn’t turned a hair since she has arrived here and couldn’t be in better shape. “I’d say she is at least as good as when she won last start and from barrier three I think she can stay handy.” Although James isn’t concerned by a wet track, all of Prowess’ three-year-old form has been on top of the ground, while key rivals tomorrow in Pavitra and last season’s Golden Slipper winner Fireburn have Group 1 wet track form, so would appear to be more advantaged than the New Zealand filly should the track get wet. Save share Share this article facebook copy link twitter linkedin reddit email","description":"The speedy mares have dominated the major northern sprints this summer.","id":"8e82c261-8775-4b59-a4ee-17e999122650","image_url":"https://www.nzherald.co.nz/resizer/JhXFAJpiIq0q4ljc2skpeGh7jsQ=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/FGR6NOOHCZCDJPMFAMFYAKTSHU.jpg","link":"https://www.nzherald.co.nz/sport/racing-imperatriz-boosts-confidence-in-babylon-berlin/KELUWNPDNNF35B5SK6P3ZELNNY/","pubDate":"2023-03-23 16:00:00","title":"Racing: Imperatriz boosts confidence in Babylon Berlin"},{"content":"New Zealand’s unluckiest barrier draw horse had to secure a good draw one day and Merlin has found the perfect race to finally get some luck. That luck makes him the horse to beat in tonight’s $135,000 Northern Derby at Alexandra Park. The Derby is the highlight of Auckland’s biggest harness racing meeting in months, with four other group races, including the Northern Oaks. The Oaks feature will more than likely be dominated by unbeaten filly Millwood Nike. Advertisement Advertise with NZME. The Derby looked far more open after Sherlock won the major lead-up last Friday, suggesting he has closed the gap on Merlin, but that gap may have reopened after the barrier draw. Merlin will start from barrier two while key rivals Sherlock and Son Of Mac face second-line draws, and remarkably it is the first time in 13 starts Merlin has drawn inside barrier five. To make matters worse, often when he has drawn barriers five or six it has been in small fields, so he has been on the outside of the front line. Three times he has drawn barrier eight and on three others the second line. So to finally get a good draw is great news for Merlin, but bad news for Sherlock and Son Of Mac. Advertisement Advertise with NZME. Driver Zachary Butcher says the draw means he doesn’t have to think too much. “It is about time we got a good draw and I am confident we can lead and then have options,” says Butcher. “One of those could be to hand up to Sooner The Better and take a trail but we could even stay in front because I know our horse will be better for the run last week.” Taking the shortest way home, Merlin should win the Derby and Sooner The Better looms as the best place bet, even though Sherlock gets stronger with every run and could still prevail if the Derby gets turned upside down early. The Oaks looks a benefit for Millwood Nike, not only because she is better than her opponents but because Kahlua Flybye is scratched and Advance Party has a wide draw. Trainers Barry Purdon and Scott Phelan will dominate the two-year-old races before the big boys of pacing get together for the first time in 2023 in the City Of Auckland Free-For-All. Copy That, Self Assured, Akuta, Old Town Road and rising speedster Nicholas Cage are already guaranteed spots in the $1 million The Race at Cambridge on April 14 and with that in mind tonight’s race could be devoid of aggression after the early burn. Copy That looks the most likely leader and therefore the most likely winner, with the connections of many of the other favourites suggesting tonight won’t be the night they go looking to make a statement. Three Alex Park picks Best: Merlin (R7, No 2): Looks his Derby to lose from the draw, even if early value is gone. Next best: Copy That (R9, No 2): Looks back to something like his best and could be the leader in a race lacking pressure. Advertisement Advertise with NZME. Class act: Double Delight (R3, No 7): Even off 25m she is better off here than in recent races in which she has produced two huge seconds. Save share Share this article facebook copy link twitter linkedin reddit email","description":"Derby driver Butcher has options for big race: ‘It is about time we got a good draw’.","id":"b2a34fc1-594f-4403-bf1b-ad9cc91fce52","image_url":"https://www.nzherald.co.nz/resizer/uVcGN0LQ_iutBn2g4NEX1erEWtw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/LWPQU6D3KWJUQWWYEA35N3ZKAA.jpg","link":"https://www.nzherald.co.nz/sport/racing-luck-of-the-draw-at-last-for-merlin/SGWOKNS5KBFS3HE3F3XHNYBSAI/","pubDate":"2023-03-23 16:00:00","title":"Racing: Luck of the draw at last for Merlin"},{"content":"Article content James Peter wants to share his life story, the path he’s taken, with coaches and football evaluators at this week’s CFL Combine in Edmonton. Article content One of more than 60 of Canada’s top prospects who will participate in testing, skills events, practices and interviews over the next few days, Peter wants people to know about the adversity he’s faced, where he came from and how it shaped who he is. Peter, a first-team all-Canadian linebacker with the University of Ottawa Gee-Gees (he had 58 tackles, three tackles for loss and two forced fumbles last season) , lived in Ottawa’s west end, in the low-income Ramsey Cr. area, until he was six or seven. It’s a tough area, with people in the community looking after each other as best they can. Peter’s family then moved to Barrhaven and he played football for the Nepean (Eagles), Myers Riders, Ottawa Sooners and at Mother Theresa High School before landing at uOttawa, where he became a team leader on and off the field. Article content Article content “I want people to learn who I am, I want them to get my back story,” said Peter. “Nothing means more than the origin and the journey. I would like coaches to get to know me. I want them to know James Peter, outside of the football aspect. Then when it comes to football, for them, it’s like ‘Oh, now it makes so much sense, this kid had this upbringing and it translates to football. You can see it by the way he plays.’ “I observe a lot, I learn. I try not to make the mistakes others make. Seeing what people went through in Ramsey made me a better person. Article content “I’ve gone through some traumatic experiences. When you face those experiences, it can make you a more resilient football player where you’re able to overcome anything.” Trauma? In 2017, a Gee-Gees teammate, defensive lineman Loic Kayembe, died in his sleep at the age of 24. Four years later, another teammate, defensive lineman Francis Perron, died suddenly after a game in Toronto. Two teammates, part of the brotherhood, were gone. So suddenly. It was heartbreaking. Article content Peter is one of 10 prospects at the CFL Combine with Ottawa connections. The others: Gee-Gees linebackers Emmanuel Aboagye-Gyan and Max Charbonneau, receivers Willy-Pierre Dimbongi and Daniel Oladejo and quarterback Ben Maracle (an underclassman), UBC defensive lineman Lake Korte-Moore, U of Toronto defensive back Tolu Ahmed, Queen’s receiver Richard Burton and St. FX receiver Zakariya Karim. When he was younger, Peter, who also played running back, had to battle the perception he was too small to play football. “I got that a lot,’ he said. “I was told I was too short. The height was the biggest thing; it caused me to lose some playing time with my community team. Being small, the athleticism and speed were the biggest things I had to offer. I had to make sure I could go sideline to sideline and play anywhere. It put a chip on my shoulder, being told I couldn’t play football, that football wasn’t my path, that it wasn’t for me.” Article content At 5-foot-9, 223 lbs., he packs plenty of punch, along with a lot of talent. Listed as 16th on the latest CFL Central Scouting Bureau rankings, he plays the game of football with plenty of aggression. “I love hitting people,” he said. “It’s not that I don’t like blocking, but if I wasn’t getting the ball and had to block nine out of 10 times, I’d be kind of frustrated. As a linebacker, nine out of 10 times I can run downhill and smoke somebody. I play with passion, I play with heart. I find people don’t take you seriously until they really get smacked in the mouth.” Peter is listed as a weakside linebacker, but he believes he can play any of the three positions in the second row of the defence; so he’s hoping to show evaluators this week he can also line up in the middle or on the strongside. Article content Said Peter: “I think I can play them all well. I want to make it hard for CFL coaches so they start thinking, ‘Where do we put him?’ ” The turning point for Peter came a couple of years back, when everything came to a near standstill during the early stages of the pandemic. “I wondered to myself, ‘Is this something I really want to do? Yes? OK, you need to put everything into it.’ I know I can compete at the highest level, I know I can play with the best players. I’ve been waiting for this moment, I’m ready to showcase what I can do and prove to everybody I deserve to be here.” With an opportunity to prove himself, to validate what’s he done on and off the football field for years, as a player and as a person, Peter knows what’s at stake this week. While others have left Ottawa and found success elsewhere before moving on to play professional football, Peter is proud of what he’s done in his home town. Article content “I look at it like I’m representing Ottawa,” he said. “You can stay here. Some kids feel like they have to leave and make a name for themselves somewhere else. You can stay, you can be the hometown hero.” While the CFL Draft is less than six weeks away (May 2), Peter will soak everything in during the days leading in. “It’s not like I look forward to getting it over with, I don’t want it to fly by too fast,” he said. ” I’m enjoying the experience, I’m not trying to rush out of it. It’s like my mom’s name – Patience. I feel like her name is Patience for a reason; everything in life, you need to be patient. I’ll be patient with this process and soak it in.”","description":"Article content James Peter wants to share his lif","id":"e4114254-99a3-4279-bde3-fe47ec62b762","link":"https://ottawasun.com/sports/football/cfl/incredible-journey-ggs-hard-hitting-james-peter-looking-to-impress-at-cfl-combine","pubDate":"2023-03-23 15:25:23","title":"INCREDIBLE JOURNEY: GGs' hard-hitting James Peter looking to impress at CFL Combine"},{"title":"Ja Morant 'Grateful' For Support From Memphis Crowd In First Game Back","link":"https://basketball.realgm.com/wiretap/270893/Ja-Morant-Grateful-For-Support-From-Memphis-Crowd-In-First-Game-Back","description":"Ja Morant played in his first game since receiving an eight-game suspension on Wednesday. Morant came off the bench and checked in with 3:05 left in the first quarter. The Memphis Grizzlies' crowd cheered loudly for Morant when he brought the ball up the court for the first time and again after his first basket. \"It meant a lot, man,\" said Morant. \"Obviously, I'm thankful and grateful for everybody who's been supporting me during this time. It definitely helped me a lot, definitely made me feel a little better. Eased everything that was going on. Felt good to be back. Super excited. Glad we was able to get the win.\" Morant said he meditated before the game to attempt to calm his nerves.","content":"Ja Morant played in his first game since receiving an eight-game suspension on Wednesday. Morant came off the bench and checked in with 3:05 left in the first quarter. The Memphis Grizzlies' crowd cheered loudly for Morant when he brought the ball up the court for the first time and again after his first basket. \"It meant a lot, man,\" said Morant. \"Obviously, I'm thankful and grateful for everybody who's been supporting me during this time. It definitely helped me a lot, definitely made me feel a little better. Eased everything that was going on. Felt good to be back. Super excited. Glad we was able to get the win.\" Morant said he meditated before the game to attempt to calm his nerves.","pubDate":"2023-03-23 15:12:08","image_url":"https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Morant_Ja_mem_230311.jpg","id":"f5547e40-205b-47e3-ba58-fee25b374b3f"},{"content":"Bayern Munich ayaa lagu soo waramayaa in ay ka wal-walsantahay qaab ciyaareedka xiddiga Sadio Mane iyaga oo aaminsan in uuna xiddigu xitaa awoodiisa ku soo bandhigayn taabbarka. Weeraryahanka ayaa loo arkayay in uu yahay mid wax weyn ku soo kordhin doono kooxda xagaagii markii uu kaga soo biiray Liverpool. Xiddiga ayaan wali wax gool ah u dhalin kooxda Bayern Munich waxana uu ku dhibaatoonayaa in uu soo bandhigo qaab ciyaareedkii uu ku soo bandhigay Liverpool. Sida laga soo xigtay wargayska Sport1, Bayern Munich ayaa haatan ka wal-walasan qaab ciyaareedka xiddiga iyaga oo aaminsan in xiddiga 30 jirka ah uuna noqon sidii ay moodayeen. Mane ayaa Bayern Munich ku biiray isaga oo ka mid ah xiddigaha ugu fiican kubada cagta una tartamay abaalmarinaha ugu kubada cagta xilli ciyaareedyadii hore.","description":"Bayern Munich ayaa lagu soo waramayaa in ay ka wal","id":"8aee5c1d-0a12-4eb5-a393-363afde81671","image_url":"https://i0.wp.com/kooxda.com/wp-content/uploads/2023/03/image_2023-03-23_180937185.png?fit=636%2C382&ssl=1","link":"https://kooxda.com/2023/03/23/bayern-munich-oo-walaac-ka-qabta-qaab-ciyaareedka-sadio-mane/","pubDate":"2023-03-23 15:11:25","title":"Bayern Munich Oo Walaac Ka Qabta Qaab Ciyaareedka Sadio Mane."},{"title":"Paul Hurst makes John McAtee claim after resurgent Grimsby Town performance","link":"https://www.grimsbytelegraph.co.uk/sport/football/football-news/hurst-mcatee-claim-grimsby-performance-8281053","description":"The 23-year-old was restored to the starting line-up against Mansfield Town in midweek after being dropped to the bench at Brighton","content":"Paul Hurst was impressed with John McAtee’s response to being dropped at the weekend in Grimsby Town’s 0-0 draw with Mansfield Town on Wednesday night. Although he did not manage to get on the scoresheet at Field Mill, McAtee was the driving force behind the Mariners' strong first-half performance against a play-off chasing Mansfield side. It was a redemption performance of sorts for the 23-year-old who, despite being rested in the Sutton United game that came just before, did not make the starting line-up for Town’s FA Cup quarter-final match-up with Brighton on Sunday. McAtee did come on at half-time at the Amex, but when asked why he did not start the game, Grimsby boss Hurst gave a rather abrupt response. READ MORE: Mansfield Town chief's verdict on Grimsby Town draw as both sides rue missed chances \"He didn't because I went with the team that I thought deserved to start and that was that,\" said Hurst after Brighton. \"I just don't think he deserved to start and that's the truth of the matter.\" The Luton Town loanee was brought back into the starting team alongside Ryan Taylor and George Lloyd up top, which worked well as an attacking trio for the most part despite not being able to find that crucial goal. Hurst highlighted McAtee’s first-half performance after the game which reminded those watching of the player’s true quality. “I felt those three could cause [Mansfield] problems and I think they did,” added the Mariners boss after the Mansfield draw. “It maybe left us a little bit vulnerable going the other way at times, so there is always a balancing act. “As the game went on the opposition focused more on trying to stop them, but I still think John [McAtee] was back to somewhere near his best in the game. He tired a little bit towards the end of the game, but certainly, initially, he looked like the best player on the pitch. That little bit of fatigue probably kicked in, particularly with Ryan [Taylor] and John. “[Mansfield] did bring an extra man over to cover [McAtee] but if they’re doing that, somewhere else along the pitch there will likely be a spare man so we had to try and find a way to cause them more problems in the second half.” READ NEXT Paul Hurst proud of Grimsby Town effort but admits disappointment at missed chances Grimsby Town player ratings from Mansfield draw as Emmanuel and Glennon impress John McDermott's Paul Hurst verdict ahead of Grimsby Town FA Cup quarter-final showdown Michee Efete goal enough to see Grimsby Town to hard-fought victory at Sutton United Sutton United 0-1 Grimsby Town highlights as Mariners battle to great away victory","pubDate":"2023-03-23 15:00:00","image_url":"https://i2-prod.grimsbytelegraph.co.uk/incoming/article8281029.ece/ALTERNATES/s615/0_Mansfield-v-GrimsbySky-Bet-EFL-League-Two.jpg","id":"7b2e857f-c378-4378-a7a6-00614b98fe4c"},{"content":"England ayaa caawa u safri doonta Italy iyaga oo isha ku haya in ay guul ku bilaabaan ololahooda is reeb-reebka Euro 2024. Kooxda Gareth Southgate ayaa ku jirta imtixaan adag iyaga oo doonaya in ay ka aargutaan finalka Euro 2020 ee ka soo gaadhay xulka Azzurri. Kulanka caawa ayaa noqon doona kulankii ugu horeeyay ee England tan iyo guuldaradii ka soo gaartay France wareega 8 dhamaadka koobka aduunka sanadkii hore. Xulka Gareth Southgate ayaa isku dayi doonta in ay ka baxaan niyad jabkii koobkii adduunka kulanka is reeb-reebka koobka Euro2024. Ka dib kulanka caawa ee Azzurri, England ayaa la ciyaari doonta Ukraine axada garoonka Wembley. Harry Kane ayaa la filayaa inuu mar kale hogaamiyo weerarka England kulanka Italy. Weeraryahanka Tottenham ayaa caawa noqon kara gooldhaliyaha ugu sarreeya taariikhda England. Kane ayaa hadda la siman Wayne Rooney oo dhaliyay 53 gool.","description":"England ayaa caawa u safri doonta Italy iyaga oo i","id":"8b0cd7c4-bed9-4b8e-ae03-2b3c56a65558","image_url":"https://i0.wp.com/kooxda.com/wp-content/uploads/2023/03/image_2023-03-23_173029775.png?fit=635%2C382&ssl=1","link":"https://kooxda.com/2023/03/23/xulka-england-oo-kulan-adag-la-ciyaaraya-italy-harry-kane-oo-rikoodh-taariikhi-ah-isha-ku-haya/","pubDate":"2023-03-23 14:53:49","title":"Xulka England Oo Kulan Adag La Ciyaaraya Italy & Harry Kane Oo Rikoodh Taariikhi Ah Isha Ku Haya"},{"title":"Punters furious as jockey Sean Quinlan ‘falls off’ odds-on favourite when 1-100 in-running at final fence","link":"https://www.thesun.co.uk/sport/21814290/jockey-sean-quinlan-falls-off-sedgefield-1-100-in-running/","description":"PUNTERS reacted with fury after a jockey 'fell off' an odds-on favourite who hit 1-100 in-running when leading at the final fence.Sean Quinlan cleared","content":"PUNTERS reacted with fury after a jockey 'fell off' an odds-on favourite who hit 1-100 in-running when leading at the final fence.\n\nSean Quinlan cleared the last jump aboard the 2-9 shot Telhimlisten in the 1.40 race at Sedgefield.\n\n4 Telhimlisten and Sean Quinlan had the race in the bag approaching the last\n\n4 The 2-9 favourite got in tight and made a slight mistake at the final fence\n\n4 And a few strides after the obstacle Quinlan fell from the saddle\n\n4 Punters were furious at the unseat - with Grey Skies going on to win the two-runner race\n\nBut a few strides after the last, and with the two-runner race apparently in the bag, he fell from the saddle and crashed into the turf.\n\nOn the head-on angle, you can see the horse jink to his left, with Quinlan being sent the other direction out of the side door.\n\nIt caught commentator Richard Hoiles completely by surprise - and left some in-running punters with severely burnt fingers on Betfair.\n\nOver £14,000 was matched on Telhimlisten at the minimum 1-100 - but some bettors cashed in with £4.67 matched at 1000-1!\n\nSo unlucky for Sean Quinlan! pic.twitter.com/teEnUh9RmT — At The Races (@AtTheRaces) March 23, 2023\n\nIt sparked a huge backlash from fans on Twitter, who claimed Quinlan's unseat looked 'suspicious'.\n\nAnd Telhimlisten's owner Adam McCormack Tweeted: \"I can only apologise to anyone who backed Telhimlisten there. I'm not there today and not sure what has happened.\"\n\nBut some sympathised with the veteran jockey after seeing the head-on.\n\nOne fan said: \"He literally just fell off the horse.\"\n\nAnother added: \"This looks suspicious but he's nearly took a kick to the head - can't imagine he's meant to do that.\"\n\nWhile another joked: \"That's a worse dive than Salah.\"\n\nSean Quinlan, who is one of the leading jockeys based in the North of England, was said to be mortified after the race.\n\nHe has ridden over 400 winners during his career, including 63 so far this season, with his biggest success coming in the Scottish Grand National in 2019 aboard Takingrisks.\n\nFREE BETS GET OVER £2,000 IN SIGN UP OFFERS HERECommercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org\n\nRemember to gamble responsibly\n\nA responsible gambler is someone who:","pubDate":"2023-03-23 14:45:07","image_url":"https://www.thesun.co.uk/wp-content/uploads/2023/03/newspress-collage-21814290-1679582296953.jpg?1679582342&strip=all&quality=100&w=1920&h=1080&crop=1","id":"887bdc3e-44ee-4dbc-bab9-63cf9ceb8eea"},{"content":"Manchester United owners were Thursday awaiting fresh bids from a Qatari banker and British billionaire Jim Ratcliffe after the deadline passed for revised offers to buy the Premier League giants. Reports said bidders were initially told they had until 2100 GMT on Wednesday to submit new bids, but that has now been extended. It is unclear when the new cut-off will be. Sheikh Jassim Bin Hamad Al Thani, the chairman of Qatar Islamic Bank, and Ratcliffe, the founder of chemicals giant INEOS, are the only bidders who have gone public with their intentions. A first round of bidding took place last month and it has been reported there are as many as eight separate potential investors for the club owned by the American Glazer family, who are deeply unpopular with United supporters. The BBC said several other proposed investors made their submissions by the Wednesday deadline. No figures have been revealed but one or more of the initial bids was understood to be in the region of £4.5 billion ($5.5 billion). That would make Manchester United — who have not won the Premier League for a decade — the most expensive sports club in history, although it would be short of the £6 billion valuation reportedly placed on United by the Glazers. United’s owners announced in November they were conducting a strategic review, with the sale of the club one option being considered. Sheikh Jassim is bidding for 100 per cent control, aiming to return the club to its “former glories”. A source close to Sheikh Jassim’s bid told AFP he remains confident his bid is “the best for the club, fans and local community”. – ‘Stupid prices’ – INEOS chemical company founder Ratcliffe, a boyhood United fan, wants to buy the combined Glazer shareholding of 69 percent of the 20-time English champions. The 70-year-old told the Wall Street Journal this week he was not interested in paying “stupid prices” in a bidding war for one of football’s most iconic clubs. Related News Europa League: Rashford's strike gives Man United win over Betis Casemiro sees red as Man United draw Southampton Man Utd attempt reset after humiliation by Liverpool Ratcliffe, who already owns French club Nice, said his interest in United would be “purely in winning things”, calling the club a “community asset”, rather than a financial one. The Glazers have angered many United fans by saddling the club with huge debts since they took over in 2005. They appeared ready to cash out at an enormous profit when they invited external investment in November. However, they could yet shun the option of selling a controlling stake in the club, with other parties understood to be interested in a minority shareholding. Ratcliffe visited Old Trafford last week along with INEOS representatives, a day after a delegation from Sheikh Jassim’s group toured the club’s stadium and training ground. A Qatari purchase of United would boost the sporting profile of the Gulf state months after it hosted the 2022 World Cup, but it would also be controversial. Sheikh Jassim is the son of a former Qatari prime minister, raising concerns over the potential growth of state influence in the Premier League. Premier League champions Manchester City’s fortunes have been transformed since a takeover from Sheikh Mansour, a member of Abu Dhabi’s ruling family, in 2008. In 2021, the Saudi sovereign wealth fund bought a controlling stake in Newcastle. Amnesty International has called on the Premier League to tighten ownership rules to ensure they are “not an opportunity for more sportswashing”. If Sheikh Jassim’s bid succeeds, it would also raise the question of whether Qatar is shifting its attention away from Paris Saint-Germain, currently home to the trio of Lionel Messi, Neymar and Kylian Mbappe, who were bought by Qatari investors in 2011. United, three-time European champions, have not won the Premier League since Alex Ferguson led them to a 20th English title in his final season before retiring in 2013. But they are enjoying a renaissance under Erik ten Hag’s management this season and ended a six-year trophy drought by lifting the League Cup last month. AFP","description":"Manchester United owners were Thursday awaiting fresh bids from a Qatari banker and British billionaire Jim Ratcliffe after the deadline passed for revised offers to buy the Premier League giants. Reports said bidders were initially told they had until 2100 GMT on Wednesday to submit new bids, but that has now been extended. It is Read More","id":"1f5cd99c-3cce-4167-9ce7-cd96d08d2c06","image_url":"https://cdn.punchng.com/wp-content/uploads/2021/09/10210647/Manchester-United.jpg","link":"https://punchng.com/man-united-owners-await-fresh-bids-from-buyers-after-deadline/","pubDate":"2023-03-23 14:26:30","title":"Man United owners await fresh bids from buyers after deadline"},{"content":"Wargeyska “El Confidencial” ee dalka Spain ayaa sheegay in xiriirka kubada cagta Yurub “UEFA” ay ka fiirsanayaan ayna qorsheynayaan inay kooxda Barcelona ka joojiyaan ka qeyb galka Champions League xilli ciyaareedka soo socda. Kooxda Barcelona ayaa hogaanka u haysa horyaalka La Liga waxana ay xilli ciyaareedka dambe ka qayb gali doontaa tartanka champions League laakiin arintaas ayuu haatan shaki ku jiraa sabab la xidhiidha fadeexada laaluushka garsoorayaasha. Ilaa hadda, UEFA si rasmi ah uma soo faragelin kiiskan marka loo eego xidhiidhka La Liga oo baadhitaano ku wada arintaas laakiin waxa ay arintas is badali kartaa todobaadyada soo socda. Xidhiidhka kubbada cagta Yurub ayaa si fiican u daraasaynaya xaalada Barcelona ka hor inta ayna wax go’aan ah gaadhin, laakiin ciqaabta ayaa laga yaabaa in ay dhibaato ku noqoto mustaqbalka kooxda reer Catalonia sababta oo ah kiiskan oo ah mid ay kooxdu laaluush siisay garsooraha lagu magacaabo Negrera. UEFA ayaa Guddi u xil saartay arintan waxana ay xidhiidhka la Liga u direen fariin ah in ay wax ka ogaadaan dambiga lagu haysto kooxda Barcelona si ay go’aan uga gaadhaan dhinacooda. Xeerka UEFA ee No.12 ayaa sheeaya in dhaman kooxaha reer yurub ay u hogaansamaan xeerarka dambi la’aanta iskana ilaaliyaan in ay laaluush siiyaan garsoorayaasha kala duwan. Haddii la xaqiijiyo in Barcelona ay ku lug leedahay dhaqdhaqaaq kasta oo wax ka bedeli kara ama saamayn kara natiijooyinka ciyaaraha gudaha, qaaradaha iyo heerka caalamiga ah, UEFA ayaa markaas soo saari doonta go’aan ka dhan ah kooxda.","description":"Wargeyska “El Confidencial” ee dalka Spain ayaa sh","id":"54517201-7ee8-4139-a48e-d6a777518029","image_url":"https://i0.wp.com/kooxda.com/wp-content/uploads/2023/03/image_2023-03-23_170218286.png?fit=680%2C356&ssl=1","link":"https://kooxda.com/2023/03/23/barcelona-oo-halis-ugu-jirta-in-laga-saaro-champions-league-sabab/","pubDate":"2023-03-23 14:18:42","title":"Barcelona Oo Halis Ugu Jirta In Laga Saaro Champions League, Sabab."},{"content":"SMACK League organizers and a section of team representatives pose with a trophy that will be competed for in the new season\n\nAdvertisements\n\nBy Thomas Odongo\n\nFor the past five seasons, the SMACK League has been majorly about football competitions plus networking and other social activities on matchdays.\n\nWith season 6 of the league set to start this Sunday, 26th March at Legends Grounds in Kampala, three new sports disciplines have been introduced and they are; eSports (electronic sports) which is organized competitive video gaming, basketball and golf. Participants will compete for honors just like in football but also, there are plans to adopt more sports disciplines in the near future.\n\nSpeaking to the press during the Season 6 launch on Wednesday at Legends, Joseph Kasule Kawooya who is the Acting Chief Marketing officer of the SMACK League said that the new sports disciplines will accommodate almost all people.\n\n“This will enable people who aren’t able to play football because of varying factors to also take part in other activities like eSports, basketball and golf,” Kawooya said, adding that he anticipates a successful season.\n\nThe 2023 season will be curtain raised by the Memorial Cup which will mark its second staging this year. Cyclones (class of 2013) are title holders of this event. This year’s event will be held in memory of the deceased alumni, teachers and staff of the school.\n\nFor the new sports disciplines, only eSports will be taking place this Sunday alongside the usual football which is played by 20 teams. Golf and basketball will be happening later in the season.\n\nVictor Byanasaye who leads the eSports section of the SMACK League told media that eSports will be happening on every matchday and players competitions are expected to be tight.\n\n“Every team will have five players consisting of three alumni, one female player and one guest player. For this weekend, we shall have only FIFA but later on other sports will also be played,” Byanasaye said.\n\nFor the Memorial Cup, Gyaviira Bonna who is the Chairman Council of team heads said that the event will run throughout the day and it considers all teams in the league.\n\n“I believe it will be a very intense tournament because there will be no room for resting. But that’s what we want, we are punishing ourselves in honor of those who have gone and we believe that such a tournament which is an equivalent of the Carling Cup will be able to honor them,” Bonna said adding that it will be a 7-aside affair with each half comprising of 20 minutes with only two minutes of rest.\n\nThis year’s Memorial Cup will be more than just a soccer tournament. The SMACK League intends to be more intentional about corporate social responsibility (CSR) with two causes: a fundraising drive for SMACK old boy John Brebeuf Murungi, who is undergoing brain surgery due to Glioblastoma, and a preloved/preowned clothes drive in partnership with the Kuliva Foundation under the office of Miss Tourism in Busoga. Both causes are intended to benefit the less advantaged and align with The SMACK League’s core values.\n\nThe SMACK League partners are; Guinness, Sanyu FM, Soccanett, Oregon Dental and Legends.\n\nThe SMACK League is a creation of the Old Boys of St Mary’s College Kisubi (SMACK) and is used as an avenue to meet, network, socialize and exercise. The league is also used as a platform to create opportunities whilst giving back to the community. Zuluz (class of 2009) are the defending champions.\n\nAbout Post Author","description":"By Thomas Odongo For the past five seasons, the SMACK League has been majorly about football competitions plus networking and other social activities on matchdays. With season 6 of the league set to start this Sunday, 26th March at Legends Grounds in Kampala, three new sports disciplines have been introduced and they are; eSports (electronic","id":"1722ff02-2407-4bc6-87ea-6f79d436b42c","image_url":"https://redpepper.co.ug/wp-content/uploads/2023/03/SMACK-League-organizers-and-a-section-of-team-representatives-pose-with-a-trophy-that-will-be-competed-for-in-the-new-season.-scaled.jpg","link":"https://redpepper.co.ug/smack-league-adopts-new-sports-disciplines/129513/","pubDate":"2023-03-23 14:00:09","title":"SMACK league adopts new sports disciplines"},{"content":"Following the shooting death of Brazilian jiu-jitsu star Leandro Lo, former UFC middleweight champion Anderson Silva has spoken to Brazilian media to clear up the confusion over why his name was brought up in ongoing legal proceedings.\n\nBack in August 2022, Lo was gunned down in a night club in Brazil after an argument with military police officer Henrique Velozo, who is being accused of shooting Leandro in the head.\n\nLast Tuesday, a court granted the officer the right to receive his salary once again after the alleged crime. The news was received with heavy backlash in the Brazilian jiu-jitsu community, who demanded justice for Lo while Velozo awaits trial.\n\nIn a now deleted post on Instagram, Velozo’s lawyer, Claudio Dalledone, shared a video where Silva seemingly showed his support for the lawyer, emphasizing his loyalty and how he would always stand by the attorney. Though the video has been deleted since its publication, we have a transcription of Anderson’s words.\n\n“If you need anything, you know I’m always here. Friendship is above all. I’m loyal to you. After all these years, you know this is eternal. Not just me, but Vidal too. You know we like you very much. We’ll always support you so you can keep on delivering justice with in a serious way. There are two sides to a coin. Both of them must be analyzed and you’re not the one to decide. Most of the time it’s the jury who decides and the evidence is there so that the jury can and the judges can make the right decisions. I’m a big admirer. You’re a great professional. A great friend. I like your whole family very much. I wish you luck in everything you do and you can always count on me.”\n\nIn an interview with Tatame (transcribed by BJJ Doc), Silva admitted to being friends with Dalledone, but called the video misleading and claimed it must have been edited to make it seem like he was defending Lo’s killer and being loyal to the lawyer. However, the ‘Spider’ wanted to make it clear he does not support a “murderer” and “coward.”\n\n“I am good friends with Dr. Claudio (Dalledone), we trained together and I even used to call him ‘master Claudio Dalledone’. He became a great lawyer, I have a great affection for him, but I don’t know in what context he ended up using this video. On several occasions, he asked me for something (video), but in this situation with Leandro (Lo) there’s nothing to talk about. I would never defend the guy who murdered Leandro Lo,” Silva explained.\n\n“Leandro was cowardly murdered by a coward. I have a very good relationship with a lot of people, people keep asking me for a video and, sometimes, I end up not doing it, because the person takes the video and edits it, using it for their own benefit. From what I’ve seen, this video (posted by Dr. Dalledone) has been edited. I would never defend a guy who killed someone in the (fighting) community”","description":"Former UFC champion Anderson Silva addresses recent controversy regarding Leandro Lo’s death.","id":"fbb86b5d-edcb-4868-b175-79df7639bc1e","image_url":"https://cdn.vox-cdn.com/thumbor/YyY_a1wLh4v8n2NwNix4zHvoCnc=/0x0:4479x2345/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24529296/1283263493.jpg","link":"https://www.bloodyelbow.com/2023/3/23/23652480/id-never-defend-a-murderer-anderson-silva-responds-to-video-from-lawyer-of-leandro-los-killer","pubDate":"2023-03-23 14:00:00","title":"‘I’d never defend a murderer’ - Anderson Silva responds to video from lawyer of Leandro Lo’s killer"},{"content":"Article content Ottawa Mayor Mark Sutcliffe says LeBreton Flats is a potentially good option for a new arena for the Ottawa Senators, but it’s not the only possibility. Article content Sutcliffe, speaking on TSN 1200 in advance of Monday’s visit by NHL commissioner Gary Bettman and deputy Bill Daly to talk about pending new ownership of the franchise, offered a twist on the belief that a new home in LeBreton is a slam dunk. “Ideally, it would be, but it all depends on where it would be built and what the deal would be and what would be around it,” Sutcliffe said in a Thursday morning interview on TSN 1200. “In principle, I think we’ve seen throughout North America that downtown arenas are better than suburban arenas typically. I wouldn’t rule out the possibility that whoever the new owners are, they might decide they want to stay in Kanata and refurbish that arena and stay where they are. That’s obviously a possibility. I wouldn’t rule out a deal being struck with the NCC for LeBreton Flats and I wouldn’t rule out another location, as well. I think all options are on the table and it’s really about what’s best for the community and what’s best for the team.” Article content Article content Sutcliffe says there are other locales, including near the current baseball stadium on Coventry Road, north of the Highway 417 off Vanier Parkway and Bayview Yards, which could still be explored. They were intriguing comments, considering that LeBreton Flats has long been seen as the perfect choice home for a new complex. After years and years of drama, the National Capital Commission has an agreement in place to develop the site in partnership with a new ownership group. Postmedia has reported that six groups are believed to have moved on to a second phase in the bidding process, with the price tag for the team possibly reaching as high as $1 billion. Article content Without knowing who might be in charge and what their thoughts on the future of the franchise could be, Sutcliffe isn’t closing any doors. Article content “I’m open to whatever makes sense and I think there are other opportunities,” he said. “We’re building a modern transit system and obviously the LeBreton site is great in terms of its proximity to transit. (But) there are all sorts of places that are close to transit where you can see building events centres and facilities that a large number of people would use. It would be great if LeBreton thing went ahead, but it’s not the only scenario.” He says that LeBreton is great in the sense that it would be between two transit systems, but “if you’re downtown, it’s not walking distance from Elgin Street, for most people, especially in January. That area, if there’s an arena, will get built up, but when the arena opens, it means there may not be a lot around it, in terms of restaurants and bars and other activities, so. It’s a good location, but not the only location, necessarily.” Article content While Sutcliffe talked about how exciting the sale process has been for everyone in the community, including the potential that Ryan Reynolds could ultimately own a stake in the franchise, he’s not keen on using taxpayer’s dollars to directly finance any kind of entertainment complex housing an NHL franchise. “I’m not a fan of public money going into an arena, I wouldn’t be supportive of that in principle,” he said. “I’m not ruling anything out at this point because we don’t know what the scenario will be and what the opportunity might be.” In many new facilities throughout North America, new arena projects often include an additional rink that can be used by the NHL squad when the main rink is unavailable and can also be used by minor hockey associations. Article content “If they’re building a facility that has more than one rink surface in it and the city could use one of those and it would replace an existing, aging facility somewhere and it’s infrastructure that the community could use, I wouldn’t rule out a scenario where there are some city dollars going into it, but I want to be clear. By saying I’m not ruling it out, it doesn’t mean I’m in favour of it. It doesn’t mean I support the idea of the city writing a big cheque. I think that’s very, very unlikely.” There are bigger city priorities, he says, including “building more affordable housing and building more transit.” As a smaller-scale model of what a new Senators-oriented arena district could look like down the road, he also says the redevelopment of Lansdowne into a go-to entertainment district during the past decade has been a positive for the city. “If you look at what was there before, it was a lot of concrete, not a lot of people going there very often, the southside stands were falling down,” he said. “The arena was in pretty rough shape. Now, when I go down there, there’s a farmer’s market, there are activities for kids. There’s the theatre, there are restaurants, there are people walking around. It’s a much more lively and engaging place.” kwarren@postmedia.com Twitter.com/Citizenkwarren","description":"Article content Ottawa Mayor Mark Sutcliffe says L","id":"a2d6a71b-59f7-4391-99dc-c09fa2420a90","link":"https://ottawasun.com/sports/hockey/nhl/ottawa-senators/sutcliffe-on-lebreton-flats-it-would-be-great-if-the-lebreton-thing-went-ahead-but-its-not-the-only-scenario","pubDate":"2023-03-23 13:58:11","title":"Sutcliffe on LeBreton Flats: 'It would be great if the LeBreton thing went ahead, but it's not the only scenario'"}]