[{"title":"Foreign Minister hails close cooperation with Ukraine and Saudi Arabia","link":"https://cyprus-mail.com/2023/03/24/foreign-minister-hails-close-cooperation-with-ukraine-and-saudi-arabia/","description":"Foreign Minister Constantinos Kombos on Thursday had separate phone conversations with his counterparts from Ukraine and Saudi Arabia. On his Twitter account, he said he reiterated to Ukriane’s Dmytro Kuleba Cyprus’ principled position in respect of Ukraine’s sovereignty, territorial integrity and independence. “Cyprus stands ready to support Ukraine’s peace formula,”...","content":"Foreign Minister Constantinos Kombos on Thursday held separate phone conversations with his counterparts from Ukraine and Saudi Arabia. On Twitter, he said he reiterated to Ukriane’s Dmytro Kuleba Cyprus’ principled position in respect of Ukraine’s sovereignty, territorial integrity and independence. “Cyprus stands ready to support Ukraine’s peace formula,” he said. “Looking forward to an in person meeting soon.” He then described his conversation with Saudi Arabia’s Faisal Bin Farhan “excellent” in a separate tweet. “Deeply appreciative of the commitment of Saudi Arabia to deepen the strategic tracks of our close cooperation,” Kombos said. Earlier in the day, Kombos called for a more institutionalised role for the EU on the Cyprus problem, which he said it could prove to be a catalyst for the talks. Speaking to the state broadcaster, he highlighted that although the EU was always present in talks on a technocratic level, “there was an observed absence on the political level.” As a result, although the EU had a positive contribution on the talks, it did not have the degree of impact that it could, Kombos stressed.","pubDate":"2023-03-24 07:08:58","image_url":null,"id":"3eef3ac4-588f-41a2-abd3-02f3b7863167"},{"title":"Man dies in fatal road accident in Nicosia","link":"https://cyprus-mail.com/2023/03/24/man-dies-in-fatal-road-accident-in-nicosia/","description":"A 26-year-old from Bangladesh, resident of Nicosia, Sunny Hossen, has died in a fatal traffic accident, police said on Friday morning. The accident occurred at 9.50pm on Thursday on Salaminos Avenue, when a car driven by a 22-year-old woman crashed into the victim’s moped. The man sustained extremely serious injuries...","content":"A 26-year-old from Bangladesh, resident of Nicosia, Sunny Hossen, has died in a fatal traffic accident, police said on Friday morning. The accident occurred at 9.50pm on Thursday on Salaminos Avenue, when a car driven by a 22-year-old woman crashed into the victim’s moped. The man sustained extremely serious injuries and was rushed to Nicosia general hospital. However, doctors could not save him and he was pronounced dead shortly after. Police are asking any potential witness of the crash to report to the nearest police station or contact the citizen’s line at 1460.","pubDate":"2023-03-24 07:01:30","image_url":null,"id":"8d1879ac-8ad7-400f-a57e-8a3890a305f3"},{"title":"Cash transfer programme for vulnerable families","link":"https://www.chronicle.co.zw/cash-transfer-programme-for-vulnerable-families/","description":"Thandeka Moyo-Ndlovu, Online Reporter NEARLY 19 000 households in five rural districts are set to benefit from the Ministry of Public Service, Labour and Social Welfare, UNICEF, andpartners’ next phase of the Emergency Social Cash Transfer (ESCT) Programme that aims to provide cash payments. The programme which combines nutrition and child protection services was first […]","content":"The Chronicle NEARLY 19 000 households in five rural districts are set to benefit from the Ministry of Public Service, Labour and Social Welfare, UNICEF, andpartners’ next phase of the Emergency Social Cash Transfer (ESCT) Programme that aims to provide cash payments. The programme which combines nutrition and child protection services was first launched in August 2020 supporting the two districts of Gutu and Highfields. In 2022 the programme supported over 113,790 individuals and 25,801 households in the urban localities of the eight districts of Beitbridge, Binga, Bulawayo, Chitungwiza, Gutu, Highfields, Lupane, and Mufakose. 2022 also marked the handover of Gutu and Highfields Districts back to the Government and their integration within the Government-led Harmonised Social Cash Transfer Programme (HSCT). In a statement, Unicef said under the new phase of the support, the Emergency Social Cash Transfer programme will also be working with the Ministry of Primary and Secondary Education to support selected schools in the districts with a school feeding programme for one school calendar year. “This will be organised through the School Improvement Grant, an established mechanism that provides direct payments to schools to support them address the most basic needs and meet a minimum set of school functionality criteria. Providing support from multiple angles is essential because we know that there are multiple vulnerabilities that need to be addressed and that cash alone cannot do it,” read the statement. @thamamoe","pubDate":"2023-03-24 06:58:27","image_url":null,"id":"95f5eea4-96f4-4f48-b7b0-510c8f469669"},{"title":"Sindhu exits, Satwik-Chirag duo enters quarters of Swiss Open","link":"https://www.orissapost.com/sindhu-exits-satwik-chirag-duo-enters-quarters-of-swiss-open/","description":"Basel: Double Olympic medallist PV Sindhu failed to defend her Swiss Open Super 300 badminton title as she was shocked by unseeded Putri Kusuma Wardani of Indonesia in a thrilling three-game women’s singles second-round match here. World no.9 Sindhu, seeded fourth here, was stunned 15-21 21-12 18-21 by the 38th-ranked Wardani in their first-ever face-off […]","content":"Sindhu exits, Satwik-Chirag duo enters quarters of Swiss Open IANS Updated: March 24th, 2023, 12:14 IST in Sports 0 PV Sindhu in action against Thailand's Ratchanok Intanon PTI Photo Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Basel: Double Olympic medallist PV Sindhu failed to defend her Swiss Open Super 300 badminton title as she was shocked by unseeded Putri Kusuma Wardani of Indonesia in a thrilling three-game women’s singles second-round match here. World no.9 Sindhu, seeded fourth here, was stunned 15-21 21-12 18-21 by the 38th-ranked Wardani in their first-ever face-off at the international level on Thursday night. But the second-seeded men’s pairing of Satwiksairaj Rankireddy and Chirag Shetty kept India’s flag flying by entering the quarterfinals with a hard-fought 12-21 21-17 28-26 win over Taiwanese pair of Fang-Chih Lee and Fang-Jen Lee. The world No. 6 Indian duo will next face Danish pair of Jeppe Bay and Lasse Molhede later Friday. Earlier Thursday, world No. 9 and fifth seed H S Prannoy made a shock second-round exit after losing in straight games against unseeded Christo Popov of France. Prannoy, favourite coming into the contest, looked a pale shadow of himself in front of world No. 40 Popov as he failed to give any fight, losing 8-21 8-21 to bow out of the men’s singles event. But it was Kidambi Srikanth, who was the first to crash out Thursday, losing to Hong Kong’s Cheuk Yiu Lee. Going by rankings, there was hardly anything to separate the two as Srikanth is placed 20th in the world against his rival’s 19th position. It was a hard-fought match, but Lee kept his composure to emerge 22-20 21-17 winner in the singles pre-quarterfinal contest. National champion Mithun Manjunath also bowed out in the second round, losing 19-21 10-21 to Chia Hao Lee of Chinese Taipei. Tags: Chirag Shetty PV Sindhu Satwiksairaj Rankireddy Swiss Open Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Ashneer Grover launches fantasy sports app CrickPe ahead of IPL March 24, 2023 Ronaldo sets new record for most international appearances March 24, 2023 Euro 2024 Qualifiers: Harry Kane bidding to become England’s highest goal scorer March 24, 2023 Nitu, Nikhat cruise into final of World Championships March 23, 2023 AHF honours Hockey India with best organiser award for successfully hosting 2023 FIH WC March 23, 2023 ISSF World Cup: India win silver and bronze in mixed-team events March 23, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-03-24 06:44:04","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2022/06/PV-Sindhu-scaled.jpg?fit=300%2C169=1","id":"0ae36951-add5-4ddd-9d47-9c542536c8e5"},{"title":"Zipra war veterans breathe fire as President Mnangagwa declares Cde Sharpshoot liberation hero","link":"https://www.myzimbabwe.co.zw/news/107296-zipra-war-veterans-breathe-fire-as-president-mnangagwa-declares-cde-sharpshoot-liberation-hero.html","description":"Zipra war vets fume over Moyo’s hero status ZIMBABWE People’s Revolutionary Army (Zipra) ex-combatants have lashed out at government for dragging its feet to confer hero status on one of the country’s liberation war pioneers, David Moyo. The former senior Zipra commander, popularly known as Sharp Shoot, died on Saturday morning at Mpilo Central Hospital […] The post Zipra war veterans breathe fire as President Mnangagwa declares Cde Sharpshoot liberation hero first appeared on My Zimbabwe News.","content":"ZIMBABWE People’s Revolutionary Army (Zipra) ex-combatants have lashed out at government for dragging its feet to confer hero status on one of the country’s liberation war pioneers, David Moyo. The former senior Zipra commander, popularly known as Sharp Shoot, died on Saturday morning at Mpilo Central Hospital in Bulawayo where he was receiving treatment for a prostate-related problem. Moyo was 98. Zipra Veterans Association spokesperson Buster Magwizi said there was a sustained campaign to belittle contributions made by ex-Zipra combatants during the armed struggle. “It is clear that as Zipra war veterans, we will all be declared posthumously. No one will be declared on time,” Magwizi. “They should let us declare our own people, theirs is to approve. Moyo went to war in 1962 when Zanu PF had not been formed, so they did not know him.” Human right activist and Ibhetshu LikaZulu secretary-general Mbuso Fuzwayo said the delay by the Zanu PF politburo — which has given itself the right to name heroes and heroines — to recognise the late Moyo’s liberation war contribution was not a surprise. “They have been doing that for many years,” Fuzwayo said. “We should not worry about this. We have got our own heroes acre, which is Lady Stanley in Bulawayo. This is where most of the liberation war heroes from Matabeleland are interred.” Some of the Zapu and Zipra heroes buried at Lady Stanley Cemetery after being denied national hero status include Thenjiwe Lesabe, Zipra commander Lookout Masuku, former Matabeleland North governor Welshman Mabhena, Masala Sibanda, diplomat Isaac Nyathi, Swazini Ndlovu, Richard Dube and Ethan Dube. Zapu has been celebrating Heroes Day by honouring some of its unsung heroes including those buried at Lady Stanley. The late former President Robert Mugabe never shied away from declaring that only fierce Zanu PF faithful would be buried at the National Heroes Acre in Harare. Bulawayo Zanu PF provincial chairperson Jabulani Sibanda said the ruling party was still deliberating on Moyo’s hero status. “You will be informed when everything has been sorted out,” said Sibanda. Meanwhile, Zanu PF Council of Elders member Tshinga Dube last night announced that Moyo had been declared a provincial hero and will be buried at Nkulumane Heroes Acre. He made the announcement at the funeral wake of Sharp Shooter in Emganwini. Businessman and farmer Mike Gore Chidziva, who passed away early this week in Beatrice, has already been granted a State-assisted funeral. — NewsDay","pubDate":"2023-03-24 06:41:24","image_url":null,"id":"209c45f6-9885-4fb2-b514-ff1602f3908c"},{"title":"Condolences pour in for Pradeep Sarkar","link":"https://www.orissapost.com/condolences-pour-in-for-pradeep-sarkar/","description":"Mumbai: Director Pradeep Sarkar, who is known for films like Parineeta, Mardaani, the web series Duranga and others, passed away at a Mumbai hospital at the age of 67. He was on dialysis and his potassium levels had dropped drastically. As his condition deteriorated, he was rushed to the hospital at 3:00 a.m. March 24, […]","content":"Condolences pour in for Pradeep Sarkar IANS Updated: March 24th, 2023, 12:06 IST in Entertainment 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Mumbai: Director Pradeep Sarkar, who is known for films like Parineeta , Mardaani , the web series Duranga and others, passed away at a Mumbai hospital at the age of 67. He was on dialysis and his potassium levels had dropped drastically. As his condition deteriorated, he was rushed to the hospital at 3:00 a.m. March 24, and passed away at 3.30 a.m. Funeral arrangements have been made at a crematorium in Santacruz for 4 p.m. Friday. Several members of the film fraternity expressed their grief and shared condolences. Taking to Twitter, actor Ajay Devgn wrote: “The news of Pradeep Sarkar’s demise, ‘Dada’ to some of us is still hard to digest. My deepest condolences (flower bouquet). My prayers are with the departed and his family. RIP Dada.” The news of Pradeep Sarkar’s demise, ‘Dada’ to some of us is still hard to digest. My deepest condolences 💐. My prayers are with the departed and his family. RIP Dada 🙏 — Ajay Devgn (@ajaydevgn) March 24, 2023 The Kashmir Files director Vivek Agnihotri shared a statement on Twitter. It read: “It is with a heavy heart that we inform you that Pradeep has departed for his heavenly abode. Please join us at 4 p.m. for his funeral at Santacruz Hindu Crematorium to say goodbye to him.” Lost another gem of a person. Pradeep Da was a truly creative person which reflected in his art as well his behaviour. You will live in our hearts with your art. ओम शांति। pic.twitter.com/oPOl90dnGU — Vivek Ranjan Agnihotri (@vivekagnihotri) March 24, 2023 Actor Neil Nitin Mukesh, who worked with the director in ‘Lafangey Parindey’, shared pictures with Pradeep on Twitter. He said, “DADA!!! Why??? I’ll miss you dada. Will always remember you as that child-hearted, full of life man who taught me so much. Your creation ‘Lafangey Parindey’ will always remain close to my heart. My prayers with the family.” DADA!!! Why??? I’ll miss you dada. Will always remember you as that child hearted, full of life man who taught me so much. Your creation Lafangey Parindey will always remain close to my heart ❤️. My prayers with the family 🙏🏻🙏🏻🙏🏻. pic.twitter.com/qcka5Kn5cB — Neil Nitin Mukesh (@NeilNMukesh) March 24, 2023 The Lunchbox actress Nimrat Kaur also shared a picture of Pradeep and tweeted: “Had the great pleasure of being on his set a few times in my modeling days. His hearty laughter and relentless perfectionism will forever be etched in my heart. Deepest condolences to his loved ones. Rest on Dada, the heavens above are a happier place. #RIPPradeepSarkar.” Had the great pleasure of being on his set a few times in my modeling days. His hearty laughter and relentless perfectionism will forever be etched in my heart. Deepest condolences to his loved ones. Rest on Dada…the heavens above are a happier place. #RIPPradeepSarkar pic.twitter.com/UOnmLwF8ob — Nimrat Kaur (@NimratOfficial) March 24, 2023 Tags: Hindi film industry Pradeep Sarkar Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Popular Tamil star ‘Thala’ Ajith Kumar’s father passes away at 85 March 24, 2023 Filmmaker Pradeep Sarkar dies at 67 March 24, 2023 ‘Gumraah’ trailer has Aditya Roy Kapur in dual role March 24, 2023 Shah Rukh Khan reveals he does not shampoo his hair regularly! March 23, 2023 ‘The Elephant Whisperers’ couple Bomman, Belli pose with Oscar Award March 23, 2023 Ajay Devgn shares glimpse of breathtaking-intense action in ‘Bholaa’ March 23, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-03-24 06:36:21","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/03/jkmmkh.jpg?fit=300%2C204=1","id":"c38a5b51-4bcb-4332-85bb-180905ac6bdf"},{"title":"Jailed in Elgar Parishad case, Dr Hany Babu to get honorary doctorate from Belgian university","link":"https://www.nationalheraldindia.com/national/jailed-in-elgar-parishad-case-dr-hany-babu-to-get-honorary-doctorate-from-belgian-university","description":"In a release issued on Thursday, Hany Babu's wife Jenny Rowena said he will be awarded the honorary doctorate from the faculty of Arts and Philosophy of Ghent University, Belgium on Friday","content":"Former Delhi University associate professor Dr Hany Babu, an accused in the Elgar Parishad-Maoist links case and currently lodged in a jail in Navi Mumbai, is set to get an honorary doctorate degree from a university in Belgium, his wife has said. In a release issued on Thursday, Hany Babu's wife Jenny Rowena said he will be awarded the honorary doctorate from the faculty of Arts and Philosophy of Ghent University, Belgium on Friday. Hany Babu was arrested in the Elgar Parishad-Maoist links case in July 2020. He was the 12th person to be arrested in the case. The case relates to the Elgar Parishad conclave held in Pune on December 31, 2017. Pune police had alleged that provocative speeches there led to caste violence at Bhima Koregaon war memorial located near Pune city the next day, and the Parishad itself was backed by Maoists. \"The faculty of Arts and Philosophy of Ghent University, which nominated Dr Hany Babu's name to the executive committee, justified its nomination by pointing at his efforts to safeguard the importance of academic freedom and his commitment to language rights and equal access to education for minorities,\" his wife stated in the release. The diploma and the epitoga will be given during a ceremony on the university's 'Dies Natalis' or Anniversary Day on March 24, she said. Dr Hany Babu's promoter Dr Anne Breitbarth, Associate Professor of Historical Linguistics at the German section of the Linguistics Department at Ghent University will receive the badges of honour in place of Hany Babu and the same will be handed over to him as soon as circumstances permit, she said quoting a university representative. Apart from Hany Babu, six other researchers and scholars from the US, the UK, Canada, Austria and Netherlands are also being awarded honorary degrees on the same day by Ghent University, it said. Follow us on: Facebook , Twitter , Google News , Instagram Join our official telegram channel ( @nationalherald ) and stay updated with the latest headlines","pubDate":"2023-03-24 06:32:04","image_url":"https://gumlet.assettype.com/nationalherald/2023-03/7045b253-ba2e-45aa-b7bd-37425410a7ed/E1H_qnnVkAUim6z__1_.jpeg","id":"f6144506-45a3-4cb8-a274-1cf6b428bf78"},{"title":"Fleeing Afghan Refugee Wins Prestigious ‘Loran Award’","link":"https://www.khaama.com/fleeing-afghan-refugee-wins-prestigious-loran-award/","description":"Banin Arjmand, a 20-year-old refugee who fled Afghanistan with her parents after the Taliban seized control in August 2021, won a prestigious scholarship to pursue her higher education at a Canadian university. Currently, Arjmand lives in Saskatoon, finishing her high school diploma at Nutana Collegiate and working part-time to support herself and her family. Freshly […] The post Fleeing Afghan Refugee Wins Prestigious ‘Loran Award’ appeared first on The Khaama Press News Agency.","content":"Currently, Arjmand lives in Saskatoon, finishing her high school diploma at Nutana Collegiate and working part-time to support herself and her family. Freshly arrived in Toronto, Arjmand thought she could not afford university tuition. However, she did not succumb to the challenges and made every effort to find a way to continue her studies. Being advised by one of her professors, she applied for the prestigious Loran Award, a scholarship valued at more than $100,000 over four years, she figured she didn’t have anything to lose. The application process is demanding and brought back painful memories for Arjmand, how she fled her home country and left her friends, and good memories behind. “For me, it was like a flashback of everything I’ve been through. It made me think of every detail of my life. I ended up crying,” Arjmand told CBC News. On Thursday, the Loran Scholars Foundation announced that Arjmand had won one of 36 Loran Awards. About 5,000 students from across Canada apply for scholarships every year. The four-year scholarship program consists of a yearly stipend, free tuition at one of 25 Canadian universities, summer work experience, mentorship, and networking. Arjmand says the scholarship is life-changing for her. “I am sure through this foundation, I’m going to know myself more, learn more about this new world, and do better.” While Arjmand is excited about her future, she worries about the girls and women in Afghanistan who have been deprived of their fundamental rights to go to school, to work, or to move freely under the Taliban regime. Since the return of the Taliban to power in August 2021, the interim regime has issued more than 30 verdicts, barring Afghan women and girls from attending education, work, and public life.","pubDate":"2023-03-24 06:31:27","image_url":null,"id":"054e702a-b11d-4fb7-b9cf-ed9fde5a5cab"},{"title":"Firm maps Nicosia properties that are easiest to sell","link":"https://cyprus-mail.com/2023/03/24/firm-maps-nicosia-properties-that-are-easiest-to-sell/","description":"Cypriot fintech Ask WiRE has published a report identifying the properties that are easiest to sell in the capital, which primarily concern three municipalities, Nicosia, Strovolos, and Aglantzia. The company, which operates by combining expertise in the real estate sector with the use of technology, said that it has developed...","content":"Properties in the municipalities of Nicosia, Strovolos and Aglantzia are the easiest to sell in the Cyprus capital, a report by Cypriot fintech Ask WiRE showed. The company, which operates by combining expertise in the real estate sector with the use of technology, said that it has developed a new innovative tool, which utilises data in the real estate market to create useful, actionable insights. The model takes into account several factors such as the density of real estate in different regions, something which dictates the supply in each area, the number of sales in the last five years, as well as transactions by property type and value. It then creates a rating scale for each area based on the range of selling prices. Therefore, analysts, buyers and sellers can draw useful conclusions about the supply and demand of real estate and the values negotiated in each area, in order to assess how easy to sell each property is. The company said that based on its analysis of the real estate market’s subsector pertaining to apartments specifically, the easiest to sell properties in the city and suburbs of Nicosia can be found in the municipalities of Nicosia and Strovolos, with a price range between €70,000 and €150,000. “Demand is elevated across all price categories in the areas and municipalities located in the centre of Nicosia, as well as the areas near the centre’s perimeter,” the company said. “Nicosia and to a greater extent Strovolos have in their geographical boundaries the highest degree of sellability of apartments among all price categories with the relevant index being higher (6) than average,” it added. Moreover, the company noted that Aglantzia, Lakatamia and Engomi are three municipalities that also exhibit a high number of sales across all price categories, with the difference being that in the categories between €250,000 and above, the density decreases from already below-average (4) to lower down the scale. Agios Dometios and Latsia, meanwhile, exhibit sales across the entire price range but the relevant index is exactly in the middle (5) in terms of properties between €70,000 and €150.000, below average (4) for properties between €150,000 and €250,000, and close to the bottom (2) in all categories of apartments of higher value. The fourth subcategory encapsulates the municipalities of Yeri, Idalion and Tseri, where the density of apartment sales is very low, ranking near the bottom of the relevant index. Pavlos Loizou, CEO of Ask WiRE said that the company’s data analytics team has created a powerful tool, which can be useful for many of the participants in the real estate market, such as portfolio managers, investors and bankers. “It enables them to have a complete picture and evaluate the data before making their decisions regarding the liquidity of the investment or their collateral,” Loizou said. “This is especially important when calculating the time and possible decrease in price for the sale of a property within a certain time period,” he concluded.","pubDate":"2023-03-24 06:30:55","image_url":null,"id":"539104a7-4f14-4309-94e9-599393c01b86"},{"title":"Anarchy prevails in revamped Makarios Avenue in Nicosia, lawmaker says","link":"https://in-cyprus.philenews.com/news/local/anarchy-prevails-in-revamped-makarios-avenue-in-nicosia-lawmakers-says/","description":"The revamped central Makarios Avenue in Nicosia opened in October as a “shared space” for pedestrians and authorised vehicles but anarchy seems to prevail, according to lawmakers. The capital’s Municipality had announced at the time that the only traffic allowed down Makarios Avenue would be buses, taxis, emergency vehicles and the vehicles of residents or […]","content":"Search News Local Anarchy prevails in revamped Makarios Avenue in Nicosia, lawmaker says Anarchy prevails in revamped Makarios Avenue in Nicosia, lawmaker says 20 mins ago Makarios Avenue googletag.cmd.push(function() { googletag.display('div-gpt-ad-1522825278556-0'); }); The revamped central Makarios Avenue in Nicosia opened in October as a “shared space” for pedestrians and authorised vehicles but anarchy seems to prevail, according to lawmakers. The capital’s Municipality had announced at the time that the only traffic allowed down Makarios Avenue would be buses, taxis, emergency vehicles and the vehicles of residents or shop owners on the road. However, House Transport Committee chairman Marinos Moushoutas on Thursday said it was obvious there is anarchy on Makarios Avenue – in the sense that no one controls who comes in and who goes out. He also said that, over the past six months, the House has been calling for legislation to be tabled clarifying who is allowed down the central avenue and ensuring inspection procedures. This has yet to be done, he added. Moushoutas also said a constant police presence on Makarios Avenue is not necessary if technology indicating whether road users are moving legally or illegally is properly used. A police officer’s computer and overall control systems used should display all details of a vehicle when entering its registration number, he added. At the same time, a representative of the Nicosia Municipality raised the issue of personal data by any use of cameras checking whether vehicles using the avenue are legally doing so or not. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1545053448854-0'); }); By Annie Charalambous Previous article Young delivery man dies in road accident in Nicosia","pubDate":"2023-03-24 06:25:57","image_url":"https://in-cyprus.philenews.com/wp-content/uploads/2023/03/MAKARIOS-AVENUE.jpg","id":"cffc00a8-f5a7-4944-a3d9-22824b3396b2"},{"title":"Sathosa reduces prices of 10 items!","link":"https://srilankamirror.com/news/sathosa-reduces-prices-of-10-items/","description":"In order to provide relief to the people, Lanka Sathosa has reduced the prices of 10 essential items with effect from today (24). The revised prices; Dry Chillies 1kg – Rs: 1,380Garlic 1kg – Rs: 450Sprats 1kg – Rs: 1,100Chickpea 1kg – Rs: 555Samba Rice (Local) 1kg – Rs: 199Canned Fish 425g – Rs: 520Big […]","content":"In order to provide relief to the people, Lanka Sathosa has reduced the prices of 10 essential items with effect from today (24). The revised prices; Dry Chillies 1kg – Rs: 1,380 Garlic 1kg – Rs: 450 Sprats 1kg – Rs: 1,100 Chickpea 1kg – Rs: 555 Samba Rice (Local) 1kg – Rs: 199 Canned Fish 425g – Rs: 520 Big Onion 1kg – Rs: 119 Potatoes (local) 1kg – Rs: 270 White sugar 1kg – Rs: 210 Watana 1kg – Rs: 298","pubDate":"2023-03-24 06:24:20","id":"d98aabe3-5f98-48d9-869a-d1e56cdee6eb"},{"title":"Tune of IMF has changed: Kiriella","link":"https://srilankamirror.com/news/tune-of-imf-has-changed-kiriella/","description":"Chief Opposition Whip Lakshman Kiriella said in Parliament that the International Monetary Fund (IMF) has also changed its “tune” as it had earlier said in September that a mandate is needed if economic reforms are to be carried out. MP Kiriella asked whether the conditions have now been forwarded after obtaining a mandate. He said […]","content":"Chief Opposition Whip Lakshman Kiriella said in Parliament that the International Monetary Fund (IMF) has also changed its “tune” as it had earlier said in September that a mandate is needed if economic reforms are to be carried out. MP Kiriella asked whether the conditions have now been forwarded after obtaining a mandate. He said the government should have gone to the IMF by having negotiations with the Opposition initially. He said it is now difficult to support the government when the people are under severe pressure.","pubDate":"2023-03-24 06:23:09","id":"e90aad36-d5ba-43fd-aa08-140c0f44364e"},{"title":"Spotify goes on amapiano tour in South Africa","link":"https://www.newzimbabwe.com/spotify-goes-on-amapiano-tour-in-south-africa/","description":"NewZimbabwe.com – The Zimbabwe News You Trust is Zimbabwe’s leading online newspaper and published by New Zimbabwe Media Ltd. The platform brings you the latest breaking News, Business, Showbiz, Sports, Diaspora and gives you everything you’ve come to expect and love.","content":"By Music Africa\n\nOrganised in partnership with South African Tourism, the tour, designed around some of Spotify’s most popular amapiano playlists, sought to highlight South African and amapiano culture to content creators from Nigeria, Kenya, Ghana and South Africa.\n\nThe tour also aimed to impress on the guests the power of collaborations and how streaming is helping to export local music to the world.\n\nThe tour started off with Amapiano 101(link is external) detailing the background of the genre and giving guests an opportunity to experience its origins in townships like Mamelodi before exploring other popular amapiano spots in Soweto.\n\nDuring the session, one of the genre’s leading artists, Focalistic, dropped by at Jack Budha in Mamelodi, one of the birthplaces of amapiano, to share the genre’s origin story.\n\n“We would come here and listen to amapiano sets for three hours,” Focalistic said. We wanted to escape from the noise and do our own thing as Africans, speak in our tongue. Amapiano makes an imprint, it’s emotions. Amapiano is spiritual.”\n\nThe Amapiano Grooves(link is external) segment showcased the impact of clubs on the genre. Here the visitors got to hear cultural stories like that of Mogodu Monday, the tradition of celebrating the least popular day of the week with mogodu (tripe) and music. The participants also got the opportunity to meet with local artists in the studio to see where the music happens.\n\nSpotify data show amapiano received close to 2 billion streams last year, representing a 143% year-on-year increase. The genre has garnered a huge following, with more than 240 000 playlists featuring amapiano in the title and over 10 million playlists featuring at least one amapiano track. Interestingly, more than 40% of amapiano streams come from listeners outside South Africa, making it the country’s hottest cultural export.\n\n“Amapiano’s unique sound and infectious beats have captivated audiences around the world and is sure to keep fans dancing for years to come,” Spotify’s sub-Saharan Africa managing director, Jocelyne Muhutu-Remy, said. “As more artists emerge and push the boundaries of the genre, there is no doubt that amapiano is set to become a mainstay in the global music scene.”\n\nNigerian artist WurlD, who also attended the first day of the tour, spoke about why amapiano is so popular around the world: “Music is spiritual, amapiano is spiritual. I was a fan, watching from a distance. Music is energy, what people are experiencing with amapiano is the heart and soul of the people of South Africa.”\n\nSpotify also says that listeners love tuning into the genre on weekday afternoons, with peaks on Friday evenings. Amapiano Grooves, Spotify’s biggest amapiano playlist, is most popular among 18 to 24 year olds, with most listeners hailing from South Africa, the UK, US, Mozambique, Botswana and Zimbabwe.\n\nTop streamed amapiano tracks on Spotify\n\nAbo Mvelo (feat. Mellow & Sleazy & M.J) Love & Loyalty (Believe) Ameno Amapiano Remix (You Wanna Bamba) Big Flexa Hamba Wena WATAWI (feat. Davido, Focalistic & Abidoza) Abalele Mina Nawe Champion Sound Tanzania\n\nTop streamed amapiano artists on Spotify","pubDate":"2023-03-24 06:22:36","image_url":"https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/24062201/DJ-Maphorisa.png","id":"493ee418-7774-4d91-8e89-eee8810b7d37"},{"title":"Man who hacked off electrician’s hands surrenders!","link":"https://srilankamirror.com/news/man-who-hacked-off-electricians-hands-surrenders/","description":"The suspect who hacked off the hands of an electrician in Koralawella, Moratuwa has surrendered to the Moratuwa Magistrate’s Court through a lawyer today (24). On March 21, the suspect hacked off the hands of the victim in an act of revenge and fled with the amputated hands. The injured victim is a 40-year-old resident […]","content":"The suspect who hacked off the hands of an electrician in Koralawella, Moratuwa has surrendered to the Moratuwa Magistrate’s Court through a lawyer today (24). On March 21, the suspect hacked off the hands of the victim in an act of revenge and fled with the amputated hands. The injured victim is a 40-year-old resident of Koralawella. The suspect had earlier too amputated another person’s arm. However, the hand had been reattached through a surgery. As a result, the police suspected the suspect may have taken away the amputated hands to prevent replantation surgery.","pubDate":"2023-03-24 06:20:16","image_url":null,"id":"0c88c2c4-b683-46ec-8bd5-45c3044f1931"},{"title":"France’s HDF Energy to develop Zimbabwe’s first hydrogen plant","link":"https://www.newzimbabwe.com/frances-hdf-energy-to-develop-zimbabwes-first-hydrogen-plant/","description":"By Reuters HARARE: Zimbabwe’s state-owned electricity distributor has signed a memorandum of understanding (MoU) with French independent power producer HDF Energy (HDF.PA) to develop the southern African country’s first green hydrogen power plant, the companies said in a joint statement on Thursday. President Emmerson Mnangagwa witnessed the signing of the MoU worth $300 million between the The post France’s HDF Energy to develop Zimbabwe’s first hydrogen plant appeared first on NewZimbabwe.com.","content":"HARARE: Zimbabwe’s state-owned electricity distributor has signed a memorandum of understanding (MoU) with French independent power producer HDF Energy to develop the southern African country’s first green hydrogen power plant, the companies said in a joint statement on Thursday. President Emmerson Mnangagwa witnessed the signing of the MoU worth $300 million between the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) and HDF Energy, Zimbabwe’s Ministry of Information said on Twitter. “The plant will produce green power 24/7 feeding into the grid… The annual electric production will be 178 GWh, providing electricity to more than 220,000 inhabitants,” the statement said, adding that it will be located in southeastern Chipinge district. HDF said it expected to reach a financial close on the project and start construction in 2024-2025. The signing of the MoU comes amid Zimbabwe’s bid to diversify its energy mix, following reduced power generation after a big drop in water levels in Lake Kariba. “This is an encouraging milestone for ZETDC as it comes at a time when the government is encouraging the transition to renewable energy,” engineer John Diya, who was representing the distributor’s acting managing director, said. Zimbabwe’s government has also set its sights on producing over 1,000 megawatts from to help narrow the severe energy deficit currently being experienced in the country.","pubDate":"2023-03-24 06:17:13","image_url":null,"id":"21cd3636-5b94-4f40-b182-23e99ebb3ae1"},{"title":"One chopped by an axe, another shot by catapult as Zanu PF thugs bash each other in Mash West","link":"https://www.myzimbabwe.co.zw/news/107294-one-chopped-by-an-axe-another-shot-by-catapult-as-zanu-pf-thugs-bash-each-other-in-mash-west.html","description":"SANYATI, in Mashonaland West province, reportedly turned into a war zone this week as rival aspiring Zanu PF candidates bludgeoned each other ahead of the party’s primary elections set for tomorrow. The violence in Sanyati follows more terror attacks that rocked Chegutu West as rivals there also beat each other up in the run up","content":"SANYATI, in Mashonaland West province, reportedly turned into a war zone this week as rival aspiring Zanu PF candidates bludgeoned each other ahead of the party’s primary elections set for tomorrow.\n\nThe violence in Sanyati follows more terror attacks that rocked Chegutu West as rivals there also beat each other up in the run up to the weekend primaries.\n\nA video of one of President Emmerson Mnangagwa’s lawyers, Advocate Thembinkosi Magwaliba, attacking supporters of Mines deputy minister Polite Kambamura also emerged.\n\nKambamura is the sitting Sanyati Member of Parliament (MP), who is being challenged by Magwaliba and Gokwe-Nembudziya MP Justice Mayor Wadyajena’s younger brother, Tatenda.\n\nNewsDay is reliably informed that some Zanu PF supporters have reportedly abandoned their homes following the violence that flared up at Kasirisiri business centre on Tuesday.\n\nTwo of the aspiring MPs for the Sanyati seat accused each other of fomenting the violence when contacted for comment.\n\nOne of the victims, Beauty Jeremiah, who is the Zanu PF Kasirisiri district chairperson, accused Magwaliba of sponsoring the violence.\n\n“Magwaliba’s supporters have been going around threatening to come during the night and abduct Kambamura’s supporters and some people are now afraid of staying at their homes,” Jeremiah alleged.\n\nAccording to Jeremiah, two teenage boys were stabbed for refusing to chant Magwaliba’s slogans at a rally the aspiring MP was addressing at Kasirisiri business centre on Tuesday.\n\n“His (Magwaliba) supporters are threatening those who support Kambamura, unleashing violence, while boasting that he is Mnangagwa’s lawyer and that he will cause the release of his supporters who would have been arrested,” Jeremiah said.\n\nMagwaliba denied fuelling the violence, claiming he was actually the victim.\n\nHe said four of his supporters were attacked by Kambamura’s loyalists.\n\n“One was chopped by an axe, another shot by a catapult, while the other two were stoned. Kambamura’s supporters ambushed my supporters as we tried to attend to someone they had axed and caused mayhem,” Magwaliba said.\n\n“I have not been retaliating. His supporters have been threatening my supporters. I preach peace at my rallies. Our innocent supporter was arrested and accused of assaulting Jeremiah. He has been released. All I can say is that Kambamura has been sponsoring violence.”\n\nKambamura was not answering his mobile phone, despite repeated efforts to contact him.\n\nMeanwhile, Zanu PF has barred all aspiring candidates from speaking to the media during the primary elections.\n\nAddressing a provincial co-ordinating committee meeting in Marondera, national political commissar Mike Bimha said: “As a party, this time, we are saying no candidate is allowed to speak to the media. We have only two people in the party who are allowed to comment, that is the party spokesperson (Christopher Mutsvangwa) and director for information (Tafadzwa Mugwadi).”\n\nAlso, Zanu PF secretary for transport and social welfare and Local Government minister July Moyo have ordered aspiring candidates to surrender constituency vehicles to the party or face disciplinary action.\n\n“Following a resolution by the national elections directorate, you are hereby instructed to immediately withdraw and pool all Zanu PF party constituency vehicles allocated to your province in order to enhance administration of the forthcoming Zanu PF party primary elections,” Moyo said in a memo dated March 20.\n\n“Additionally, all party officials, including provincial chairpersons, provincial secretaries for the commissariat and party employees, are prohibited from using official party vehicles during the forthcoming primary elections. Such vehicles must be surrendered to the provincial command centre under stewardship of the supervising politburo member for the duration of the party’s primary elections.”\n\nThe primary elections were initially scheduled for last week, but were called off at the last minute.\n\n— NewsDay\n\nBreaking News via Email","pubDate":"2023-03-24 06:15:31","image_url":"https://z9g8vp.c2.acecdn.net/wp-content/uploads/2019/12/catapult_600x395.jpg","id":"a009453c-ea52-4296-bb3c-f8fc40da7bf5"},{"title":"Zimbabwe’s Financial Intelligence Unit targets assets of diplomat, gold dealer","link":"https://www.newzimbabwe.com/zimbabwes-financial-intelligence-unit-targets-assets-of-diplomat-gold-dealer/","description":"NewZimbabwe.com – The Zimbabwe News You Trust is Zimbabwe’s leading online newspaper and published by New Zimbabwe Media Ltd. The platform brings you the latest breaking News, Business, Showbiz, Sports, Diaspora and gives you everything you’ve come to expect and love.","content":"Spread This News\n\nBy News24.com\n\nThe Reserve Bank of Zimbabwe (RBZ), through its Financial Intelligence Unit (FIU), intends to freeze suspected ill-gotten wealth belonging to prosperity gospel preacher-cum-diplomat Uebert Mudzanire and politically connected gold dealer Ewan Macmillan.\n\nMudzanire is also known as Prophet Uebert Angel.\n\nThe RBZ announced the move hours before the airing of an Al Jazeera documentary about illicit trade, smuggling and money laundering in Zimbabwe.\n\nThe exposé implicates the RBZ and senior government officials in the illegal black-market trade.\n\nMudzanire and Macmillan are subjects of the Al Jazeera investigation.\n\nThe four-part documentary, titled Unveiling Zimbabwe‘s Dark Secrets: Al Jazeera Exposes Looting, Plunder and Money Laundering, was meant to be broadcast earlier this month but was pushed back.\n\nDuring that time, RBZ governor John Mangudya moved to defend the bank from defamation by those implicated in the syndicate because they risked bringing Zimbabwe to the attention of the Financial Action Task Force (FATF), risking potential greylisting.\n\nGreylisting would result in the flagging of all transactions of Zimbabwean companies and individuals as high-risk, resulting in complicated compliance and administrative duties. This would likely result in lower investment and trade opportunities.\n\nMangudya fell short of calling Al Jazeera fake news purveyors because, in snippets shown during adverts for the investigation, one of the subjects was filmed claiming he had the RBZ governor on speed dial and Zimbabwe was “southern Africa’s laundromat”.\n\nThe investigation’s first episode was broadcast on Wednesday.\n\nAsset freeze\n\nIn a letter addressed to Zimbabwe’s Insurance and Pensions Commission, the FIU requested the identification of any assets insured in the names of Mudzanire and Macmillan.\n\nAlso wanted are properties once owned but disposed of by the two between January 2020 and March this year, “directly or indirectly through companies or trusts”.\n\nThe time frame covers the period that Al Jazeera undertook investigations for the four-part documentary.\n\nThe letters were also sent to other financial institutions and asset managers such as banks and the information should be submitted by the end of Thursday – a few hours before the documentary airs.\n\nUnder normal circumstances, the FIU will request similar information from other countries as they follow the trail of alleged illicit finances.\n\nComment from Mudzanire and Macmillan will be added once received.","pubDate":"2023-03-24 06:06:39","image_url":"https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/24060618/Prophet-Uebert-Angel.png","id":"7bb2f9c4-5dfc-4227-90c2-2e51b7c055b9"},{"title":"Gold smuggler tied to Kenyan plunder is back — now in Zimbabwe","link":"https://www.newzimbabwe.com/gold-smuggler-tied-to-kenyan-plunder-is-back-now-in-zimbabwe/","description":"NewZimbabwe.com – The Zimbabwe News You Trust is Zimbabwe’s leading online newspaper and published by New Zimbabwe Media Ltd. The platform brings you the latest breaking News, Business, Showbiz, Sports, Diaspora and gives you everything you’ve come to expect and love.","content":"Spread This News\n\nBy Al Jazeera\n\nA gold smuggler implicated in a scandal that robbed Kenya of 10 percent of its GDP in the 1990s has moved his smuggling operation to Zimbabwe and Dubai, Al Jazeera’s Investigative Unit (I-Unit) can reveal.\n\nKamlesh Pattni was involved in the so-called Goldenberg scam, a gold smuggling operation that robbed Kenya of $600mn and led to charges of corruption against many members of then President Daniel Arap Moi’s government. After years of prosecution, Pattni was acquitted.\n\nPattni, who later became a self-proclaimed pastor and sometimes goes by the name Brother Paul, is now running a similar scheme in Zimbabwe from his base of operations in Dubai.\n\nThe revelation is part of Al Jazeera’s Gold Mafia, a four-part series investigating some of Southern Africa’s largest gold smugglers and money launderers.\n\nUndercover Al Jazeera reporters pretending to be Chinese criminals were offered several options by Pattni to launder more than $100mn.\n\nHe would do this by effectively turning the dirty money into gold that is exported from Zimbabwe to Dubai, where Pattni owns several gold-trading companies.\n\nPattni exports gold bars and jewellery from Zimbabwe through his company Suzan General Trading, which gets paid an incentive by the government to sell gold overseas.\n\nThe plan Pattni suggested would mean the dirty money, in US dollars, would be flown to Harare, where it would be declared as the proceeds of the gold exported by Suzan General Trading.\n\nThat money is then used to buy more gold in Zimbabwe, which would then be exported to one of Pattni’s Dubai-based companies.\n\nOwning both the exporter in Zimbabwe and the importer in Dubai gives Pattni the opportunity to launder the money, which would then be paid into a Dubai bank account and would appear to come from legitimate gold trade. Pattni himself would take a 10 percent commission.\n\n‘Always have the king with you’\n\nDuring the secretly recorded conversations with Al Jazeera reporters, Pattni claimed that the country’s president, Emmerson Mnangagwa, was aware of his gold-smuggling and money laundering operations.\n\nWhen asked about Mnangagwa’s involvement, Pattni said: “He knows of course, yes. But he can’t, he will not talk too openly.”\n\n“When you work you must always have the king with you, the president.”\n\nPattni showed several WhatsApp conversations he allegedly had with Mnangagwa, adding that “he has to be informed”.\n\nThe scheme helps Zimbabwe secure large amounts of US dollars, a hard currency the country can then use on its internal and international markets at a time when its own currency has lost much of its global standing because of hyperinflation.\n\nGoldenberg scandal\n\nSince the 1990s, Pattni has cultivated close ties with several leaders all over Africa, and was quick to boast of that proximity while speaking with Al Jazeera’s reporters. He showed them photos of himself with former Libyan President Muammar Gadaffi, former Zimbabwean President Robert Mugabe and ex-Kenyan presidents Daniel Arap Moi and Mwai Kibaki.\n\nHis rise to power started in his home country Kenya — at a tailor’s shop in Nairobi. At a time when Western sanctions were strangling the country’s economy in the 1990s, Pattni told our reporters that he bumped into the East African nation’s head of intelligence while looking for a suit. He offered to bring in revenue in exchange for gold. Pattni claimed the intelligence officer took him to meet President Arap Moi.\n\nPattni’s company, Goldenberg International, was granted an exclusive licence to export Kenyan gold, but instead, he allegedly smuggled gold from what is now the Democratic Republic of Congo.\n\nThat gold was then sold abroad, while Pattni’s company allegedly charged the government a 35 percent commission. He told our reporters he was an “adviser” to Arap Moi, who was under growing domestic and international scrutiny over his refusal to allow multi-party elections.\n\n“In 1992, there was a lot of fights, riots in the street and they wanted [a] multi-party [system],” Pattni said. “We advised just make it multi-party because ‘the money is with you, you will still win [the election].’”\n\n“I help[ed] the president to survive.”\n\nAfter Arap Moi eventually left office in 2002, Pattni was charged with several counts of fraud in a court case that would drag on for more than a decade. Arap Moi and many members of his government were also implicated in the scandal, and were accused of receiving bribes from Pattni and his aides. But Pattni was eventually acquitted — and no one has been convicted for the scam.\n\nWhen asked to explain the revelations emerging from Al Jazeera’s investigation, Pattni denied any criminal wrongdoing in Kenya and emphasised that he had never been convicted in relation to his activities in that country. He denied involvement in any kind of money laundering, as well as employing anyone to smuggle cash or offering to deal with funds he knew originated from illegal sources. He said that when he met with Al Jazeera’s undercover team, he thought he was meeting with an investor who wanted to buy a stake in hotel businesses and “to divest of a portfolio in China into gold buying and mining in Zimbabwe”.\n\nOther individuals and entities mentioned in this report did not respond to Al Jazeera’s request for comment.","pubDate":"2023-03-24 06:02:05","image_url":"https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/24060119/Kamlesh-Pattni_.png","id":"565370c5-592f-4b8c-ab7c-8a9bb8403ac7"},{"title":"How COVID-19 Eroded Human Capital And What To Do About It – World Bank Expert","link":"https://independent.ng/how-covid-19-eroded-human-capital-and-what-to-do-about-it-world-bank-expert/","description":"Independent.ng - Nigeria News - Top Nigerian newspapers - Breaking news - Top news headlines from Nigeria and World.","content":"The COVID-19 pandemic caused a massive collapse in human capital at critical moments in the life cycle, derailing development for millions of children and young people in low-and middle-income countries, according to Collapse and Recovery: How COVID-19 Eroded Human Capital, and What to do About It, the first analysis of global data on young people under the age of 25. What were the losses for young people and developing economies, and can they be recovered? What lessons learned can we take forward to prevent future crises? To help us learn more, Norbert Schady, Chief Economist for Human Development at the World shades some light in this interview.\n\nI want thank you so much for joining me here on Expert Answers today on a very beautiful day, and we’re lucky enough to be at an early childhood development center to talk about this report that you’ve co-authored. It’s called Collapse and Recovery. And before we get into the specifics of it, it talks about the effects that the pandemic has had on this thing called human capital. Can you tell me what is human capital and why is it so important?\n\nHuman capital is what some people refer to as wealth embodied in people. And what I mean by that is it’s the characteristics, the things that people have acquired, especially in their early years that make them more productive later on.\n\nIt really embodies a lot of different components of the skills that people have. And what I mean by that is, on the one hand, it’s the learning they’ve acquired over time, but it’s also things like their health status that makes them be able to be more productive.\n\nIt’s their social-emotional development. So, what we call emotional intelligence, all of these things together are what people call human capital.\n\nIn that sense, I want to describe three things that are particular about the way in which human capital accumulates which are really worth keeping in mind when you think about what did the pandemic do.\n\nThe first is that human capital is cumulative, or the way in which it accumulates is sequential. And what happens at one stage in the life cycle builds on what happened before and in turn affects what happens later on.\n\nSo, you can’t really take a particular chunk out of a lifecycle or a particular, you know, couple of years of the lifecycle, see what happened to these people without really understanding what happened before and after.\n\nPOLL\n\nThe second thing is that the rate at which human capital accumulates is much steeper if you want, early on in a person’s life than later on when they’re primarily working or eventually are in old age.\n\nSo, these two characteristics and the fact that also that human capital is multidimensional that it’s really this integral process makes it different from other forms of capital and makes it particularly important that we look at the effect the pandemic had at the first if you want quarter century yourself a person’s life which is when human capital accumulates most rapidly.\n\nSo Norbert, let’s talk specifically about the developmental stages because you know, this report really is a comprehensive analysis of global data for, like you said, people under the age of 25. And I believe you identify three critical life stages. Can you talk more about those and how the pandemic has impacted each one?\n\nWhat we do is we first look at children who are of an age before they enter formal schooling in most countries.\n\nSo, these are children five and under. Then we look at children who are school age at a time when most are not yet considering working.\n\nAnd so, we look at children between the ages of 6 and 14 and then we look at youths, individuals between the ages of 15 and 24 which is the point at and time at which individuals are either entering the labor market or making decisions about whether to continue their schooling.\n\nSo first, looking at individuals between the ages of zero and five. What we do there is in some sense we look at children under the age of three or under and those were four and five because the kinds of services that governments provide generally are quite different for three and under a year old and four and five year olds. But, what we show is regardless of the age, what we show is that there were serious declines in immunization coverage.\n\nThere were increases in food insecurity. And here’s where the age distinction comes into play for four and five year olds, where a substantial proportion of them are enrolled in preschool in particular middle-income countries, preschools shut down for inordinately long periods of time.\n\nSo, these children were kind of locked out of school literally. And I say this distinction is important because in most developing countries the coverage of if preschool or daycare for zero to three year old is very low.\n\nSo, we see this sort of shutdown of critical services that these young kids need. And perhaps not surprisingly, we see these alarming declines in child development. And I just want give one example which refers to cognitive development.\n\nCognitive development is very highly predictive of how well these children do eventually in school and even later in the labor market.\n\nIn Bangladesh, data that we collected for this report, we compare a cohort of children who were roughly two years of age in 2019 before the pandemic hit. And then we went back to those same villages and collect the data on a new cohort of children also 24 months of age or so in 2022.\n\nAnd what we find is these alarming declines in child cognition, in child cognitive development declines that we know contrary what is popular perception these children are not going to make up on their own.\n\nSo, it really is a very serious concern what happened to young children. And one that has been under-emphasised in the policy dialogue, I think.\n\nThen we go to school-aged children. And what we show there is that in developing countries, roughly one billion children, this is not one million, this is one billion.\n\nIt’s very rare to be talking about billions of people being affected by something. This is one billion children in developing countries missed a year of school or more.\n\nDespite widespread efforts by governments everywhere to put in place some form of remote instruction or hybrid schooling, the average child learned close to nothing during that time that they missed schooling.\n\nActually, if you want unlearned some of what they already knew.\n\nWow?\n\nAnd what I mean by that is you can imagine a girl who perhaps was 10 years old when the pandemic hit who knew how to add and subtract and was meant to learn how to multiply and divide thereafter.\n\nSo, not only did she not learn how to multiply and divide because schools were closed and the remote instruction didn’t work, but she actually forgot how to add and subtract because this is a cumulative process.\n\nIt’s not like, oh, well they didn’t learn that so let’s just move on. And they can learn the next time. You don’t know how to divide, you’re not going to be doing higher level math obviously.\n\nSo, this is really a critical finding as well. Finally, when we look at young people, what we find is large declines in their labor force participation and large declines also in various other indicators of job quality, for example, wages.\n\nNow one might say, well this wouldn’t be a problem if these individuals who normally would’ve gone to work are now going into school. But we don’t find that by and large. So, there are a lot more if you want NEETs.\n\nNEETs are individuals who are neither in employment or education or training. If you want idle youth, there are more NEETs throughout the world as a result of the pandemic. For example, in Pakistan alone, we estimate that an additional 1.6 million youth are NEETs, who would not, in the absence of the pandemic, have been this. What we also find that the recovery post if you want the most acute phase of the pandemic has been very uneven.\n\nIn some countries we do see a recovery in youth employment and in many countries we don’t.\n\nSo, the impact of the pandemic obviously far-reaching and global, but you really focuses on developing countries here. Tell me more about how developing countries have been uniquely impacted by the pandemic and what are the implications really when you think about poverty?\n\nI mean we know for example, that in terms of economic recovery and in terms of the recovery of overall employment the recovery in developing countries has been slower.\n\nThere are a variety of reasons for that including the ability of richer countries to invest more to recover the economy. But moreover, almost consistently the levels of human capital in these countries are much lower than those in developed countries.\n\nThe years of schooling and how much kids learn in school are obviously very different. If you’re looking at Finland and you say, well, let’s look at what the levels of human capital were even in the absence of the pandemic were in, say, Chad, we’re talking about radical differences.\n\nOf course?\n\nHaving even further declines of human capital in these countries where human capital was already very low to begin with is really particularly alarming.\n\nHuman capital is a fundamental driver of economic growth.\n\nSo taking, you know, reducing the levels of human capital for countries that already were struggling with having sustained reasonable levels of growth is really, really a problem. And that all sounds kind of abstract, but if you take it one level down and you go down now to what it means for individual people, it means we estimate that the declines in human capital amongst people in developing countries could lead to, if unremedied could lead to declines in their lifetime earnings of between 10 and 20%.\n\nNow, this is really serious. In the Bank, we use the word a ticking time bomb because in a way this is going to take some time to work its way through.\n\nRight.\n\nIf you want, as these kids age. The cohorts that were most affected by the pandemic are going to be 90% of the prime age workforce in 2050. Not only that, the impacts is largest for those who are already poorest to begin with.\n\nSo, children or young people whose parents are low levels of education.\n\nSo, we’re saying that we are already living through an age as many have pointed out, in which inequality has been rising dramatically for a variety of reasons. And public policy has been struggling to address that in both wealthy countries as well as lower-income countries. Now we’re saying we’ve kind of turbocharged that.\n\nSo, these are really, there are concerns obviously. The effects of the pandemic are concerns for both developed and developing countries, but I think they’re particularly dire for developing countries and particularly dire also because they have the fewest resources to really address this in the short term.\n\nYeah, and I mean just that idea of a ticking time bomb, it’s like the time to act really is now, right?\n\nWell that’s right.\n\nWe can’t really wait to fix this. So, speaking of that, you’ve really laid out the scale of the problem here Norbert. So, how do we fix this, you know, what can we do and what can countries do, do you think in the long term to better prepare against future crises?\n\nWe divide the policy responses into, if you want two groups. One are things that countries should do right away to try to recover some of this human capital. And the other is sort of systemic changes that they should begin now to prepare for crisis in the future.\n\nThe window of opportunity to remedy, revert, some of these shortfalls is short. And that sounds kind of redundant, but it really is so. And the reason is if kids come back to school just to use that example and they don’t understand anything that’s happening and six months later they still don’t understand anything that’s happening, well they’re not going to stick around school forever.\n\nSo, we are perpetuating the problem, making it worse. These kids are going to drop out of school.\n\nSo, a really important point we make, and then I’ll give you some specific examples is that, you know, we used to be on a trajectory of human capital if you want that rose steeply, and then more gently and just to get back to a parallel trajectory so lower, but parallel to that requires serious investments. Because if we don’t do anything, what the default if you want is not just that they don’t make that up, but they keep on furthering, they keep on falling further and further behind.\n\nSo just to, like I said, have lower levels of human capital, but levels of human capital are not declining more in the future already requires a concerted effort by government.\n\nTo get to a trajectory that puts you back where you were before requires very serious effort and very serious policy attention by governments.\n\nIt means that for every year now we need to put in place policies that allow individuals to learn more if you want, while they’re in school or have higher growth rates in their child development when they’re younger than they did before.\n\nSo, this is really, really a tall order for countries. And so, one of the pieces of advice we give governments is rethink your curriculum. Your school curriculum.\n\nSchool curriculums are already overburdened if you want in many developing countries. And this is the time to particularly prioritise those skills that if you don’t pick up now, you really aren’t going to pick up later and that are going to determine what happens to you in your life for a long time.\n\nAnd the critical thing about this example is that, that actually doesn’t cost a lot of money.\n\nIt’s an issue of political will, sort of saying, okay, this is important, we’re going to do it. And it’s an issue of, if you want, implementation capacity to actually make that happens.\n\nBut ,there’s a second basket of interventions that are not specific to each sector. And let me give you a little bit of background on that.\n\nGovernments, who responded well, were able to in some cases expand the coverage of existing programs either increase the number of people who were in them or increase the intensity of those programs. And that sounds a little bit vague.\n\nLet me give you an example. Many programs, many countries had cash transfer programs in place. So, they were either able to increase the amount given to existing households in the cash transfer program to protect them against the shock or increase the coverage. So, bring in additional households who normally would not have been in the program.\n\nSo, there were responses that governments took that were somewhat effective as best they could, they took these. But there were responses by and large, with very few exceptions, they were responses that actually affected only one program or at best one ministry. And so, where we find the biggest, if you want shortages or the biggest limitations of government responses was in the ability to coordinate these different investments and to rethink them as more data came in from the pandemic.\n\nBut, countries that had been faced with something like this before were better able to resolve those coordination problems and those, if you want, that necessity to resolve trade-offs. And I’m going to give you two examples sort of, if you want, at different ends of the income spectrum.\n\nYeah.\n\nOne example comes from West Africa and these are countries that were sadly suffered from the Ebola epidemic in 2014.\n\nIn 2014 they were responded as best they could. It was an unexpected dramatic shock.\n\nThey shut down schools, there was a public health emergency. All of these things that we see now in the pandemic happened to some extent in these countries. And as a result they were able to learn from that and they were more effective at responding to the pandemic than other countries of similar even higher income levels who hadn’t been faced with a shock like that.\n\nAnd at the other end of the spectrum, you have a country like Finland where there is a body of high level government authorities and experts who meet once a month in order to, if you want, game out how to respond to particular kind of national shock.\n\nWow.\n\nSo, it could be something like there is no power in the country for three days. It could be something like there is a pandemic and every month they meet and on the basis of that they have recommendations to the higher levels of government.\n\nAnd look, if you really want to prepare for the next aggregate shock, you need to think about this and you should do this, for example, stock up on face masks and things like that.\n\nSo, at both ends of the spectrum, there really is an ability to really learn from the current pandemic. We all want to just put it behind us and think about something else. But I think that will be a mistake.\n\nAnd I think this is the opportunity to learn about how better to coordinate these investments in the future to make sure that we are, the countries are in a better position to respond to future shocks, be there climate shock, a war, a famine or God hope not, another pandemic.\n\nSo Norbert, we’ve talked about some pretty heavy issues here. So, I do want to end this on a bit more of a personal note. For someone like yourself who’s been so heavily involved with this research and this report what really resonated with you and what kind of leaves you feeling hopeful regardless of kind of what we’ve talked about here today?\n\nSo, one thing that resonated with me, Sri, very deeply is the fact that the effects of the pandemic on human capital were regardless of the age group, regardless of the outcome, regardless of the country were invariably worse for households with fewer resources. And I want to share just one anecdote.\n\nA couple of years ago I was traveling in, again in Peru in northern Peru with my family. And I remember seeing waves of Venezuelan refugees that were streaming across the border into Peru. And these were people who left everything behind who just were literally were walking northern Peru. This is through a desert. They were walking on the Pan American highway the main highway with nothing, with young children, whatever, just and you sort of sit there and think to see that people like these or other people like these poor people who really had so little to begin with, that they’ve been deprived of sort of these critical investments that would’ve allowed them to aspire to a better life.\n\nWe do have interventions that we know actually can make a difference at this juncture. We have interventions in education, we have interventions in health, we have interventions in nutrition, in social protection that has been tried in many countries.\n\nRight.\n\nIt’s a situation where this was terrible. It continues to be terrible and it’s important to remind decision makers of that.\n\nBut, there are things we can do to at least partly, hopefully fully redress some of these costs to those who are most vulnerable in the developing world.\n\nWell, on that note, Norbert, I want to thank you again so much for joining me here on Expert Answers to talk more about the report Collapse and Recovery. I really appreciate your time.\n\nThank you, Sri.","pubDate":"2023-03-24 04:49:12","image_url":"https://independent.ng/wp-content/uploads/cropped-INL-Favicon-32x32.png","id":"67647e44-7e96-4c86-8517-11518e4e7238"},{"title":"NIHRCO Rates INEC Performance High, Recommends Continuous Usage Of BVAS","link":"https://independent.ng/nihrco-rates-inec-performance-high-recommends-continuous-usage-of-bvas/","description":"Independent.ng - Nigeria News - Top Nigerian newspapers - Breaking news - Top news headlines from Nigeria and World.","content":"Nigerian Human Rights Community (NIHRCO), a coalition of over 100 civil society and community based groups has rated the performance of the Inde­pendent National Electoral Commission (INEC) in the governorship and house of assembly elections high.\n\nThe group also recom­mended that the Bio-modal Voter Accreditation System (BVAS) should continue to be used with rooms for subse­quent elections, but said there is room for improvement.\n\nTaiwo Adeleye, Convener of NIHRCO stated this yester­day in Lagos, during an inter­action with the media.\n\nAdeleye explained that the elections were generally peaceful in the state.\n\n“We recognize that the elec­tion was conducted in a dem­ocratic manner that largely meets local and international expectations. The outcome of the election truly represents the wishes and aspirations of the people of Lagos.\n\n“The candidate announced by the Independent Electoral Commission, Babajide San­wo-Olu represents the will of the people while the results declared by the electoral um­pire are a true reflection of the aspirations of the people of Lagos.\n\n“We call for healing of wounds and fractured hearts. We are impressed by the statement credited to the Lagos State Governor that he would again meet all stake­holders to ensure ethnic and religious harmony in Lagos State, a condition needed for prosperity to reign,” he said.\n\nAdeleye said that the role of building confidence in the electorate does not lie solely with the government alone, stressing that the civil society and community based organ­isations also had important roles to play in ensuring peace and orderliness in Lagos State.","pubDate":"2023-03-24 04:48:34","image_url":"https://independent.ng/wp-content/uploads/cropped-INL-Favicon-32x32.png","id":"ee7746b4-1763-4538-868d-8bb755f18922"},{"title":"Lowry's tiebreaking goal sends Jets to 3-2 win over Ducks","link":"https://www.richmond-news.com/hockey/lowrys-tiebreaking-goal-sends-jets-to-3-2-win-over-ducks-6751376","description":"ANAHEIM, Calif. (AP) — Adam Lowry scored the tiebreaking goal with 9:13 to play and the Winnipeg Jets made progress in the playoff race with a 3-2 victory over the Anaheim Ducks on Thursday night.","content":"ANAHEIM, Calif. (AP) — Adam Lowry scored the tiebreaking goal with 9:13 to play and the Winnipeg Jets made progress in the playoff race with a 3-2 victory over the Anaheim Ducks on Thursday night. Kyle Connor scored his 28th goal and Connor Hellebuyck made 18 saves for the Jets, who opened a three-game California road trip with their third victory in four games. After Frank Vatrano tied it for Anaheim early in the third with a power-play goal, Lowry put the Jets back ahead with a short redirection of a pass from Brenden Dillon for his third goal in four games. Mason Appleton scored the first goal for Winnipeg, which has beaten Anaheim in five straight meetings, including a three-game sweep this season. Winnipeg is in the second wild-card slot in the Western Conference with 85 points and nine games to play, one point behind Seattle. Nashville, which beat the Kraken in a shootout earlier Thursday, is five points behind the Jets, but the Predators have three games in hand. Cam Fowler also scored and Lukas Dostal stopped 30 shots for the lottery-bound Ducks, who dropped to 1-4-1 on their eight-game homestand with their third consecutive defeat. Fowler scored his career-best 43rd point with a goal in the first period on a knuckling shot that threaded a path among three Anaheim teammates. Appleton evened it 45 seconds later and Connor then scored late in the second period on remarkably similar plays, knocking in loose pucks after rebounds trickled underneath Dostal. Vatrano tied it with a low shot from the blue line while Derek Grant screened Hellebuyck in a rare mistake by the Jets' second-ranked penalty killers. The goal was Vatrano's 18th of the season, matching his total in each of the past two seasons with Florida and the Rangers. UP NEXT Jets: At Los Angeles on Saturday. Ducks: Host St. Louis on Saturday. ___ AP NHL: https://apnews.com/hub/NHL and https://twitter.com/AP_Sports Greg Beacham, The Associated Press","pubDate":"2023-03-24 04:47:55","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/03/20230324000344-641d2ac5159068b7e1002e1bjpeg.jpg;w=960","id":"72d097bd-eac5-4961-905a-37dbef1d8db6"},{"title":"Mostly sunny on Friday, 22 C inland","link":"https://in-cyprus.philenews.com/news/local/mostly-sunny-on-friday-22-c-inland/","description":"Mostly sunny on Friday with possible isolated local showers. The winds will be variable, easterly to north-easterly, moderate to strong, force 3 to 4 Beaufort. And the sea smooth to slight. The temperature will rise to 22 C inland, 21 C to 22 C in coastal areas and 14 C in the mountains.","content":"Search News Local Mostly sunny on Friday, 22 C inland Mostly sunny on Friday, 22 C inland 1 hour ago googletag.cmd.push(function() { googletag.display('div-gpt-ad-1522825278556-0'); }); Mostly sunny on Friday with possible isolated local showers. The winds will be variable, easterly to north-easterly, moderate to strong, force 3 to 4 Beaufort. And the sea smooth to slight. The temperature will rise to 22 C inland, 21 C to 22 C in coastal areas and 14 C in the mountains. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1545053448854-0'); }); By Annie Charalambous Previous article Death of Ukrainian woman at Petra tou Romiou was accident, new autopsy finds Next article Tourists to get chance to walk in King Charles’ coronation footsteps","pubDate":"2023-03-24 04:39:08","image_url":"https://in-cyprus.philenews.com/wp-content/uploads/2020/03/sunny-8.jpg","id":"738b4f82-7119-4294-b90f-66e8dea7e4bb"},{"title":"Investors cautious on US stocks, even though Fed hikes may soon end","link":"https://cyprus-mail.com/2023/03/24/investors-cautious-on-us-stocks-even-though-fed-hikes-may-soon-end/","description":"The end of the Federal Reserve’s bruising rate hiking cycle may be in sight, yet investors are finding plenty to worry about when it comes to the US stock market. In its first meeting since the collapse of two US banks this month and the downfall of ailing European lender...","content":"The end of the Federal Reserve’s bruising rate hiking cycle may be in sight, yet investors are finding plenty to worry about when it comes to the US stock market. In its first meeting since the collapse of two US banks this month and the downfall of ailing European lender Credit Suisse, the Fed on Wednesday raised interest rates by a quarter of a percentage point and indicated it was on the verge of pausing further increases in borrowing costs. It was a message long awaited by many investors, after the S&P 500’s fall by nearly a fifth last year as the Fed launched its most aggressive monetary policy tightening cycle since the 1980s. Yet some fear the rapid rises in rates are only starting to ripple through the US economy, and remain wary of jumping into stocks amid banking sector turmoil, a downbeat outlook for corporate profits and a looming recession. “Macroeconomic policy and the outlook for the economy is more complicated than it was two weeks ago,” said Anthony Saglimbene, chief market strategist at Ameriprise Financial, who is holding a lighter than normal equity allocation. “In that highly uncertain environment, you need to navigate it by being a little bit more cautious and a little bit more defensive,” he said. Stocks fell on Wednesday, with the benchmark S&P 500 (.SPX) closing down 1.65 per cent after swinging between gains and losses during Fed Chairman Jerome Powell’s press conference following the meeting. The Nasdaq Composite (.IXIC) lost 1.6 per cent. Adding to the market unease were comments from Treasury Secretary Janet Yellen, who told lawmakers on Wednesday that the Federal Deposit Insurance Corporation (FDIC) was not considering “blanket insurance” for deposits arising from recent strife in the sector. Banking industry stress could trigger a credit crunch with “significant” implications for an economy that Fed officials projected would slow even more this year than previously thought, Powell said. Analysts at Capital Economics, who believe a recession is likely this year, wrote: “While … the exact impact of the banking turmoil is uncertain, we are now more confident that the Fed’s forecasts for economic growth will prove too optimistic.” Meanwhile, though the Fed’s latest policy statement no longer said that “ongoing increases” in rates would likely be appropriate, Powell said that inflation remained well above the Fed’s goal and that policymakers were unlikely to cut rates this year, an outlook at odds with that of many investors. Futures markets are now pricing a Fed funds rate of around 4.25 per cent by year-end, compared with the range of 4.75 per cent to 5 per cent that took effect on Wednesday. “Sure equities would like a Fed pivot or a point that the Fed would slow down rate hikes, which I think is what they got,” said Charlie Ripley, senior investment strategist at Allianz Investment Management, who has recently increased his allocation to cash. “Powell also said he doesn’t view that rate cuts are plausible at some point this year, so this whole higher-for-longer theme is likely what’s playing out.” Stocks have been resilient this year in the face of uncertainty, with the S&P 500 up 2.5 per cent since the end of 2022. Many investors’ portfolios remain light in equities, a market condition some view as a positive for stocks because of the potential for powerful buying when the market mood shifts. Deutsche Bank’s measure of aggregate equity positioning saw its biggest drop in 15 months last week, the bank’s strategists said in a March 17 note. A drop in Treasury yields from recent highs has also given a tailwind to stocks, especially to big tech and growth names that are heavily weighted in the S&P 500. Yields move inversely to bond prices. Still, some investors believe yields may head higher again. Sonal Desai, chief investment officer of Franklin Templeton Fixed Income, said she was skeptical about the recent rally in Treasuries, because inflation remained high. “I think there’s more volatility to come, without a doubt,” said Desai, who expects the benchmark US 10-year yield will rebound to 4 per cent this year from its current 3.45 per cent. Corporate profits are another potential trouble spot, with S&P 500 earnings expected to post year-over-year declines in the first and second quarters after falling 3.2 per cent in the fourth quarter of 2022, according to Refinitiv IBES. That may not even fully reflect the fallout from a potential slowdown brought on by the banking crisis, should lending slow, as many analysts now expect. “I don’t think the market is going off to the races,” said James Ragan, director of wealth management research at D.A. Davidson. “There is going to be some pressure on earnings going forward.”","pubDate":"2023-03-24 04:30:49","image_url":null,"id":"83bed398-ffc4-42ce-86f1-069c34782f15"},{"title":"WWE 2k23 Review (Xbox Series X)","link":"https://411mania.com/games/wwe-2k23-review-xbox-series-x/","description":"Stewart Lange checks in with his review of WWE 2K23 on the Xbox Series X.","content":"Last year, WWE 2K22 re-launched the wrestling series after the 2K20 disaster and was met to reasonable acclaim from fans and critics alike, receiving an 8 out of 10 from yours truly (click on my name at the top of the article to read my thoughts). A revamped engine, control scheme tweaks and a graphics overhaul made it a much shinier experience than before and finally felt like a realised next/current gen wrestling release. As with most sports sims, though, we can’t expect huge progress every year and like FIFA or Madden, WWE 2K23 definitely suffers from the “just a roster update” illness that plagues these types of annual releases.\n\nThat’s not to say it’s bad at all, by any means. There wasn’t a massive amount of need to do much more graphically than a little tidy up on some character models and movements and these have absolutely been done with a high level of care and attention. There’s not the same level of noticable clipping of hair and clothing as I found there to be last year. The crowd motion and the overall presentation is the best it’s ever been, with the minute to minute gameplay flowing really nicely as well. It’s not night and day from last year but it is a little bit shinier and more polished and that’s all I feel like we’re likely to get throughout this generation of wrestling games. Along with the graphical polish comes the inevitable roster update with it, with the usual mixture of NXT, current and legendary superstars taking up spots. Thankfully, there are a lot of wrestlers that had been saved for DLC last year included within the game, such as the NWO, RVD and Logan Paul, however there are a couple of big missing names, most notably Bray Wyatt however he has been confirmed for an upcoming expansion, although the announced DLC lists really leave a lot to be desired when it comes to justifying my decision to lump in on the season pass edition of the game.\n\nImage Credit: 2K Games\n\nAny roster shortfalls can be made up for by the ever impressive create a wrestler mode and the always impressive community creations. There’s not much reinventing of the wheel to be done here but the create an entrance mode does have a more expansive list of familiar movements, allowing your Kenny Omega or CM Punk creations to have a little bit more flair and realism to them- or you can download from the number of fan-made creations already online within the first 24 hours of release which all look better than anything I could come up with between now and next years version of the game anyway. This year you can add these creations into the returning MyUniverse mode so you can fulfill all your WWE/AEW/NJPW invasion fantasies, like having only midcard stars make the jump and and have them buried by Roman Reigns. The MyGM mode and Showcase also return, with the Showcase mode having you take control of pivotal moments in the career of John Cena, although I couldn’t see the appeal. Awful jokes aside, this year there’s a nice twist, as it actually has you take on Cena as some of his opponents, giving you the chance to Never Give Up (registered trademark) as the man now known as Peacemaker.\n\nThe roster can be unlocked with virtual currency, which is earned by playing and having exciting matches but is unlocked most quickly by the MyFaction mode, a card battle game like Ultimate Team which this year is playable online. This does give it a slightly more important feel when compared to last year. This whole unlocking can be negated with the deluxe edition and the supercharger it provides, which I will say feels slightly cheap and took a large element of the whole reason to play away from me. With the whole roster available from the first button press of the game, I did struggle to motivate to play for fun, rather than the purpose of unlocking. It did give me the most options when it came to the MyGM and Universe modes, though. I’ll never get bored of putting Jake the Snake and Macho Man in an epic midcard battle for the ages while you position what the game sees as actual draws in the main even slots.\n\nThe biggest gameplay addition comes with the long awaited addition of War Games, which can be played now as a 3 vs 3 or a 4 vs 4. There aren’t too many pairings of superstars that make sense and sadly William Regal isn’t here to announce the match either, but you can choose either the Survivor Series or NXT arenas for the event and the cages are positioned behind the cage so you can get a good view of everything around. Unfortunately, the match itself becomes a mess once the action intensifies and heats up. As the rings fill up, the camera zooms out too far to really be able to tell who you’re targetting or worse, who is targetting you. My first experience with War Games became a button mashing exercise, with my aim to be to not be pinned while my team mates did the pro-active match winning. The chaos was certainly present but it didn’t lead to a fun match. Not to be deterred, I tried again but this time I found myself in a 3 on 1 beatdown in one ring while my “team” conducted a mugging of their own in the other side, with none of them once deciding to come to my aid. Technically and visually it’s very impressive but it needs to be refined somehow.","pubDate":"2023-03-24 04:07:13","image_url":"https://411mania.com/wp-content/uploads/2023/01/WWE-2K23-Drew-McIntyre-Roman-Reigns-cage-150x150.png","id":"8ca1a48e-1985-4e52-ae12-135893d83276"},{"title":"We Are Incapacitated- Teachers","link":"https://www.zimeye.net/2023/03/24/we-are-incapacitated-teachers-3/","description":"TEACHERS yesterday rejected government's 100% salary increase, saying they remain incapacitated, while accusing their employer of dishonesty after reportedly dodging wage talks under the National Joint Negotiating Council (NJNC). Government representatives reportedly dodged the NJNC meetings set for Thursday last week and Monday. In a memo addressed to Public Service Commission chairperson, Vincent Hungwe, dated…","content":"We Are Incapacitated- Teachers\n\nSpread the love\n\nTEACHERS yesterday rejected government’s 100% salary increase, saying they remain incapacitated, while accusing their employer of dishonesty after reportedly dodging wage talks under the National Joint Negotiating Council (NJNC).\n\nGovernment representatives reportedly dodged the NJNC meetings set for Thursday last week and Monday.\n\nIn a memo addressed to Public Service Commission chairperson, Vincent Hungwe, dated March 15, Finance ministry permanent secretary, George Guvamatanga, said COVID-19 allowances had also been increased from US$200 to $250 across sectors, excluding the health sector.\n\n“The increase in cushioning and COVID allowances from $200 to $250 across all sectors with exception to the health sector takes effect on March 1, 2023 for the security sector and April 1, 2023 for the rest of the civil service, taking into account March 2023 developments in the sector,” Guvamatanga said.\n\n“The approved review of 100% remuneration to grow (Zimbabwe dollar) emoluments from deputy director and below for all sectors, take effect on February 1, 2023 for the security sector and April 1, 2023 for the rest of the civil service.”\n\nTeachers have also been given an additional US$80 monthly teaching allowance.\n\n“This is an improvement to the school fees policy which discriminated against those teachers with no biological children, free primary school education up to a maximum of three children at government schools within the radius and introducing a government-funded funeral insurance framework,” Guvamatanga said.\n\nGovernment pensioners will now receive US$100 from US$90.\n\nTeachers yesterday accused government of not taking their plight seriously after allegedly not attending scheduled crunch salary talks.\n\nTeachers are demanding at least US$1 000 per month to make ends meet.\n\nBefore the latest salary offer, the least paid teacher was earning about $36 000, a US$120 component and a US$75 COVID-19 allowance.\n\n“Government can argue that they consulted in line with the Public Service Act and Statutory Instrument 141 of 1997,” Amalgamated Rural Teachers Union of Zimbabwe leader Obert Masaraure said.\n\n“This is why we have rejected the NJNC as it is ultra vires to section 203(1)(b) and section 65 of the Constitution under which conditions of service are fixed through collective bargaining. Big lesson to all our colleagues in labour is that the employer has no respect for the workers. Teachers remain incapacitated.”\n\nProgressive Teachers Union of Zimbabwe secretary-general Raymond Majongwe said they were already planning a strike before the latest salary offer.\n\n“The behaviour of the government representatives, and the principals they represent, is an assurance that they are spoiling for a fight, and that they are not likely to give us a living wage without being coerced by concerted worker action,” Majongwe said.\n\n“We are doing final consultations with other unions with a view to having concerted and combined courses of action so that we will not expose our members to the vagaries of the employer. We are exhorting all genuine unions to put shoulder to wheel and harness our efforts for the greater good.”\n\nEfforts to get a comment from Public Service ministry secretary Simon Masanga were in vain as he was said to be in a meeting.- NewsDay\n\nShare this: Tweet\n\n\n\n\n\nLike this: Like Loading...","pubDate":"2023-03-24 04:00:00","image_url":"https://i0.wp.com/www.zimeye.net/wp-content/uploads/2022/06/National-News.jpg?fit=750%2C370&ssl=1","id":"abf210b7-d9bc-4bd6-abac-e5dcacc3ad99"},{"title":"Who’s behind script of ‘Basil recordings’?","link":"https://srilankamirror.com/news/whos-behind-script-of-basil-recordings/","description":"An audio recording of a heated argument allegedly took place between Sri Lanka Podujana Peramuna (SLPP) National Organizer Basil Rajapaksa and former Moratuwa Mayor Saman Lal Fernando is currently circulating on social media sites. It is the opinion of social media users that this recording is a fabrication. Social media reported that this exchange of […]","content":"An audio recording of a heated argument allegedly took place between Sri Lanka Podujana Peramuna (SLPP) National Organizer Basil Rajapaksa and former Moratuwa Mayor Saman Lal Fernando is currently circulating on social media sites. It is the opinion of social media users that this recording is a fabrication. Social media reported that this exchange of words took place during a discussion held at the SLPP Head Office yesterday (23). A group meeting was held yesterday at the party office to discuss the upcoming elections and May Day. It is said that this argument took place between Mr. Rajapaksa and Mr. Fernando during this meeting.","pubDate":"2023-03-24 03:43:35","id":"3f96573e-0e80-4528-a3a1-b2b1533a1291"},{"title":"NHL team won't wear Pride jerseys, citing new Russian law","link":"https://www.nsnews.com/hockey/nhl-team-wont-wear-pride-jerseys-citing-new-russian-law-6744280","description":"CHICAGO — A National Hockey League team with a Russian player has decided against wearing special warmup jerseys to commemorate Pride night, citing an anti-gay Kremlin law that could imperil Russian athletes when they return home.","content":"CHICAGO — A National Hockey League team with a Russian player has decided against wearing special warmup jerseys to commemorate Pride night, citing an anti-gay Kremlin law that could imperil Russian athletes when they return home. The Chicago Blackhawks, who have at least two more players with connections to Russia, will not wear Pride-themed warmup jerseys before Sunday's game against Vancouver, a person with knowledge of the matter told The Associated Press, because of security concerns involving the law, which expands restrictions on supporting LGBTQ rights. Russian President Vladimir Putin signed it in December . The decision was made by the Blackhawks following discussions with security officials within and outside the franchise, according to a person familiar with the situation who spoke Wednesday to the AP on condition of anonymity because of the sensitivity of the move. Chicago coach Luke Richardson said Thursday that he and his players were disappointed and called it “an unfortunate situation.” “I don’t think we can control the world issues, so that takes it out of our hands,” Richardson said. \"We’re just making decisions as best we can as an organization and for everybody.” The league declined to comment through a spokesperson. The decision comes amid increasing threats to freedom of expression in the U.S. and abroad. Conservative political forces have sought to ban LGBTQ-themed books from American school libraries and to forbid classroom lessons that mention sexuality and some aspects of race relations. Similar pressures have forced Russian players to walk a careful line since the invasion of Ukraine, with some cautiously speaking out against the war even with family members still living in Russia. Last year, Minnesota Wild star Kirill Kaprizov ran into several roadblocks as he traveled back to the U.S., raising concerns about his safety. “There’s such a sensitivity to the topic, and you have concerns for the Russians, especially,” Buffalo Sabres captain Kyle Okposo said, emphasizing that he does not “understand what it’s like to be in Russia and to grow up there. And I don’t think we’re able to speak about the psychology of those players because we don’t understand.\" Chicago defenseman Nikita Zaitsev is a Moscow native, and there are other players with family in Russia or other connections to the country. The Florida Panthers — whose star goaltender, Sergei Bobrovsky, is Russian — went forward with plans to wear Pride-themed jerseys Thursday night before their home game against Toronto. Bobrovsky took part, while brothers Eric and Marc Staal did not, and cited religion as the reason. “We carry no judgement on how people choose to live their lives, and believe that all people should be welcome in all aspects of the game of hockey,” the Staal brothers said in a statement. “Having said that, we feel that by us wearing a Pride jersey it goes against our Christian beliefs.” The jerseys are just one part of many initiatives the Panthers built into the annual event, including auctioning off the jerseys, matching the money raised and donating it to nonprofits that work with the LGBTQ community. Speaking after Florida's 6-2 loss, Panthers coach Paul Maurice described the Staal brothers as men of faith, and then noted how the rest of the team wore the warmup jerseys. “I love both of those men and they have the right to their opinion. I stand by that right,” he said. “But everyone else in the room has the right to put that sweater on proudly and wear it and be welcoming to all people in our community.” The Sabres and Vancouver Canucks have Pride nights upcoming. The Canucks have not announced specific plans for the event. Sabres management was scheduled to hold discussions Thursday with its player leadership group on the matter, amid concern over whether defenseman Ilya Lyubushkin will participate because he is from Moscow, where he still has family and returns in the offseason to visit. Lyubushkin and his family members could face a backlash in Russia, according to a Sabres employee with knowledge of the issue. The person spoke to the AP on the condition of anonymity because of the sensitive nature of the discussions. In other sports, members of Major League Baseball’s Tampa Bay Rays decided last season not to wear rainbow-colored logos on their uniforms as part of their Pride night. Women's basketball star Brittney Griner, an American citizen who is gay, was arrested at Moscow’s Sheremetyevo Airport last year after Russian authorities said she was carrying vape canisters with cannabis oil . She was imprisoned for eight months until a high-profile prisoner swap with the U.S. Kurt Weaver, chief operating officer of the You Can Play Project, which advocates for LGBTQ participation in sports, said he was upset when he learned of the Blackhawks’ decision, but he called the conversation an indicator of progress. “We are certainly disappointed that the jerseys aren’t worn, because that’s the No. 1 visual representation from the athletes themselves, and I know a lot of the athletes do support this effort and support their community that comes to watch them,” Weaver said, adding praise for the Blackhawks’ commitment to Pride causes dating back more than a decade. Ivan Provorov of the Philadelphia Flyers declined to take part in pregame warmups during the team’s Pride night in January, citing his Russian Orthodox religion. Russians Nikolai Knyzhov and Alexander Barabanov wore the Pride-themed jerseys for the San Jose Sharks Sharks on Saturday, when Canadian goaltender James Reimer refused to take part because, like the Staals, he said it conflicted with his religious beliefs. The New York Rangers and Minnesota Wild opted not to wear Pride jerseys or use Pride stick tape as part of their events despite previously advertising they would. The Blackhawks planned a variety of LGBT-related activities in conjunction with Sunday's game. DJs from the LGBTQ community will play before the game and during an intermission, and the Chicago Gay Men’s Chorus is slated to perform. There also are plans to highlight a couple of area businesses with ties to the gay community. “We don’t want the jerseys to represent the entirety of the night,\" Blackhawks defenseman Seth Jones said. “We’re still doing a lot for the LGBTQ community, and us as players respect that. We just thought that this was best for our team.\" ___ AP Sports Writers John Wawrow, Josh Dubow and Tim Reynolds, and AP freelance reporter George Richards contributed to this report. ___ Follow Jay Cohen at https://twitter.com/jcohenap ___ AP NHL: https://apnews.com/hub/nhl and https://twitter.com/AP_Sports Jay Cohen And Stephen Whyno, The Associated Press","pubDate":"2023-03-24 03:24:59","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/03/20230323140324-641c99eef9ca851f32003fd0jpeg.jpg;w=960","id":"cceacc9f-2c0f-4288-bea9-c0d3400e7ada"},{"title":"Afghan Female Entrepreneur Keeps Girls in School, Teaches Useful Skills","link":"https://www.khaama.com/afghan-female-entrepreneur-keeps-girls-in-school-teaches-useful-skills/","description":"The largest online news service for Afghanistan","content":"An Afghan entrepreneur still makes waves under the Taliban rule to help girls receive education and learn important skills under the cover of secrecy.\n\nBefore the collapse of the Islamic Republic of Afghanistan, the 43-year-old operated a popular restaurant in the capital Kabul, where men and women dined together regardless of marital status, and for female customers to do without a hijab.\n\nHowever, with the return of the Taliban to power in August 2021, her entrepreneurial spirit risked like everyone else. She was in a state of shock and believed that all her gains were lost.\n\n“I felt as though an earthquake had struck and taken everything away from me,” she said. Taj Begum restaurant was closed as the Taliban did not allow women to run such businesses. But leaving with the thousands of others fearing a return to the Taliban’s brutal rule of the 1990s was not an option for the trailblazer.\n\nInstead of fleeing the country, she chose to remain in Afghanistan and provide a safety umbrella for some Afghan women who had nowhere to go.\n\n“Half of society has been wiped out from the face of the earth. As a woman, I have taken it upon myself to act not only for my own benefit but for the benefit of all women,” she said.\n\nFollowing the regime change, the Afghan female entrepreneur founded the Mother Educational Center (MEC). The center provides an opportunity for 500 girls to receive education in diverse subjects, such as photography, jewelry design, painting, maths, physics, and the English language.\n\nInitially, MEC had two branches, one in the backstreets of Kabul, and another in the central Afghan province of Daikundi. Due to a lack of funds, the Diadundi branch shut down last year, however, girls still attend classes in the Kabul branch.\n\nBesides learning valuable skills in diverse subjects, female students are beginning to earn an income from making jewelry and other items from discarded ammunition. The income through minimum will contribute a lot towards their family’s living conditions during these difficult times.","pubDate":"2023-03-24 03:23:45","image_url":"https://www.khaama.com/wp-content/uploads/2023/03/Useful-Skills.jpg","id":"cf85ee3c-ef61-443f-bd24-1849817e99b5"},{"title":"Cyprus Anti-Cancer Society supports over 4,000 patients annually","link":"https://cyprus-mail.com/2023/03/23/cyprus-anti-cancer-society-supports-over-4000-patients-annually/","description":"More than 4,000 patients and families are served annually free of charge by the Cyprus Anti-Cancer Society. To achieve this, the practical support of society, as well as businesses is required, said Chairman of the charity Dr Adamos Adamou, during Thursday’s press conference. The press conference also served as the...","content":"More than 4,000 patients and families are served annually free of charge by the Cyprus Anti-Cancer Society. To achieve this, the practical support of society, as well as businesses is required, said Chairman of the charity Dr Adamos Adamou, during Thursday’s press conference. The press conference also served as the launch event for the 48th Christodoula March, to be held on April 9 as well as a roadside fundraiser on April 6. This year the motto of Christodoula March, the longest running public awareness campaign on cancer is “Be there”, which Adamou noted means “to be there for the patient, to be there for the health professionals who tirelessly provide valuable care services, to be there with us in supporting the charitable work of the Cancer Society.” “Patients will be going through a difficult journey and what they need is for us to be there for them with respect and care”, Adamou said, adding that “advances in medicine, prevention and early diagnosis allow us to reject terms such as terminal illness and incurable disease when talking about cancer because many cancers can be cured”. The actual ‘March’ is a symbolic walk of about 4km held in memory of Christodoula, a cancer patient who died alone and helpless under an orange tree in the village of Sotira in 1974, after walking there from Agios Memnonas in occupied Famagusta. This year’s events, with the cooperation of the Bank of Cyprus, include the unveiling of the Christodoula monument in the Municipality of Sotira. In his address, the Deputy CEO and & Chief of Business at Bank of Cyprus Charis Pouangare appealed to everyone to “Be there”, making their contribution to all the points that will operate for this purpose. He added that financial institutions play a very important role in society, actively participating in initiatives that focus on people and their problems, so the Bank of Cyprus has been supporting the Cyprus Anti-Cancer Society since 1998, the year the Bank’s Oncology Centre ‘Arodafnousa’ opened.","pubDate":"2023-03-23 19:51:46","image_url":null,"id":"aabb1432-b4a1-4f5f-be12-21f80817b52e"},{"title":"FTX debtors agree to $95M sale of stake in Mysten Labs","link":"https://cointelegraph.com/news/ftx-debtors-agree-to-95m-sale-of-stake-in-mysten-labs","description":"The proposed purchase price of the Mysten Labs shares was roughly 95% of the amount FTX Ventures invested as part of a $300-million funding round in September 2022.","content":"The debtors for defunct crypto exchange FTX have approved an agreement that would sell its preferred stock in Mysten Labs, the company behind the Sui blockchain. In a March 22 filing in United States Bankruptcy Court in the District of Delaware, FTX debtors proposed a deal in which Mysten Labs and the company would agree to a mutual release of claims. As part of the agreement, the debtors planned to sell roughly $95 million worth of preferred stock back to Mysten in addition to $1 million in SUI tokens. “The Debtors carefully considered and analyzed the offer as set forth in the Agreement in comparison to its other options and concluded that a sale of the Interests will result in obtaining maximum value for the Interests, and is in the best interests of the Debtors’ estates and creditors,” said the filing. “The Purchase Price is equal to approximately 95% of the amount FTX Ventures had originally invested in the Preferred Stock of Purchaser-Subject Company, plus 100% of the amount Sellers paid for the SUI Token Warrants.” Related: FTX debtors report $11.6B in claims, $4.8B in assets, with many crypto holdings ‘undetermined’ The deal is seemingly subject to court approval as well as the possibility of other bids on the stock before being finalized. FTX Ventures acquired the stock as part of a $300 million funding round with Mysten announced in September 2022. The investment also came prior to FTX filing for Chapter 11 bankruptcy in November. Debtors in the FTX bankruptcy case also announced on March 22 they planned to recover $460 million of user funds from venture capital firm Modulo Capital. The filing alleged the investment from Alameda Research was at the direction of former FTX CEO Sam Bankman-Fried and a misappropriation of funds. Bankman-Fried faces multiple counts in federal court related to alleged fraud during his time as CEO, and has pled not guilty to all charges. Magazine: Can you trust crypto exchanges after the collapse of FTX?","pubDate":"2023-03-23 19:47:41","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvMDBkMjYxNWQtZTg4NS00ZDU3LTk2NTctYmE4ZGE0N2MwNzU5LmpwZw==.jpg","id":"7f4682d8-1501-42dd-a547-725ef51d878b"},{"title":"NFT Collection RTFKT x NIKE AR HOODIE PRE FORGED Price, Stats, and Review","link":"https://cryptodaily.co.uk/2023/03/nft-collection-rtfkt-x-nike-ar-hoodie-pre-forged-price-stats-and-review","description":"What is an RTFKT x NIKE AR HOODIE PRE FORGED? RTFKT x NIKE AR HOODIE PRE FORGED are a non-fungible tokens collection built on the Ethereum network launched in 27 March, 2022. 1 items of the RTFKT x NIKE AR HOODIE PRE FORGED collection can now be viewed at OpenSea. How many owners does the RTFKT x NIKE AR HOODIE PRE FORGED collection have? The total number of owners has reached 326 within 358 days since its release. NFT Collection RTFKT x NIKE AR HOODIE PRE FORGED Price and Sales The market capitalization of RTFKT x NIKE AR HOODIE PRE FORGED NFT collection is 0.08 ETH. Since created the RTFKT x NIKE AR HOODIE PRE FORGED, 3,595 collections sales were made at an average price of 0.30 ETH (~$520.29 at the time of writing). This created a total volume in 1,077.235 ETH. The floor price of RTFKT x NIKE AR HOODIE PRE FORGED is 0.099499 and the 30-day trading volume is kept at 1.44 ETH. The payment tokens of the RTFKT x NIKE AR HOODIE PRE FORGED collection are ETH, WETH. Why are some NFTs expensive and others not? NFTs are very new to the blockchain ecosystem and are still in their infancy. It is an emerging market meaning there is no historical data or precedence that can assist in determining the value of an NFT. NFT projects that started at the beginning of the market boom have garnered legitimacy purely because they had a first-mover advantage. These “established” NFT projects have also had the opportunity to improve and learn from the issues that have plagued the NFT market and have, in such a way, made themselves more valuable. When the NFT boom took flight, many people realized profits beyond their wildest dreams, creating a space for opportunists to take advantage of the market growth. While some NFTs can be considered digital art, created by an artist who recognizes the value NFTs can add to the creative space, others have been made purely out of greed and a need to exploit the immense market growth. NFT projects that stem from greed and exploitation often have no value and are ultimately garbage. Is the RTFKT x NIKE AR HOODIE PRE FORGED Collection Over or Underpriced? It is difficult to determine whether NFTs from the RTFKT x NIKE AR HOODIE PRE FORGED collection is overpriced or underpriced. Making such an assessment will become clearer when the market for NFTs and metaverses develops more actively. The price is also influenced by how the RTFKT x NIKE AR HOODIE PRE FORGED collection is developed and promoted by its creators and community. RTFKT x NIKE AR HOODIE PRE FORGED NFT Collection Examples [UNFORGED] RTFKT x NIKE AR HOODIE 🕊✔️ RTFKT x NIKE AR HOODIE PRE FORGED fees Buyer fee to dev: 0 basis points Seller fee to dev: 500 basis points Buyer fee to opensea.io: 0 basis points Seller fee to opensea.io: 250 basis points Buyer fee: 0 basis points Seller fee: 750 basis points RTFKT x NIKE AR HOODIE PRE FORGED editors list The approved editor's accounts of RTFKT x NIKE AR HOODIE PRE FORGED collection are 0x623fc4f577926c0aadaef11a243754c546c1f98c, 0xa4ed96b4b75f257440fe1992654d84c89f4c0a8e. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.","content":"RTFKT x NIKE AR HOODIE PRE FORGED are a non-fungible tokens collection built on the Ethereum network launched in 27 March, 2022. 1 items of the RTFKT x NIKE AR HOODIE PRE FORGED collection can now be viewed at OpenSea. The total number of owners has reached 326 within 358 days since its release. The market capitalization of RTFKT x NIKE AR HOODIE PRE FORGED NFT collection is 0.08 ETH. Since created the RTFKT x NIKE AR HOODIE PRE FORGED, 3,595 collections sales were made at an average price of 0.30 ETH (~$520.29 at the time of writing). This created a total volume in 1,077.235 ETH. The floor price of RTFKT x NIKE AR HOODIE PRE FORGED is 0.099499 and the 30-day trading volume is kept at 1.44 ETH. The payment tokens of the RTFKT x NIKE AR HOODIE PRE FORGED collection are ETH, WETH. NFTs are very new to the blockchain ecosystem and are still in their infancy. It is an emerging market meaning there is no historical data or precedence that can assist in determining the value of an NFT. NFT projects that started at the beginning of the market boom have garnered legitimacy purely because they had a first-mover advantage. These “established” NFT projects have also had the opportunity to improve and learn from the issues that have plagued the NFT market and have, in such a way, made themselves more valuable. When the NFT boom took flight, many people realized profits beyond their wildest dreams, creating a space for opportunists to take advantage of the market growth. While some NFTs can be considered digital art, created by an artist who recognizes the value NFTs can add to the creative space, others have been made purely out of greed and a need to exploit the immense market growth. NFT projects that stem from greed and exploitation often have no value and are ultimately garbage. It is difficult to determine whether NFTs from the RTFKT x NIKE AR HOODIE PRE FORGED collection is overpriced or underpriced. Making such an assessment will become clearer when the market for NFTs and metaverses develops more actively. The price is also influenced by how the RTFKT x NIKE AR HOODIE PRE FORGED collection is developed and promoted by its creators and community. The approved editor's accounts of RTFKT x NIKE AR HOODIE PRE FORGED collection are 0x623fc4f577926c0aadaef11a243754c546c1f98c, 0xa4ed96b4b75f257440fe1992654d84c89f4c0a8e.","pubDate":"2023-03-23 19:45:00","image_url":"http://cryptodailycdn.ams3.digitaloceanspaces.com/nfts-analytics/rtfkt-nike-ar-hoodie-preforged.png","id":"97894078-bb52-43a9-89c2-84be8ba7363d"},{"title":"Accenture to axe 400 jobs in Irish workforce","link":"https://www.irishtimes.com/business/2023/03/23/accenture-to-axe-400-jobs-in-irish-workforce/","description":"Consulting firm to slash jobs and cut office space in the next 18 months","content":"Accenture has announced that it will axe about 400 jobs from its Irish workforce as part of a decision to cut 19,000 jobs across the group in the next 18 months. The Irish headquartered group said on Thursday that it expected to incur staff severance costs of $1.2 billion (€1.1 billion) and a further $300 million of expenses from the “consolidation of office space”. “After a careful review of our business operations, we can confirm that we are going into collective employee consultation for a proposed redundancy programme that is anticipated to affect approximately 400 of our people in Ireland,” a spokesman for the company said. Accenture is based in Ireland for tax and legal purposes after relocating here from Bermuda in 2009 when then US president Barack Obama was targeting overseas profits in countries, like Bermuda, that the US regarded as tax havens. That 400-job target means Accenture’s 6,500-strong Irish workforce will be more dramatically affected than colleagues in other countries, contrary to the trend of recent redundancies among multinationals. It means that just over 6 per cent of Irish staff will lose their jobs compared to a rate of around 2.5 per cent globally. It is the latest in a series of cuts across the consulting sector globally as companies battle rising costs and an uncertain economic outlook, with rivals McKinsey and KPMG both announcing significant job losses in recent months. On an earnings call with analysts, chief executive Julie Sweet characterised the cuts as “offensive” rather than defensive, to ensure Accenture kept to its long-term profitability targets in a high-inflation environment. “We’ve been dealing with the challenges of compounding wage inflation,” she said. “We’ve been doing that with pricing, but we’ve also been doing that with cost efficiencies and digitisation and we’ve identified an opportunity to go after structural cost.” The company has enjoyed explosive growth in recent years as demand for advice on tech projects from multinationals ballooned. It has been on a hiring binge, adding more than 230,000 staff since August 2020. The company says it will continue to hire staff “especially to support our strategic growth priorities”. Accenture announced the cuts alongside its results for the three months to February, when it reported revenues of $15.8bn, a 5 per cent increase on the same period a year earlier. Half of the 19,000 employees will leave by the end of August, the company told analysts on Thursday. More than half of the cuts are expected to affect staff who work in corporate functions but serve clients directly, the company said. Accenture announced the cuts alongside its results for the three months to February, when it reported revenues of $15.8 billion, a 5 per cent increase on the same period a year earlier. Consulting revenues at the group fell 1 per cent to $8.3 billion while sales by the managed services, or outsourcing, division grew 12 per cent to $7.5 billion. Operating income dropped 5.8 per cent to $1.9 billion in the quarter. [ Cartamundi owners received almost €31m in dividends from Ireland before closing Waterford factory ] Surinder Thind, analyst at Jefferies, noted that Accenture’s consulting revenues fell short of expectations, in contrast to a still-booming outsourcing business, and “the need for cost-cutting raises questions of what growth will look like beyond the end of the fiscal year”. Despite the troubled economic outlook, the company said it had secured a record $22.1 billion of bookings for new work during the three months to February. It has trimmed its estimated revenue growth for the financial year that ends in August from 8-11 per cent to 8-10 per cent. Accenture said it estimated that about $800 million of cost-cutting expenses would be incurred by the end of August with a further $700 million in the following 12 months. It said it had already incurred $244 million in “business optimisation costs” in the three months to February. – Additional reporting, The Financial Times Limited 2023","pubDate":"2023-03-23 19:42:10","image_url":"https://irishtimes-irishtimes-prod.cdn.arcpublishing.com/resizer/JGCz6ws2S_N4_bE61koK9D72dIg=/630x350/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/YKHBEYA7GBINRA6UE5BYBUDGVU.jpg","id":"50b278a8-8c86-4faa-84ed-ea210664b7ee"},{"title":"NFT Collection TOKYO PUNKS by SABET Price, Stats, and Review","link":"https://cryptodaily.co.uk/2023/03/nft-collection-tokyo-punks-by-sabet-price-stats-and-review","description":"What is an TOKYO PUNKS by SABET? TOKYO PUNKS by SABET are a non-fungible tokens collection built on the Ethereum network launched in 2 February, 2022. 4,848 items of the TOKYO PUNKS by SABET collection can now be viewed at OpenSea. How many owners does the TOKYO PUNKS by SABET collection have? The total number of owners has reached 2812 within 411 days since its release. NFT Collection TOKYO PUNKS by SABET Price and Sales The market capitalization of TOKYO PUNKS by SABET NFT collection is 207.88 ETH. Since created the TOKYO PUNKS by SABET, 5,951 collections sales were made at an average price of 0.18 ETH (~$314.78 at the time of writing). This created a total volume in 1,078.835 ETH. The floor price of TOKYO PUNKS by SABET is 0.0344 and the 30-day trading volume is kept at 3.59 ETH. The payment tokens of the TOKYO PUNKS by SABET collection are ETH, WETH. Why are some NFTs expensive and others not? NFTs are very new to the blockchain ecosystem and are still in their infancy. It is an emerging market meaning there is no historical data or precedence that can assist in determining the value of an NFT. NFT projects that started at the beginning of the market boom have garnered legitimacy purely because they had a first-mover advantage. These “established” NFT projects have also had the opportunity to improve and learn from the issues that have plagued the NFT market and have, in such a way, made themselves more valuable. When the NFT boom took flight, many people realized profits beyond their wildest dreams, creating a space for opportunists to take advantage of the market growth. While some NFTs can be considered digital art, created by an artist who recognizes the value NFTs can add to the creative space, others have been made purely out of greed and a need to exploit the immense market growth. NFT projects that stem from greed and exploitation often have no value and are ultimately garbage. Is the TOKYO PUNKS by SABET Collection Over or Underpriced? It is difficult to determine whether NFTs from the TOKYO PUNKS by SABET collection is overpriced or underpriced. Making such an assessment will become clearer when the market for NFTs and metaverses develops more actively. The price is also influenced by how the TOKYO PUNKS by SABET collection is developed and promoted by its creators and community. TOKYO PUNKS by SABET NFT Collection Examples TOKYO PUNK #0000 TOKYO PUNK #0001 TOKYO PUNK #0002 TOKYO PUNK #0004 TOKYO PUNKS by SABET fees Buyer fee to dev: 0 basis points Seller fee to dev: 1000 basis points Buyer fee to opensea.io: 0 basis points Seller fee to opensea.io: 250 basis points Buyer fee: 0 basis points Seller fee: 1250 basis points TOKYO PUNKS by SABET editors list The approved editor's accounts of TOKYO PUNKS by SABET collection are 0x02eb75be1e72e988de64f0088d654d8ea1081e87. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.","content":"TOKYO PUNKS by SABET are a non-fungible tokens collection built on the Ethereum network launched in 2 February, 2022. 4,848 items of the TOKYO PUNKS by SABET collection can now be viewed at OpenSea. The total number of owners has reached 2812 within 411 days since its release. The market capitalization of TOKYO PUNKS by SABET NFT collection is 207.88 ETH. Since created the TOKYO PUNKS by SABET, 5,951 collections sales were made at an average price of 0.18 ETH (~$314.78 at the time of writing). This created a total volume in 1,078.835 ETH. The floor price of TOKYO PUNKS by SABET is 0.0344 and the 30-day trading volume is kept at 3.59 ETH. The payment tokens of the TOKYO PUNKS by SABET collection are ETH, WETH. NFTs are very new to the blockchain ecosystem and are still in their infancy. It is an emerging market meaning there is no historical data or precedence that can assist in determining the value of an NFT. NFT projects that started at the beginning of the market boom have garnered legitimacy purely because they had a first-mover advantage. These “established” NFT projects have also had the opportunity to improve and learn from the issues that have plagued the NFT market and have, in such a way, made themselves more valuable. When the NFT boom took flight, many people realized profits beyond their wildest dreams, creating a space for opportunists to take advantage of the market growth. While some NFTs can be considered digital art, created by an artist who recognizes the value NFTs can add to the creative space, others have been made purely out of greed and a need to exploit the immense market growth. NFT projects that stem from greed and exploitation often have no value and are ultimately garbage. It is difficult to determine whether NFTs from the TOKYO PUNKS by SABET collection is overpriced or underpriced. Making such an assessment will become clearer when the market for NFTs and metaverses develops more actively. The price is also influenced by how the TOKYO PUNKS by SABET collection is developed and promoted by its creators and community. The approved editor's accounts of TOKYO PUNKS by SABET collection are 0x02eb75be1e72e988de64f0088d654d8ea1081e87.","pubDate":"2023-03-23 19:30:00","image_url":"http://cryptodailycdn.ams3.digitaloceanspaces.com/nfts-analytics/tokyo-punks-by-sabet.png","id":"68cb74cb-1cd2-4659-9f76-d56d6e8397e5"},{"title":"Arbitrum airdrop sells-off at listing, but traders remain bullish on ARB","link":"https://cointelegraph.com/news/arbitrum-airdrop-sells-off-at-listing-but-traders-remain-bullish-on-arb","description":"ARB token sold-off upon listing at exchanges and some users reported a tech-issue laden claim experience, but the token could still follow the trajectory of previous airdrops.","content":"The official Arbitrum airdrop page crashed right after the claiming process began around 9 a.m. EST. Some users still managed to claim it through alternative methods like Arbiscan. In the first two hours, the market witnessed a massive sell-off of the token as its price declined from over $10.29 to lows of $1. At ByBit, the token started trading for $7.50, but dropped to $1.50 within minutes. At the time of writing, the token was trading at $1.33. Only one address successfully sold the token at $10.29 through the ARB/USDC pool on Uniswap, bagging $64,340 for 6,250 tokens. A few others were able to sell for $4.50, however, the price dropped quickly below $1.50 as more sellers arrived. Nansen data shows that out of 6.03 million ARB claimed by “smart money” wallets, $5.01 million were moved to a centralized or a decentralized exchange, most likely to sell. The analytics firm puts “smart money” tags on addresses that trade in significant size and are usually active. While some smart money accounts added 3.45 million from DEXs. Overall, the amount moved to exchanges was 150% larger than inflows to the wallets, suggesting a massive sell-off. Related: Arbitrum’s ARB token signifies the start of airdrop season — Here are 5 to look out for The Aribtrum airdrop claim web page crashed thanks to overwhelming requests from users to claim ARB tokens. The page returned 404 and 429 errors, remaining down for more than an hour after the claiming process began. Nevertheless, some users still claimed the airdrop through alternative services like Arbiscan. The blockchain explorer witnessed a record number of visitors of over 84,000 in the first 30 minutes after the claiming window opened. Nansen’s data shows that 15% of the airdrop claims were processed when the official Arbitrum webpage was down. However, the claims through Arbiscan were far from smooth. The website also suffered from downtime due to traffic overload, creating a bad user experience for many. https://twitter.com/TheDeFinvestor/status/1638926204169494528 The token claiming widow will be alive for 184 days till September 24, 2023. The views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.","pubDate":"2023-03-23 19:27:56","image_url":"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvNDdhMjQ2ZmUtZjk3OS00ZjBiLTk2NDEtYjViNjY1MjVhMTQ5LmpwZw==.jpg","id":"3635f922-76cb-4cc8-9ed8-614a9cec759d"},{"title":"Law giving transport minister extensive powers must be enacted this year","link":"https://cyprus-mail.com/2023/03/23/law-giving-transport-minister-extensive-powers-must-be-enacted-this-year/","description":"A law giving the transport minister sweeping powers – such as designating low or zero-emission urban areas and barring certain vehicles from using them – must be passed by year’s end, an official told MPs on Thursday. Acting permanent secretary of the transport ministry, Yiannis Nicolaides, told legislators that the...","content":"A law giving the transport minister sweeping powers – such as designating low or zero-emission urban areas and barring certain vehicles from using them – must be passed by year’s end, an official told MPs on Thursday. Acting permanent secretary of the transport ministry, Yiannis Nicolaides, told legislators that the legislation – which got a first reading in parliament – is among a series of laws Cyprus must enact as part of the European Union’s ‘Fit for 55’ scheme. It’s part of the legal framework for achieving binding targets relating to sustainable urban mobility. The reform in question is included in the national Recovery and Resilience plan and should be approved by the end of the year. By 2030 Cyprus has undertaken the obligation to cut greenhouse gas emissions by 32 per cent, Nicolaides recalled. Road transport accounts for approximately 50 per cent of such emissions, translating into two million tonnes a year. The ‘Law setting special measures for reducing atmospheric pollution and greenhouse gas emissions in road transport’ will give the transport minister the power to issue decrees – published in the government gazette – designating specific days and times of day for the transit of vehicles running on conventional fuels (petrol and diesel) within low or zero-emission areas or streets. The minister can also identify a section, or even a lane, of a road which certain categories of vehicles will be prohibited from using. Further, the minister will assign areas or streets which certain vehicles can use, but only upon payment of a fee to the local authority. The law speaks of ‘superintendents’ – to be appointed by the transport minister – who will check if vehicles carry a pollution certificate in low or zero-emission areas. But Nicolaides said pollution checks could also be carried out by infrared cameras. Such cameras generate images of emissions from a vehicle’s exhaust. Lawmakers expressed reservations, pointing out that a great deal many people won’t be able to comply. They called for an incentives scheme for the purchase of low-emissions vehicles, and asked whether a transitional period would apply once the law has been enacted. Nicolaides referred MPs to current available schemes for replacing old vehicles. Regarding implementation, he said that the law must be enacted by the end of 2023, although the measures will start being applied as of 2025. Under the law, in low or zero-emission areas no vehicle can exceed speeds of 25km/hour. Any person violating the decrees in force at any given time will have committed a criminal offence and will be liable, in the event of conviction, to jail time of up to two years and/or a fine up to €10,000. Anyone assigning another person to drive a vehicle in a controlled area or street in violation of the decrees, will likewise be liable to the same penalties. In addition, any person who obstructs or prevents a superintendent or police officer from carrying out their duties, or who does not follow their instructions, is liable to jail time of up to one year and/or a fine not exceeding €5,000. On-the-spot fines may be issued. The text of the legislation states that the police, the armed forces, civil defence, the fire department and ambulances will be exempt from the provisions of the ministerial decrees.","pubDate":"2023-03-23 19:24:19","image_url":null,"id":"955cc537-4efb-4d7a-9608-7bcb0c68a43f"},{"title":"TikTok boss can’t guarantee China doesn’t interfere with app or spy on users","link":"https://www.independent.co.uk/tech/tiktok-ban-china-app-feed-surveillance-congress-b2306777.html","description":"Bytedance-owned app can be used ‘as a tool to manipulate America’","content":"TikTok’s chief executive failed to give assurances that China doesn’t interfere in the app or that its software can be used to spy on users as he faced tough questions at a hearing in the United States Congress. Shou Zi Chew was portrayed as evasive by a hostile committee following fears the Chinese-owned video platform should be barred because of security concerns and because it carries content that can harm children’s mental health. He told Republican representative Cathy McMorris-Rodgers he could not “100 per cent guarantee” that Beijing was not influencing parts of the app. She also asked if Mr Chew could say with certainty that the app could not be used to spy on journalists or other US citizens. He declined to give that same commitment. It led her to accuse TikTok of being a “weapon” that could be used against citizens. She also said during opening remarks that letting the app be used by young Americans is “like allowing the Soviet Union to produce Saturday morning cartoons during the Cold War – but much more dangerous”. “We do not trust TikTok will ever embrace American values – values for freedom, human rights and innovation,” she said, adding that the Chinese Communist Party “is able to use it as a tool to manipulate America as a whole”. “TikTok collects nearly every data point imaginable – from people’s location to what they type and copy, who they talk to, to biometric data and more.” The hearing came as the Houses of Parliament and the Scottish government became the latest institution to block TikTok from official devices, following last week’s bans by the UK government and the European Commission. Mr Chew, who began his testimony speaking about his own Singaporean roots, said: “We do not promote or remove content at the request of the Chinese government. It is our commitment to this committee and all our users that we will keep TikTok free from any manipulation by any government.” But the committee seemed unconvinced, with Democratic representative Tony Cardenas calling Mr Chew a “good dancer with words”. Democrat representative Diana DeGette told him the firm’s efforts to prevent the spread of misinformation on the platform were not working. \"You gave me only generalised statements that you’re investing, that you’re concerned, that you’re doing work. That’s not enough for me. That’s not enough for the parents of America,” she said. Mr Chew told reporters ahead of the hearing that “there are many misconceptions about our company, and I’m very proud to come here and represent them and normal users here in this country”. Some political experts say a TikTok ban could be damaging to Democrats who have used the platform to reach younger voters. Three House Democrats rallied with TikTok creators on Capitol Hill on Wednesday in opposition to a ban. “Why the hysteria and the panic and the targeting of TikTok?” asked representative Jamaal Bowman, a Democrat from New York, at a news conference on Wednesday. “Let’s do the right thing here – comprehensive social media reform as it relates to privacy and security.” TikTok last week said president Joe Biden’s administration had demanded its Chinese owners divest their stakes or face a potential ban. China’s Ministry of Commerce at a briefing on Thursday said that “forcing the sale of TikTok will seriously damage the confidence of investors from all over the world, including China, to invest in the United States. If the news is true, China will firmly oppose it.” Additional reporting by agencies","pubDate":"2023-03-23 19:17:49","image_url":"https://static.independent.co.uk/2023/03/23/19/SEI149423658.jpg?width=1200&auto=webp","id":"1aec7de1-8c88-43b0-96f5-5bcdc7a3edc3"},{"title":"Man Utd takeover – news: Sir Jim Ratcliffe and Ineos submit improved bid for club","link":"https://www.independent.co.uk/sport/football/man-utd-takeover-today-latest-b2306486.html","description":"Sir Jim Ratcliffe and Qatari banker Sheikh Jassim are the frontrunners in takeover from the Glazer family","content":"Neither of the two leading bids for Manchester United , fronted by the Qatari banker Sheikh Jassim Bin Hamad Al Thani and Sir Jim Ratcliffe , submitted their improved offers for the club by Wednesday’s deadline, The Independent understands. Both parties had until 9pm to submit their offers but have instead asked for an extension, which they were granted. It is understood both groups will submit their second, improved bids on Thursday, with the offers for the club expected to be more than £5bn. Ratcliffe’s INEOS group and the bid fronted by Sheikh Jassim were expected to submit their offers in advance of the deadline, but in a dramatic twist it emerged the Raine group received neither offer. An extension to the process has been granted, however, and both Ratcliffe and Sheikh Jassim both intend to meet the new deadline. The Glazers, who bought Manchester United for £790m in 2005 and saddled the club with debt, want around £6bn, which would be a record fee for a football club. Follow all the latest updates on the takeover below:","pubDate":"2023-03-23 19:16:41","image_url":"https://static.independent.co.uk/2023/03/21/13/SOCCER%20Man%20Utd%20Takeover%2012064874.jpg?width=1200&auto=webp","id":"e1a4dfb0-4819-4c30-bc5b-f4b62668a20d"},{"title":"80 firefighters tackle Paddington hotel fire in central London","link":"https://www.independent.co.uk/news/uk/home-news/paddington-london-hotel-fire-b2306997.html","description":"Some 70 firefighters are battling to control a blaze at a five-storey hotel near Paddington railway station in central London.","content":"Dozens of firefighters are battling to control a blaze at a five-storey hotel near Paddington railway station in central London . London Fire Brigade (LFB) was called to the scene on Craven Road at 4.41pm on Thursday, and had the fire controlled by 6.39pm. Half of the hotel’s ground floor is currently on fire and neighbouring properties have been evacuated, fire chiefs say. The cause of the blaze is not known. LFB said 10 fire engines, including a fire rescue unit and a 32-metre turntable ladder, are at the scene. Crews from Paddington, Kensington, North Kensington, Euston and other nearby stations were called out. Road closures are in place and LFB has asked the public to avoid the area. A spokesperson said there were no reports of any injuries. Breaking story: more follows","pubDate":"2023-03-23 19:15:42","image_url":"https://static.independent.co.uk/2023/02/09/07/INDUSTRY%20Strikes%20%2009045071.jpg?width=1200&auto=webp","id":"d1e0bc73-197e-4925-8a4b-978938fd6f4c"},{"title":"Uebert Angel Says Can Sign Government Deals Without Consulting Mnangagwa","link":"https://www.zimeye.net/2023/03/23/uebert-angels-says-can-sign-government-deals-without-consulting-mnangagwa/","description":"By- Exposed self-proclaimed prophet Uebert Angels said he could sign government deals and treaties with other countries on behalf of Zimbabwe without consulting President Mnangagwa. The founder of the Spirit Embassy, The Good News Church, was, on 17 March 2021, appointed Presidential Envoy and Ambassador at Large for Europe and the Americas.  Angel was appointed…","content":"Uebert Angel Says Can Sign Government Deals Without Consulting Mnangagwa\n\nSpread the love\n\nBy- Exposed self-proclaimed prophet Uebert Angels said he could sign government deals and treaties with other countries on behalf of Zimbabwe without consulting President Mnangagwa.\n\nThe founder of the Spirit Embassy, The Good News Church, was, on 17 March 2021, appointed Presidential Envoy and Ambassador at Large for Europe and the Americas.\n\nAngel was appointed to seek trade and investment opportunities.\n\nIn an Al Jazeera documentary – Gold Mafia – which exposes corruption and looting in the mining sector, Angel said that as a plenipotentiary, he has full authorisation to sign a treaty or convention on behalf of President Mnangagwa.\n\nHe made the remarks while talking to a delegation of one Mr Stanley, an undercover Al Jazeera reporter who was investigating illicit financial flows in Zimbabwe.\n\nHis remarks were meant to assure Mr Stanley that his word was binding.\n\nMr Stanley pretended to have huge sums of dirty money which he needed to be cleaned.\n\nAngel said it was possible as he had signed such deals before.\n\nShare this: Tweet\n\n\n\n\n\nLike this: Like Loading...","pubDate":"2023-03-23 18:00:00","image_url":"https://i0.wp.com/www.zimeye.net/wp-content/uploads/2023/03/Uebert-Angel-and-President-Mnangagwa-1200x600-1.jpg?fit=1200%2C600&ssl=1","id":"4ccddfb3-cd55-4d9d-b372-a6d55f545fd1"},{"title":"World Athletics votes to exclude transgender women athletes","link":"https://www.brisbanetimes.com.au/sport/athletics/world-athletics-votes-to-exclude-transgender-women-athletes-20230324-p5cuul.html?ref=rss&utm_medium=rss&utm_source=rss_feed","description":"The sport’s governing body also voted to tighten restrictions on athletes with Differences in Sex Development, cutting the maximum amount of plasma testosterone for athletes in half.","content":"Manchester: World Athletics has banned transgender women from competing in elite female competitions if they have gone through male puberty, the sport’s governing body announced.\n\nThe council also voted to tighten restrictions on athletes with Differences in Sex Development (DSD), cutting the maximum amount of plasma testosterone for athletes in half, to 2.5 nanomoles per litre from five.\n\nWorld Athletics President Sebastian Coe at a press conference in november 2022. Credit:AP\n\nThe tighter rules will impact DSD athletes such as two-times Olympic 800 metre champion Caster Semenya, Christine Mboma, the 2020 Olympic silver medallist in the 200m, and Francine Niyonsaba, who finished runner-up to Semenya in the 800 at the 2016 Olympics.\n\nWorld Athletics (WA) president Sebastian Coe told a news conference on Thursday (UK time) that the decision to exclude transgender women was based “on the overarching need to protect the female category”.","pubDate":"2023-03-23 17:52:13","image_url":"https://static.ffx.io/images/$zoom_0.289%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/6f9d31150051e7dfbb0389c6599eb3306d607a4d","id":"18aa21ba-3aa1-4a3d-b83a-9d2c1bbea490"},{"title":"Cyberpunk 2077: Was die Entwickler vom nichtlinearen Leveldesign gelernt haben","link":"https://www.play3.de/2023/03/23/cyberpunk-2077-was-die-entwickler-vom-nichtlinearen-leveldesign-gelernt-haben/","description":"Auf der GDC 2023 gab es eine Podiumsdiskussion mit dem Thema \"What Cyberpunk 2077 Taught Us About Non-Linear Level Design\". Hier sprach der leitende Level…","content":"Lead Level Designer Miles Tost sprach auf der aktuell stattfindenden Game Developers Conference über das Leveldesign von \"Cyberpunk 2077\". Dabei erklärte er, was schiefgelaufen ist und was sie in Zukunft besser machen könnten.\n\nAuf der GDC 2023 gab es eine Podiumsdiskussion mit dem Thema „What Cyberpunk 2077 Taught Us About Non-Linear Level Design“. Hier sprach der leitende Level Designer Miles Tost über die Probleme, die bei der Entwicklung aufgetreten sind.\n\nCD Projekt RED wollte die Level von „Cyberpunk 2077“ einzigartig und lohnend gestalten. Jedoch funktionierte das nichtlineare Leveldesign nicht so wirklich. Die Entwickler mussten nämlich auch Spieler berücksichtigen, die ihren Charakter „nicht richtig spezifiziert“ haben. So haben sie stets einen generischen Pfad eingebaut, der so offensichtlich wie möglich gestaltet wurde.\n\nDas Ergebnis davon war aber nicht zufriedenstellend, da sich die meisten Spieler für den einfachsten Weg entschieden haben. Letztendlich haben die verschiedenen Herangehensweisen also fast niemanden interessiert.\n\nDishonored als zukünftiges Vorbild\n\nImmerhin hat Tost wertvolle Designprinzipien festgestellt, die dem Entwicklerteam hoffentlich behilflich sein wird. Außerdem seien für ihn „Dishonored“ und dessen Nachfolger die wichtigsten Einflüsse. Diese beiden Stealth-Spiele sei nämlich belohnender, wenn es darum geht, einen anderen Pfad zu finden.\n\n„Wir müssen Pfade als etwas Besonderes behandeln. Das ist es, was den Wert der Entscheidungen, die die Spieler treffen, ausmacht“, meint der Level Designer.\n\nOft sollen die Spieler das Gefühl gehabt haben, dass ihre Entscheidungen keine Auswirkungen hatten. Eine einfache Lösung dafür sei, separate Wege weiter voneinander zu entfernen. Ansonsten werden sie als der selbe Pfad wahrgenommen. Des Weiteren kann man sich besser auf den gewählten Pfad einlassen, wenn er sich isoliert anfühlt. Denn so erhöht sich die Neugier des Spielers. Ebenfalls wichtig seien laut Tost exklusive Zwischensequenzen und Begegnungen oder ein spezieller Aufbau.\n\nZudem soll das Level Design die Spieler zwingen, sich für einen Weg zu entscheiden. Belohnt werden sie dabei wiederum mit exklusiven Inhalten. Dadurch kann das Team übrigens besser Anreize schaffen, sich für eine bestimmte Vorgehensweise zu entscheiden. Ein Beispiel: Sich durch die Gegend schleichen, um an einem starken Gegner unbemerkt vorbeizukommen.\n\nWeitere Meldungen zu „Cyberpunk 2077“:\n\nIm Januar dieses Jahres räumte der zuständige Quest Designer ein: Die Kritik an der linearen Geschichte ist gerechtfertigt. Er meinte, das Team hätte diesen Aspekt durchaus besser gestalten können.\n\nQuelle: IGN\n\nWeitere Meldungen zu Cyberpunk 2077.\n\nDiese News im PlayStation Forum diskutieren","pubDate":"2023-03-23 17:49:57","image_url":"https://www.play3.de/wp-content/uploads/2020/12/Cyberpunk-2077-Romanzen-Beitragsbild.jpg","id":"5c4c7bd4-7f83-4ad3-a25a-297b527315a0"},{"title":"Sonic Origins Plus: Sega kündigt Spielesammlung offiziell an","link":"https://www.play3.de/2023/03/23/sonic-origins-plus-sega-kuendigt-spielesammlung-offiziell-an/","description":"Nachdem es im Laufe des Vormittags nur ein Gerücht war, hat Sega die Sammlung \"Sonic Origins Plus\" offiziell angekündigt. Sie setzt sich aus zwölf \"Sonic\"","content":"Sega hat \"Sonic Origins Plus\" angekündigt. Dabei handelt es sich um eine komplettierte Spielesammlung aus der klassischen Ära des blauen Igels.\n\nNachdem es im Laufe des Vormittags nur ein Gerücht war, hat Sega die Sammlung „Sonic Origins Plus“ offiziell angekündigt. Sie setzt sich aus zwölf „Sonic“-Spielen zusammen und lässt Amy als spielbaren Charakter in „Sonic The Hedgehog 1“, „Sonic The Hedgehog 2“, „Sonic 3 & Knuckles“ und „Sonic CD“ sowie Knuckles als spielbaren Charakter in „Sonic CD“ zum Einsatz kommen.\n\nVerkauft werden soll „Sonic Origins Plus“ ab dem 23. Juni 2023 sowohl digital als auch in einer Boxversion für die Konsolen PS4, PS5, Xbox One, Xbox Series X/S und Switch sowie für den PC. Spieler, die „Sonic Origins“ bereits besitzen, können das „Sonic Origins Plus“-Erweiterungspack für 9,99 Euro kaufen.\n\nSonic Origins Plus in der Übersicht\n\nAlle weitere Details zu den verfügbaren Paketen sind nachfolgend aufgelistet:\n\nSonic Origins Plus – Boxversion – 39,99 Euro\n\nHauptspiel\n\n12 Spiele für Game Gear emuliert und im Museum spielbar\n\nKlassische Amy als spielbarer Charakter in Sonic The Hedgehog 1, 2, 3 sowie Sonic CD\n\nKnuckles als spielbarer Charakter in Sonic CD\n\nAlle bisherigen DLCs für Sonic Origins\n\n20-seitiges Artbook\n\nWendecover mit neuem Design\n\nSonic Origins Plus – Digitale Version – 39,99 Euro\n\nHauptspiel\n\n12 Spiele für Game Gear emuliert und im Museum spielbar\n\nKlassische Amy als spielbarer Charakter in Sonic The Hedgehog 1, 2, 3 sowie Sonic CD\n\nKnuckles als spielbarer Charakter in Sonic CD\n\nAlle bisherigen DLCs für Sonic Origins\n\nSonic Origins Plus – nur Erweiterungspack – 9,99 Euro\n\nDLC-Upgrade für Sonic Origins Plus\n\n12 Spiele für Game Gear emuliert und im Museum spielbar\n\nKlassische Amy als spielbarer Charakter in Sonic The Hedgehog 1, 2, 3 sowie Sonic CD\n\nKnuckles als spielbarer Charakter in Sonic CD\n\nAlle bisherigen DLCs für Sonic Origins\n\nZu den in „Sonic Origins Plus“ enthaltenen Spielen gehören: „Dr. Robotnik’s Mean Bean Machine“, „Sonic Blast“, „Sonic Chaos“, „Sonic Drift“, „Sonic Drift 2“, „Sonic Labyrinth“, „Sonic Spinball“, „Sonic the Hedgehog“, „Sonic the Hedgehog 2“, „Sonic the Hedgehog Triple Trouble“, „Tails Adventure“ und Tails’ Skypatrol“.\n\nNachfolgend steht ein passender Trailer zur Ansicht bereit:\n\nMit dem Laden des Videos akzeptieren Sie die Datenschutzerklärung von YouTube.\n\nMehr erfahren Video laden YouTube immer entsperren\n\nWeitere Meldungen zu Sonic Origins Plus.\n\nDiese News im PlayStation Forum diskutieren","pubDate":"2023-03-23 17:46:04","image_url":"https://www.play3.de/wp-content/uploads/2023/03/Sonic.jpg","id":"80bbec50-c62d-4b6e-a780-853117a1fdcc"},{"title":"TikTok CEO grilled by US legislators who label app a ‘tool’ of CCP","link":"https://www.brisbanetimes.com.au/world/north-america/tiktok-ceo-grilled-by-us-lawmakers-who-vow-to-address-app-threat-20230324-p5cuuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed","description":"CEO Shou Zi Chew faced questions from legislators who are convinced the app should be barred for being a “tool” of the Chinese Communist Party.","content":"Washington: TikTok’s chief executive has faced tough questions from legislators who are convinced the Chinese-owned short video app should be barred for being a “tool” of the Chinese Communist Party and because it carries content that can harm children’s mental health.\n\nCEO Shou Zi Chew’s testimony before Congress on Thursday (US time) capped a week of actions by the Chinese company aimed at convincing Americans and their lawmakers that the app creates economic value and supports free speech amid growing calls to ban the app.\n\nShou Chew, chief executive of TikTok, at a House Energy and Commerce Committee hearing in Washington. Credit:Bloomberg\n\nTikTok, which has more than 150 million American users, was repeatedly hammered in the ongoing hearing where no lawmaker offered any support. Many talked of a need to rein in the power held by the app over US children.\n\n“TikTok could be designed to minimise the harm to kids but a decision was made to aggressively addict kids in the name of profits,” said Representative Kathy Castor, a Democrat, at the House of Representatives Energy and Commerce committee hearing.","pubDate":"2023-03-23 17:37:37","image_url":"https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_32/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/049c5ab3f77cccca6eadcc8b6936a65f5cb45d07","id":"d390d07b-2f08-40ea-a330-78bbed10c6ab"},{"title":"No requirement in Pakistan programme that interferes with polls: IMF","link":"https://www.pakistantoday.com.pk/2023/03/23/no-requirement-in-pakistan-programme-that-interferes-with-polls-imf/","description":"ISLAMABAD: In an apparent snub to the federal government, the International Monetary Fund (IMF) on Thursday made it clear that decisions regarding the constitutionality, feasibility and timing of provincial and general elections “rest solely with Pakistan’s institutions”, clarifying that there was “no requirement under Pakistan’s Extended Fund Facility-supported programme which could interfere with the country’s […]","content":"ISLAMABAD: In an apparent snub to the federal government, the International Monetary Fund (IMF) on Thursday made it clear that decisions regarding the constitutionality, feasibility and timing of provincial and general elections “rest solely with Pakistan’s institutions”, clarifying that there was “no requirement under Pakistan’s Extended Fund Facility-supported programme which could interfere with the country’s ability to undertake constitutional activities”.\n\nThe statement from the international monetary lender comes a day after the Election Commission of Pakistan (ECP) decided to put off Punjab Assembly elections by more than five months, citing financial and security constraints.\n\nThe ECP’s order detailed a meeting held on March 9 wherein the Ministry of Finance secretary briefed the commission that “due to the paucity of funds and financial crunch, the country is facing an unprecedented economic crisis and it was under compulsion by IMF programme which has set targets for maintenance of fiscal discipline and deficit, and it would be difficult for [the] government to release funds now” for elections in Khyber Pakhtunkhwa and Punjab and later down the line for Sindh, Balochistan and the National Assembly polls.\n\nThe order also said that the Punjab chief secretary, in a meeting held on March 14, had said that “it shall not be possible for the provincial government to fund the elections”, citing various financial commitments as well as the IMF programme’s requirement that Punjab maintain a “cash surplus of Rs413/9 billion [sic]”.\n\nMeanwhile, IMF Resident Representative for Pakistan Esther Perez Ruiz made a statementa suggesting that the targets under IMF-supported programmes are set at the aggregate general government level (aggregating across federal and provincial government), and within these there is fiscal space to allocate or reprioritise spending and/or raise additional revenues to ensure constitutional activities can take place as required.\n\nCash-strapped Pakistan is in a race against time to implement measures to reach an agreement with the IMF.\n\nThe agreement with the IMF on the completion of the ninth review of a $7bn loan programme — which has been delayed since late last year over a policy framework — would not only lead to a disbursement of $1.2bn but also unlock inflows from friendly countries.","pubDate":"2023-03-23 17:35:55","image_url":"https://www.pakistantoday.com.pk/wp-content/uploads/2020/04/IMF-Pakistan.jpg","id":"6b1599a6-55ba-4486-b037-b12cc1bb5c06"},{"title":"NEW: 2 injured in Chipinge accident","link":"https://www.manicapost.co.zw/new-2-injured-in-chipinge-accident/","description":"Hot News From The East","content":"Two people were injured in the accident\n\nLuthando Mapepa\n\nChipinge Correspondent\n\nTWO people sustained injuries and were admitted at Chipinge District Hospital after a Toyota Hilux truck they were travelling in collided head-on with a Harare-bound Inter Africa bus at Rutengeni area this morning.\n\nThe accident occurred after the bus avoided hitting stray cattle and collided with the vehicle. No passengers aboard the bus were injured.\n\nChipinge District police community relations officer, Assistant Inspector Jowert Kamera, confirmed the incident. He urged drivers to always exercise extreme caution when on the road.\n\nThe bus driver, Mr Philip Kambawa, said: “I was driving down Rutengeni Mountain towards Tanganda Halt when stray cattle suddenly appeared on the road. In an attempt to avoid hitting the cattle, I swerved and collided with an oncoming truck that was carrying maize,” he said\n\nMr Innocent Matika, the truck driver, said he was lucky to be alive.\n\n“I cannot recall what happened and only saw myself here in hospital when I regained consciousness,” he said.\n\nStray cattle have become a headache for motorists plying the Birchenough Bridge-Chipinge route.","pubDate":"2023-03-23 17:26:06","image_url":"https://www.manicapost.co.zw/wp-content/uploads/sites/20/2023/03/Chipinge-accident-head-on-680x380.jpg","id":"e95bfc06-d5b9-4bf5-a9dc-95699c90e152"},{"title":"Uebert Angels Nailed In Al Jazeera Corruption Documentary","link":"https://www.zimeye.net/2023/03/23/uebert-angels-nailed-in-al-jazeera-corruption-documentary/","description":"By- Self-proclaimed prophet Uebert Angels said he has the authority to sign deals and treaties with other countries on behalf of Zimbabwe without consulting President Mnangagwa. The founder of the Spirit Embassy, The Good News Church, was, on 17 March 2021, appointed Presidential Envoy and Ambassador at Large for Europe and the Americas.  Angel was…","content":"Uebert Angel Nailed In Al Jazeera Corruption Documentary\n\nSpread the love\n\nBy- Self-proclaimed prophet Uebert Angels said he has the authority to sign deals and treaties with other countries on behalf of Zimbabwe without consulting President Mnangagwa.\n\nThe founder of the Spirit Embassy, The Good News Church, was, on 17 March 2021, appointed Presidential Envoy and Ambassador at Large for Europe and the Americas.\n\nAngel was appointed to seek trade and investment opportunities.\n\nIn an Al Jazeera documentary – Gold Mafia – which exposes corruption and looting in the mining sector, Angel said that as a plenipotentiary, he has full authorisation to sign a treaty or convention on behalf of President Mnangagwa.\n\nHe made the remarks while talking to a delegation of one Mr Stanley, an undercover Al Jazeera reporter who was investigating illicit financial flows in Zimbabwe.\n\nHis remarks were meant to assure Mr Stanley that his word was binding.\n\nMr Stanley pretended to have huge sums of dirty money which he needed to be cleaned.\n\nAngel said it was possible as he had signed such deals before.\n\nShare this: Tweet\n\n\n\n\n\nLike this: Like Loading...","pubDate":"2023-03-23 17:20:09","image_url":"https://i0.wp.com/www.zimeye.net/wp-content/uploads/2023/03/maxresdefault.jpg?fit=1200%2C675&ssl=1","id":"6d9ed40e-d86b-4fef-8306-eed7934a465e"},{"title":"Sri Lanka receives first tranche of IMF bailout","link":"https://srilankamirror.com/news/sri-lanka-receives-first-tranche-of-imf-bailout/","description":"The Ministry of Finance has received the first tranche of the Extended Fund Facility (EFF)  form the International Monetary Fund (IMF). Accordingly, Secretary to the Ministry of Finance Mahinda Siriwardena confirmed that USD 333 million was received by the Ministry today (23). He stated this during a meeting held in this regard with President Ranil […]","content":"The Ministry of Finance has received the first tranche of the Extended Fund Facility (EFF) form the International Monetary Fund (IMF). Accordingly, Secretary to the Ministry of Finance Mahinda Siriwardena confirmed that USD 333 million was received by the Ministry today (23). He stated this during a meeting held in this regard with President Ranil Wickremesinghe and the Heads of media institutions.","pubDate":"2023-03-23 17:17:52","id":"a70d9c3f-575d-4a0c-a78a-4fbdf46f8168"},{"title":"Best anti-corruption law in S.Asia will be passed in Parliament this year","link":"https://srilankamirror.com/news/best-anti-corruption-law-in-s-asia-will-be-passed-in-parliament-this-year/","description":"President Ranil Wickremesinghe said that the necessary steps will be taken to pass the best anti-Corruption Act in South Asia in Parliament soon. The President revealed that the cabinet approval for the Bill has already been granted and said that he will discuss it with the Opposition representatives in the future and present it to […]","content":"President Ranil Wickremesinghe said that the necessary steps will be taken to pass the best anti-Corruption Act in South Asia in Parliament soon. The President revealed that the cabinet approval for the Bill has already been granted and said that he will discuss it with the Opposition representatives in the future and present it to the Parliament. President Ranil Wickremesinghe said this during a discussion held at the Presidential Secretariat today (23) with the heads of media organizations. President Wickremesinghe said : “This process is very difficult. We all feel it. This is a four-year process. It will end in 2026. Those who were with me over a long period and supported these policies are now speaking against me. So is it a big thing for those who were against me to support me? We must remember one thing. We are in a difficult place now. We can’t play the old games again. If we do that, we will fall again. Let’s forget the old games and the past and move forward.” “We all made mistakes. At least now agree with this and support us. This money we received will be used to pay the salaries this month. It’s not stealing. These were lost because of the allegations of theft. Don’t spread such stories. These people who point fingers steal more than this. My salary is lower than those of you here. We need to change attitudes.” “They accused me of coming to protect thieves. But we are bringing the best anti-corruption bill in South Asia in consultation with the IMF. The opposition’s shouting did not bring anything. The Minister of Justice is also discussing this with the opposition.” “We presented this to Parliament to get the support of all parties. No one can oppose this. Some new laws have also been introduced. We have taken several new steps.” “We do not want to suppress the media. I hear the most criticism from the media. I also lost the media. I am the one who removed the criminal law imposed on the media. I was the one who gave the right to know the information. Independent commissions were brought to Parliament three times. So how do I suppress the media?”","pubDate":"2023-03-23 17:15:34","id":"dc3cf4cb-311d-458d-8219-5f7723ae3f52"},{"content":"Peo union held a demonstration in solidarity to French workers on Thursday, outside the French embassy in Nicosia. “The fight for one is a fight for all of us, just like the victories of one are victories for all labourers,” Peo general secretary Sotiroulla Charalambous said during the event. She said the union was there to express its solidarity and support to workers in France that have been protesting on the streets, fighting President Emmanuel Macron’s efforts to increase the pension age. “This affects all workers and all societies,” Charalambous said.","description":"Peo union held a demonstration in solidarity to French workers on Thursday, outside the French embassy in Nicosia. “The fight for one is a fight for all of us, just like the victories of one are victories for all labourers,” Peo general secretary Sotiroulla Charalambous said during the event. She...","id":"ceb14ecc-85e5-453a-94b2-13fbdbebd405","link":"https://cyprus-mail.com/2023/03/23/peo-union-marches-in-solidarity-with-french-workers/","pubDate":"2023-03-23 16:37:59","title":"Peo union marches in solidarity with French workers"},{"content":"Posted by Amarachi on Thu 23rd Mar, 2023 -\n\ntori.ng\n\nAccording to Soso Soberekon, when a lady finally meets a man she has been praying for, she should look at his manhood because that of a good man is never big.\n\n\n\n\n\nSoso Soberekon\n\nTalent manager, Soso Soberekon has made a shocking revelation about men that are good husbands.\n\n\n\nThe socialite took to his Instagram page to make a revelation to women on how to identify the perfect men who would make good husbands.\n\n\n\nAccording to Soso Soberekon, when a lady finally meets a man she has been praying for, she should look at his manhood because that of a good man is never big.\n\n\n\nSharing a photo of himself on IG, he wrote:\n\n\n\n“When you finally get the good man you’ve been praying for, no look him preeq…. Good husbands no dey get big preeq”.","description":"According to Soso Soberekon, when a lady finally meets a man she has been praying for, she should look at his manhood because that of a good man is never big.","id":"fa908f79-cf8d-4b46-a70e-d7124410f0f2","image_url":"https://www.tori.ng/userfiles/thumb/2023/mar/23/bb/b_231008.jpg","link":"https://www.tori.ng/news/231008/good-husbands-dont-have-big-manhood-soso-soberekon.html","pubDate":"2023-03-23 16:34:50","title":"Good Husbands Don’t Have Big Manhood – Soso Soberekon Tells Ladies"},{"content":"Forex trading has become quite a popular trading activity worldwide. This could be justified by its extensive financial market , which seems to be larger than the stock market. It amounts to about $5 trillion per day! Forex trading has dominated different regions of the world, including African countries like Nigeria. In fact, Africa has about 1.3 million forex traders , with more individuals joining each day . So, if you are wondering whether you can trade forex in African countries like Nigeria or not, the answer is yes. Forex trading is legal in Nigeria, and you can totally go for it. However, there are things that you must know: Trading Regulations Forex trading in Nigeria is not as regulated as in other countries. However, the activity is entirely managed by the Central Bank of Nigeria . The lack of strict regulations for forex trading in Nigeria can be due to the fact that it's still new, and people are trying to discover the activity more and more. Meanwhile, it's important for brokers to follow certain rules if they want to trade for their customers . Speaking of brokers, you must know that many leading forex trading brokers are also regulated by leading regulatory bodies like Financial Conduct Authority (FCA) and Financial Sector Conduct Authority (FSCA). They are governed by strict laws and rules to ensure secure forex trading in the country. If you are trading with your own money as a forex trader, you wouldn't be breaking laws or regulations. But, if you are trading through the funds of an investor, you will require a license for the same. Note that whatever you earn from the forex trading activities is taxable in Nigeria . So, you shouldn't miss out on paying the same for your gains. How to Trade Forex in Nigeria? Once you are familiar with all the trading rules and regulations in Nigeria (as mentioned here), you can start trading forex in the country. Here's how you can do so: Internet Connection and Online Device - To start from scratch, you must have a strong and secure internet connection for forex trading . You can choose any online device to connect with your trading platform . Nowadays, there are mobile applications available for these platforms, so you can access the platform anytime, anywhere. Choose a Forex Trading Platform - Do your research and find one of the most reliable and safe forex trading platforms in Nigeria . Look for other essentials for a genuine forex trading platform like: User-friendly interface Easy-to-use tools Security Stability Customer support Transparent fee structure Besides this, make sure the platform complies with your needs for hassle-free forex trading . Once you find your broker, it's time to open your account. Opening Your Account - Follow all the directions/guidelines as stated on the platform to open a forex trading account . You may have to enter your basic details and identity and connect your bank account. Add Money to Your Forex Account - This step is quite important to start your forex trading in Nigeria, as you can't make money without putting in your money. So, add some funds to your forex account through any reliable payment mode. You can do so through debit/credit cards, checks, etc. Start your Trading Journey - Once you open your account, start with your trading journey . Make sure to implement the smartest strategies to get good returns. Tips to Make Profits Through Forex Trading in Nigeria If you want to earn good profits in forex trading, these tips might help: Use a practiced or demo account to try out your initial trading strategies . It will save you from any trading mistakes or errors in the beginning. Always prioritize capital protection rather than profit. With the right strategies, you can earn profits again, but a loss is hard to recover. Learn proper money management techniques to prevent losing any funds . Try to understand where to invest and where not to invest. Don't get overwhelmed with your investment amount. Start small and add in funds as you learn and become more proficient . Document all your entry and exit points in a journal . You can also mention the reason behind the decisions you make. Review your forex trading strategies by thoroughly analyzing them weekly . They say practice makes a man perfect, and it's applicable to forex trading as well. So practice through beginner trading tips until you ace it! That's all! We hope now you know how to trade forex in Nigeria.","description":"Yes, you can trade forex in Nigeria. In fact, forex trading is one of the most preferred trading activities among other options.","id":"f6b07caf-04e2-4422-85fc-f56095a567c6","link":"https://www.tori.ng/news/231006/can-i-trade-forex-in-nigeria.html","pubDate":"2023-03-23 16:31:00","title":"Can I Trade Forex in Nigeria"},{"content":"He’s hell-bent on restoring blue-collar American manufacturing to its former glory, considers free trade a dirty word and wants Canada to wade voluntarily into a failed, gang-ravaged state that’s a quagmire waiting to happen. To be sure, Joe Biden is no Donald Trump. But he doesn’t always make it obvious. The U.S. president arrives in Ottawa tonight on a whirlwind 24-hour visit — a significantly less elaborate itinerary than first envisioned in the Prime Minister’s Office — two full years since becoming commander-in-chief. “This will be the first true, in-person bilateral meeting between the two leaders in Canada since 2009,” said White House National Security Council spokesman John Kirby. The first year of Biden’s term focused on rebuilding Canada-U.S. relations following Trump’s divisive term in office. The second focused on meeting obligations, “including prioritizing orderly and safe migration through regular pathways,” Kirby said. “Now, heading into the third, this visit is about taking stock of what we’ve done, where we are and what we need to prioritize for the future.” While he’s far less undiplomatic and publicly combative than his both-barrels predecessor, Biden’s first two years in the Oval Office produced more than enough political headaches for Prime Minister Justin Trudeau. Friday’s meetings may not offer much remedy. High on Canada’s wish list will be frank talk on Buy American, the age-old protectionist doctrine resurrected by every 21st-century president short of George W. Bush and one of Biden’s favourite domestic political messages. “The president is very committed to policies that create jobs in the United States, and we don’t take issue with that policy,” said Kirsten Hillman, Canada’s ambassador to the U.S. “What we say is … when you apply it to Canada and deeply integrated Canada supply chains, it does not serve your policy purpose. It does the exact opposite.” Fully 60 per cent of the physical goods that Canada sells stateside “go into the manufacturing of other products,” and much the same is true of what Canada buys from the U.S., she added. “So if we start carving each other out of our supply chains, the economic impact on jobs in our own country is going to be enormous. We’re shooting ourselves in the foot, essentially — both countries.” Canada is also likely to be playing defence on Haiti, the impoverished, quake-ravaged Caribbean nation on the island of Hispaniola that has devolved into a failed state since the 2021 assassination of president Jovenel Moïse. Roving gangs of marauders now control more than half of Port-au-Prince, the capital city of a country in the grips of a cholera outbreak with little access to medical help, a near-total lack of public security and a powerless interim government. The Biden administration, its hands full with Russia’s war in Ukraine, the rise of China and other great-power concerns, wants Canada — home to a large diaspora of French-speaking Haitians, mostly in Quebec — to take a lead role. “It’s a fair amount of pressure,” said Carleton University professor Stephen Saideman. “The reality is that Trudeau doesn’t want to do this, and so he comes up with whatever arguments he can to deflect this.” “I am hopeful … that Canada will be able to step in and take some leadership in Haiti, because that will matter in Washington,” said Gordon Giffin, who served as Bill Clinton’s envoy to Ottawa from 1997 to 2001. “Taking that one off of our menu would be a big help to the U.S. administration.” Though it might seem simplistic at the highest levels of intergovernmental relations, the quid pro quo approach is foundational to how countries get along and manage various irritants in the relationship, he suggested. “I do think it’s a prototypical example of the United States saying, ‘We need you to help us out on this one,’” Giffin told a panel hosted by the Americas Council and the Council of the Americas. He recalled the frequent interactions between his old boss and Jean Chrétien, who was prime minister while Clinton was in the White House and a man Giffin described as “the consummate dealmaker.” Chrétien “looked for places where Bill Clinton needed a little bit of help,” Giffin said. “I would very quickly hear, ‘OK, we’re going to do this, Gordon, but for that, I need this,’” he said in his best Chrétien drawl. “I’m sorry, that’s just human nature, and it’s part of the deal.” National Security Council spokesman John Kirby would not say Wednesday whether Biden intends to make a direct demand of Trudeau on Haiti. “They share a concern about the dire situation down there from a security and humanitarian perspective — this is not something that is unfamiliar to either the prime minister or the president,” Kirby said. “As for a multinational force or anything like that, I don’t want to get ahead of the conversation here. But as we’ve said before, if there’s a need for that, if there’s a place for that, that’s all going to have to be worked out directly with the Haitian government and with the UN.” Kirby also played down expectations on another big Canadian ask: renegotiating the Safe Third Country Agreement, a 2004 treaty between the two countries that many blame for a recent spike in irregular migration. On issues of migration, “we’re well aware of Canadian concerns. We have concerns of our own,” Kirby said. “It’s a hemispheric, shared regional challenge. So I have no doubt that they’ll discuss it.” Senior government officials in Ottawa say the discussion on Haiti will involve the two leaders, but not Haitians themselves. Trudeau has so far focused on sanctions, helping Haitian authorities with surveillance support to track gang activity, and building a political consensus on how the West can best help. Saideman, who has previously worked with the U.S. Department of Defense, said Ottawa is trying to avoid that at all costs. “This government does not want to suffer tremendous costs or cement tremendous risks.” He noted that Canada’s largest deployment is currently in Latvia and Ottawa has agreed to expand its presence to shore up that country’s border with Russia. Saideman said it would be impossible to expand that force while leading an intervention in Haiti, particularly because each deployed unit generally requires a second unit undergoing training and a third recovering from the previous rotation. In addition, gang violence would be significantly more risky than past missions aimed at preventing clashes between warring armies, such as in Bosnia or Cyprus. “I’m not saying we shouldn’t do it, but I can see why the government is cautious about it,” said Saideman, who is director of the Canadian Defence and Security Network. “In Haiti, this has not been the first rodeo,” he said. “The previous missions didn’t fix things, didn’t lead to a lasting solution.” —James McCarten, The Canadian Press RELATED: Biden visit puts Canadian defence spending, Norad modernization back under microscope Federal Politics Joe Biden Justin Trudeau","description":"U.S. president arrives in Ottawa tonight on a whirlwind 24-hour visit","id":"455287ea-91a7-456f-8960-11dd50dc58bd","image_url":"https://www.kelownacapnews.com/wp-content/uploads/2023/03/32217537_web1_20230322190312-dd4d4b4efc7d37b6334b1cd8f876057bc79e2de662e18dacaf97a4899a46ba48-1024x676.jpg","link":"https://www.kelownacapnews.com/news/firm-handshakes-hard-lines-trudeau-biden-to-talk-protectionism-haiti-migration/","pubDate":"2023-03-23 16:10:00","title":"Firm handshakes, hard lines: Trudeau, Biden to talk protectionism, Haiti, migration"},{"content":"He’s hell-bent on restoring blue-collar American manufacturing to its former glory, considers free trade a dirty word and wants Canada to wade voluntarily into a failed, gang-ravaged state that’s a quagmire waiting to happen. To be sure, Joe Biden is no Donald Trump. But he doesn’t always make it obvious. The U.S. president arrives in Ottawa tonight on a whirlwind 24-hour visit — a significantly less elaborate itinerary than first envisioned in the Prime Minister’s Office — two full years since becoming commander-in-chief. “This will be the first true, in-person bilateral meeting between the two leaders in Canada since 2009,” said White House National Security Council spokesman John Kirby. The first year of Biden’s term focused on rebuilding Canada-U.S. relations following Trump’s divisive term in office. The second focused on meeting obligations, “including prioritizing orderly and safe migration through regular pathways,” Kirby said. “Now, heading into the third, this visit is about taking stock of what we’ve done, where we are and what we need to prioritize for the future.” While he’s far less undiplomatic and publicly combative than his both-barrels predecessor, Biden’s first two years in the Oval Office produced more than enough political headaches for Prime Minister Justin Trudeau. Friday’s meetings may not offer much remedy. High on Canada’s wish list will be frank talk on Buy American, the age-old protectionist doctrine resurrected by every 21st-century president short of George W. Bush and one of Biden’s favourite domestic political messages. “The president is very committed to policies that create jobs in the United States, and we don’t take issue with that policy,” said Kirsten Hillman, Canada’s ambassador to the U.S. “What we say is … when you apply it to Canada and deeply integrated Canada supply chains, it does not serve your policy purpose. It does the exact opposite.” Fully 60 per cent of the physical goods that Canada sells stateside “go into the manufacturing of other products,” and much the same is true of what Canada buys from the U.S., she added. “So if we start carving each other out of our supply chains, the economic impact on jobs in our own country is going to be enormous. We’re shooting ourselves in the foot, essentially — both countries.” Canada is also likely to be playing defence on Haiti, the impoverished, quake-ravaged Caribbean nation on the island of Hispaniola that has devolved into a failed state since the 2021 assassination of president Jovenel Moïse. Roving gangs of marauders now control more than half of Port-au-Prince, the capital city of a country in the grips of a cholera outbreak with little access to medical help, a near-total lack of public security and a powerless interim government. The Biden administration, its hands full with Russia’s war in Ukraine, the rise of China and other great-power concerns, wants Canada — home to a large diaspora of French-speaking Haitians, mostly in Quebec — to take a lead role. “It’s a fair amount of pressure,” said Carleton University professor Stephen Saideman. “The reality is that Trudeau doesn’t want to do this, and so he comes up with whatever arguments he can to deflect this.” “I am hopeful … that Canada will be able to step in and take some leadership in Haiti, because that will matter in Washington,” said Gordon Giffin, who served as Bill Clinton’s envoy to Ottawa from 1997 to 2001. “Taking that one off of our menu would be a big help to the U.S. administration.” Though it might seem simplistic at the highest levels of intergovernmental relations, the quid pro quo approach is foundational to how countries get along and manage various irritants in the relationship, he suggested. “I do think it’s a prototypical example of the United States saying, ‘We need you to help us out on this one,’” Giffin told a panel hosted by the Americas Council and the Council of the Americas. He recalled the frequent interactions between his old boss and Jean Chrétien, who was prime minister while Clinton was in the White House and a man Giffin described as “the consummate dealmaker.” Chrétien “looked for places where Bill Clinton needed a little bit of help,” Giffin said. “I would very quickly hear, ‘OK, we’re going to do this, Gordon, but for that, I need this,’” he said in his best Chrétien drawl. “I’m sorry, that’s just human nature, and it’s part of the deal.” National Security Council spokesman John Kirby would not say Wednesday whether Biden intends to make a direct demand of Trudeau on Haiti. “They share a concern about the dire situation down there from a security and humanitarian perspective — this is not something that is unfamiliar to either the prime minister or the president,” Kirby said. “As for a multinational force or anything like that, I don’t want to get ahead of the conversation here. But as we’ve said before, if there’s a need for that, if there’s a place for that, that’s all going to have to be worked out directly with the Haitian government and with the UN.” Kirby also played down expectations on another big Canadian ask: renegotiating the Safe Third Country Agreement, a 2004 treaty between the two countries that many blame for a recent spike in irregular migration. On issues of migration, “we’re well aware of Canadian concerns. We have concerns of our own,” Kirby said. “It’s a hemispheric, shared regional challenge. So I have no doubt that they’ll discuss it.” Senior government officials in Ottawa say the discussion on Haiti will involve the two leaders, but not Haitians themselves. Trudeau has so far focused on sanctions, helping Haitian authorities with surveillance support to track gang activity, and building a political consensus on how the West can best help. Saideman, who has previously worked with the U.S. Department of Defense, said Ottawa is trying to avoid that at all costs. “This government does not want to suffer tremendous costs or cement tremendous risks.” He noted that Canada’s largest deployment is currently in Latvia and Ottawa has agreed to expand its presence to shore up that country’s border with Russia. Saideman said it would be impossible to expand that force while leading an intervention in Haiti, particularly because each deployed unit generally requires a second unit undergoing training and a third recovering from the previous rotation. In addition, gang violence would be significantly more risky than past missions aimed at preventing clashes between warring armies, such as in Bosnia or Cyprus. “I’m not saying we shouldn’t do it, but I can see why the government is cautious about it,” said Saideman, who is director of the Canadian Defence and Security Network. “In Haiti, this has not been the first rodeo,” he said. “The previous missions didn’t fix things, didn’t lead to a lasting solution.” —James McCarten, The Canadian Press RELATED: Biden visit puts Canadian defence spending, Norad modernization back under microscope Federal Politics Joe Biden Justin Trudeau","description":"U.S. president arrives in Ottawa tonight on a whirlwind 24-hour visit","id":"75f6ad08-1236-4dd6-ba79-8555e8fe97cc","image_url":"https://www.campbellrivermirror.com/wp-content/uploads/2023/03/32217537_web1_20230322190312-dd4d4b4efc7d37b6334b1cd8f876057bc79e2de662e18dacaf97a4899a46ba48-1024x676.jpg","link":"https://www.campbellrivermirror.com/news/firm-handshakes-hard-lines-trudeau-biden-to-talk-protectionism-haiti-migration/","pubDate":"2023-03-23 16:10:00","title":"Firm handshakes, hard lines: Trudeau, Biden to talk protectionism, Haiti, migration"},{"content":"MINSK, (BelTA) – Minister of Foreign Affairs of Belarus Sergei Aleinik received Chargé d’Affaires of Zimbabwe in Belarus Kudakwashe Lawrence Goniwa on 23 March, BelTA learned from the press service of the Ministry of Foreign Affairs. The parties exchanged views on a wide range of issues of bilateral cooperation and welcomed a more vibrant interaction between the two countries. They took stock of the progress to implement the agreements reached in the wake of the state visit of Belarusian President Aleksandr Lukashenko to Zimbabwe. The parties discussed the schedule of bilateral events and the agenda of the forthcoming official visit of Minister of Foreign Affairs and International Trade of Zimbabwe Frederick Shava. The Zimbabwe foreign ministry will be in Belarus on 26-30 March.","description":"MINSK, (BelTA) – Minister of Foreign Affairs of Belarus Sergei Aleinik received Chargé d’Affaires of [...]","id":"61d4cb1d-6c7e-4f3b-b111-96847d9b3798","link":"https://www.thezimbabwemail.com/zimbabwe/shava-heading-to-belarus/","pubDate":"2023-03-23 16:03:22","title":"Shava heading to Belarus"},{"content":"Mayor of Cambridgeshire and Peterborough Dr Nik Johnson will be the authority’s representative at the partnership. Group 28 Sign up to our free email newsletter to receive the latest breaking news and daily roundups Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Joining the rehashed Oxford to Cambridge Partnership will help the Cambridgeshire and Peterborough Combined Authority \"achieve growth\", a report has said. Previously known as the ‘Oxford Cambridge Arc’, the redesigned organisation aims to “champion” the region and help the area to “achieve environmentally sustainable and inclusive growth”. The project had been government led when it was first announced, but in January, Michael Gove, the Secretary of State for Levelling Up, Housing and Communities, confirmed his support for the new ‘pan-regional partnership’ led by public and private sector groups across the Oxford to Cambridge corridor area. A report to the Combined Authority board meeting earlier this week (March 22), said being a part of the partnership could help the authority to meet its own aims. It said: “The Combined Authority’s corporate strategy focuses on four strategic priority areas: achieving good growth; increasing connectivity; ambitious skills and employment opportunities; and enabling resilient communities. Read more: OxCam Arc 'failed' as massive project didn't show what it would offer people “It also recognises that strong partnership working and delivery as a key component in enabling this strategy to be successfully delivered. Membership of the pan-regional partnership will support the Combined Authority in its delivery of the corporate strategy through stronger collaboration, more efficient working and further strengthening joint working and influence with central government”. The board agreed to confirm the Combined Authority’s intention to become a member of the partnership, and appoint the Mayor Dr Nik Johnson as the authority’s representative. READ MORE: OxCam Arc 'failed' as massive project didn't show what it would offer people Cambridge to get £1m to build affordable homes Search for bus companies to take on three at risk Cambs bus routes launches Developer's bid for 425 homes on edge of Cambridge should be refused, planners say Cambourne to Cambridge busway takes step forward as council agrees to submit plans Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow CambridgeLive Facebook Twitter Comment More On Cambridgeshire and Peterborough Combined Authority Cambridgeshire Mayor Cambridgeshire","description":"The organisation formally called the Oxford Cambridge Arc has been redesigned with new priorities, the Cambridgeshire and Peterborough Combined Authority thinks matches its own.","id":"fe07ee6c-ad23-46d1-bef8-0d8376f4dd67","image_url":"https://i2-prod.cambridge-news.co.uk/incoming/article26543843.ece/ALTERNATES/s615/0_BOX_CAMB_Equiano_003JPG.jpg","link":"https://www.cambridge-news.co.uk/news/cambridge-news/combined-authority-agrees-join-oxford-26542684","pubDate":"2023-03-23 16:00:05","title":"Combined Authority agrees to join Oxford to Cambridge Partnership"},{"content":"ISLAMABAD: President Dr Arif Alvi on Thursday conferred Pakistan’s prestigious Hilal-i-Imtiaz award on founding editor of daily Pakistan Today late Arif Nizami for his meritorious services in the field of journalism. The awards were conferred posthumously at an investiture ceremony held at the Aiwan-e-Sadr in Islamabad. The ceremony was attended by the cabinet members, diplomats and family members of the recipients of the awards. The award was received by the spouse of Arif Nizami. Mr Arif Nizami [October 1948–21] also served as editor of daily The Nation who also served as caretaker Minister for Information and Postal Service in year 2013. Mr Nizami, 72, was born to Hameed Nizami, the founder of Nawa-i-Waqt Group of newspapers, in Lahore in Oct 1948. In August 2010, he founded daily Pakistan Today and served as editor of the newspaper till 2021. In 2015, Arif Nizami became CEO of Channel 24. He was also the host of a political talk show “Debate News Analysis”. Arif Nizami is also known for previously hosting a current affairs show on Samaa TV. He was also a host in 92 News Talk Show program “Ho Kya Raha Hai”. Save my name, email, and website in this browser for the next time I comment. Δ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );","description":"ISLAMABAD: President Dr Arif Alvi on Thursday conferred Pakistan’s prestigious Hilal-i-Imtiaz award on founding editor of daily Pakistan Today late Arif Nizami for his meritorious services in the field of journalism. The awards were conferred posthumously at an investiture ceremony held at the Aiwan-e-Sadr in Islamabad. The ceremony was attended by the cabinet members, diplomats […]","id":"52126d08-f5b2-4765-9ce7-a98ed9692291","link":"https://www.pakistantoday.com.pk/2023/03/23/president-alvi-confers-prestigious-hilal-i-imtiaz-on-late-arif-nizami/","pubDate":"2023-03-23 16:00:03","title":"President Alvi confers prestigious Hilal-i-Imtiaz on late Arif Nizami"},{"content":"Two landfill firms that caused misery for residents with litter and bad smells have been fined more than £72,000. The two companies, Octagon Green Solutions Ltd and director Kevin John Wanless, and Recyclogical Ltd pleaded guilty to a string of offences relating to litter, accepting too much waste and odour issues. Issues at the Blaydon Quarry landfill in Gateshead came to light in June 2018 when bosses decided to stay open despite Storm Hector hitting, accepting 53 loads of waste. Read more: Tragedy as woman dies after her Citroen car crashes into a road sign Residents reported litter strewn across hedges, in fields and gardens and inspectors found the site had wrongly positioned netting with large holes in allowing litter to escape. The firms took in more waste than was allowed under their permits. (Image: PR) Waste was also left uncovered at the end of the day. The site also flouted a ban on accepting anymore waste in December 2018, having already exceeded the maximum amount allowed for the year. Wanless described it as an oversight. In February 2019 inspectors found bad odours from the landfill could be smelled as far as 1km away. To get more stories direct to your email basket go here The site’s permit was suspended after waste reached a 15-metre high ‘cliff face’. Appearing before Newcastle Crown Court on Tuesday (March 21) Recyclogical Ltd of Newbold Terrace, Leamington Spa which operated the site from 2017 was ordered to pay more than £70,000 in fines and costs. Permit holders Octagon Green Solutions Ltd was fined £1,800 and director Kevin John Wanless, 50, of Lead Road, Blaydon, Gateshead ordered to pay £450. In mitigation they said the site had historically been problematic when run by previous operators. Recycological acquired a new owner in 2020 and efforts had been made by their new owner to engage with the community. The court ruled that the defendants’ actions had been negligent and the offences were aggravated by the site’s location close to housing and the lengthy period of time over which the problems persisted. Read next: Work underway on huge new Tesco and Home Bargains stores - here's when they'll open Two North East Fish and Chip venues named among the 10 best in the UK Pair appear in court accused of manslaughter after death of delivery driver Get more from The Northern Echo with a Premium Plus digital subscription from as little as only £1.50 a week. Click here Speaking after the sentencing Andrew Turner, Area Environment Manager for the Environment Agency in the North East, said: “Our officers have persisted through difficult hurdles and legal challenges to bring this case to court showing our commitment to taking robust action against those who flout the law. “I clearly remember the distress suffered by local residents due to the actions of these companies and I’m pleased they have now been sentenced. “Environmental permits and associated odour and litter management plans are there to protect the community and environment and I hope this case reassures people that we take breaches seriously and those involved can expect enforcement action.”","description":"Two landfill firms that caused misery for residents with litter and bad smells have been fined more than £72,000.","id":"63d306a8-b71d-4c18-b4bb-7b2ee767cc66","image_url":"https://www.thenorthernecho.co.uk/resources/images/16588108/?type=app&htype=0","link":"https://www.thenorthernecho.co.uk/news/23406555.blaydon-quarry-landfill-companies-fined-litter-smells/?ref=rss","pubDate":"2023-03-23 16:00:00","title":"Blaydon Quarry landfill companies fined for litter and smells"},{"content":"Police on Thursday warned of an uptick in online child harassment calling on parents to be more mindful of how their children use the internet. A bulletin from police warned there was an increase of reports to police of people sending indecent material to children, as well as harassment against them as part of efforts to groom minors. The internet is also giving them more opportunities to be anonymous and as such, police cautioned parents should be more guarded. It advised to contact police as soon as possible for her. For more information and to file a report, the public is advised to contact the cybercrime unit","description":"Police on Thursday warned of an uptick in online child harassment calling on parents to be more mindful of how their children use the internet. A bulletin from police warned there was an increase of reports to police of people sending indecent material to children, as well as harassment against...","id":"45385be1-95dc-4388-9a91-0dfb641a3b69","link":"https://cyprus-mail.com/2023/03/23/police-warn-of-increase-in-online-child-harassment/","pubDate":"2023-03-23 15:55:28","title":"Police warn of increase in online child harassment"}]