[{"title":"Ukraine prepares counteroffensive as Russia’s assault on Bakhmut flags","link":"https://cyprus-mail.com/2023/03/24/ukraine-prepares-counteroffensive-as-russias-assault-on-bakhmut-flags/","description":"Ukrainian troops, on the defensive for months, will soon counterattack as Russia’s offensive looks to be faltering, a commander said, but President Volodymyr Zelenskiy warned that without a faster supply of arms, the war could last years. Zelenskiy said Europe must increase and speed up its supply of weapons, again...","content":"Ukrainian troops, on the defensive for months, will soon counterattack as Russia’s offensive looks to be faltering, a commander said, but President Volodymyr Zelenskiy warned that without a faster supply of arms, the war could last years. Zelenskiy said Europe must increase and speed up its supply of weapons, again calling for long-range missiles, ammunition and modern aircraft, and impose additional sanctions on Russia. “If Europe waits, the evil may have time to regroup and prepare for years of war,” a clearly frustrated Zelenskiy said on Thursday in a video address to European Union leaders, delivered from a train. At the EU summit, leaders approved a plan agreed by foreign ministers on Monday to send 1 million artillery shells to Ukraine over the next year. They also discussed global food security and sanctions on Russia. Britain has pledged to supply armour piercing munitions containing depleted uranium to help destroy Russian tanks, a step President Vladimir Putin said would force a response from Russia as the weapons had “a nuclear component”. Read full story Slovakia said on Thursday it had handed over the first four MiG-29 jets it has pledged to Ukraine, with the rest to be delivered in weeks. Ukraine’s top ground forces commander Oleksandr Syrskyi said his forces would soon begin a counter-offensive after withstanding Russia’s brutal winter campaign. He said Russia’s Wagner mercenaries, who have been at the front line of Moscow’s assault on eastern and southern Ukraine, “are losing considerable strength and are running out of steam”. “Very soon, we will take advantage of this opportunity, as we did in the past near Kyiv, Kharkiv, Balakliya and Kupiansk,” he said, listing Ukrainian counteroffensives last year that recaptured swathes of land. There was no immediate response from Moscow to suggestions its forces in Bakhmut were losing momentum, but Wagner boss Yevgeny Prigozhin issued statements in recent days, warning of a Ukrainian counterassault. On Monday, Prigozhin published a letter to Russian Defence Minister Sergei Shoigu, saying Ukraine aimed to cut off Wagner’s forces from Russia’s regular troops. Reuters journalists near the front line north of Bakhmut saw signs consistent with the suggestion that the Russian offensive in the area could be waning. At a Ukrainian-held village west of Soledar, on Bakhmut’s northern outskirts, the intensity of the Russian bombardment noticeably lessened from two days earlier. “It was really hot here a week ago, but in the last three days it has been more quiet,” said a Ukrainian soldier who used the call sign “Kamin”, or “Stone”. “We can see this in the enemy’s air strikes. If before there were five-six air raids in a day, today we had only one helicopter attack,” said the soldier. A slowdown by Russia in Bakhmut could mean it is diverting its troops and resources to other areas. Britain said on Thursday that Russian troops had made gains further north this month, partially regaining control over the approaches to the town of Kreminna. Intense battles were also underway further south. Ukrainian military analyst Oleh Zhdanov agreed with that assessment. He said on YouTube that Russia’s attacks on Bakhmut were decreasing, and it was shifting its efforts south to the town of Avdiivka. Russia’s forces have become more active in areas to the north in the Kharkiv and Luhansk regions as well as central Zaporizhzhia and southern Kherson regions, he said. Any shift in momentum in Bakhmut, if confirmed, would be remarkable given the city’s symbolic importance as the focus of Russia’s offensive, and the scale of the losses on both sides there in Europe’s bloodiest infantry battle since World War Two. On the ground in Ukraine, the front lines have largely been frozen since November. Ukraine had looked likely to pull out of Bakhmut weeks ago but decided to fight on. Zelenskiy had earlier on Thursday continued a tour of front-line provinces, visiting the Kherson region in the south a day after meeting troops near Bakhmut. A video showed him meeting residents in Posad Pokrovske, a bombed-out village on the former Kherson front line recaptured in Ukraine’s last big advance last year. Russia invaded Ukraine in February 2022 in what it calls a “special military operation”, saying Ukraine’s ties to the West were a security threat. Since then, tens of thousands of Ukrainian civilians and soldiers on both sides have been killed. Russia has destroyed Ukrainian cities and set millions of people to flight. It says it has annexed nearly a fifth of Ukraine. Kyiv and the West call the war an unprovoked assault to subdue an independent country. European Commission President Ursula von der Leyen, said the EU would work to find Ukrainian children deported to Russia and press for their return. She said 16,200 children had been deported and only 300 returned to Ukraine. The International Criminal Court issued an arrest warrant for Putin a week ago for the forcible removal of Ukrainian children. “It is a horrible reminder of the darkest times of our history … to deport children. This is a war crime,” von der Leyen said.","pubDate":"2023-03-24 06:08:07","image_url":null,"id":"9375e24a-bf66-4bff-9ae9-ea3b5537e8fb"},{"title":"Biden in Canada to meet with Trudeau on issues including immigration, Haiti","link":"https://www.nation.com.pk/24-Mar-2023/biden-in-canada-to-meet-with-trudeau-on-issues-including-immigration-haiti","description":"US President Joe Biden arrived in Ottawa, Canada on Thursday for talks that will focus on a range of issues including illegal immigration, defense cooperation and the situation in Haiti.","content":"US President Joe Biden arrived in Ottawa, Canada on Thursday for talks that will focus on a range of issues including illegal immigration, defense cooperation and the situation in Haiti. Biden will hold a bilateral meeting with Canadian Prime Minister Justin Trudeau on Friday and is expected to address Canada’s parliament in the afternoon. The two leaders will then hold a joint press conference. Biden and first lady Jill Biden were greeted by Trudeau and his wife Sophie Gregoire Trudeau at the prime minister's residence. According to reports, Biden and Trudeau are expected to announce a deal between their two countries that would restrict certain migrants from seeking protections in Canada. The leaders are expected to announce the issues they have agreed on regarding the closure of the paths connecting New York and Quebec and a new refugee admission program under the agreement. \"The president and the prime minister certainly will have more to share tomorrow,\" White House spokeswoman Karine Jean-Pierre told reporters Thursday. Biden and Trudeau will also address the instability and deteriorating humanitarian situation in Haiti. Jean-Pierre said the situation on the ground would not improve without armed security assistance from international partners. \"Any decisions about military force would be done in consultation with the UN and with the Haitian government,\" she said. Canada's contributions to the North American Air Defense Command (NORAD) and NATO as part of defense spending are also expected to be on the agenda.","pubDate":"2023-03-24 05:50:47","image_url":"https://www.nation.com.pk/digital_images/large/2023-03-24/biden-in-canada-to-meet-with-trudeau-on-issues-including-immigration-haiti-1679637043-5907.jpg","id":"9b598535-cf7d-443a-8b45-b443e16bf1a7"},{"title":"Top 10 most-capped players in men’s soccer","link":"https://in-cyprus.philenews.com/news/international/top-10-most-capped-players-in-mens-soccer/","description":"The following are the top 10 most-capped players in men’s soccer, after Cristiano Ronaldo set a record by making his 197th appearance for Portugal in a European Championship qualifier victory over Liechtenstein: RANK PLAYER COUNTRY APPEARANCES DEBUT YEAR 1 Cristiano Ronaldo Portugal 197 2003 2 Bader Al-Mutawa Kuwait 196 2003 3 Soh Chin Ann Malaysia […]","content":"Search Sports Top 10 most-capped players in men's soccer Top 10 most-capped players in men’s soccer 59 mins ago Uefa Euro 2024 Qualifiers Group J Portugal V Liechtenstein googletag.cmd.push(function() { googletag.display('div-gpt-ad-1522825278556-0'); }); The following are the top 10 most-capped players in men’s soccer, after Cristiano Ronaldo set a record by making his 197th appearance for Portugal in a European Championship qualifier victory over Liechtenstein: RANK PLAYER COUNTRY APPEARANCES DEBUT YEAR 1 Cristiano Ronaldo Portugal 197 2003 2 Bader Al-Mutawa Kuwait 196 2003 3 Soh Chin Ann Malaysia 195 1969 4 Ahmed Hassan Egypt 184 1995 5 Ahmed Mubarak Oman 183 2003 6 Sergio Ramos Spain 180 2005 7 Andres Guardado Mexico 179 2005 8 Mohamed Al-Deayea Saudi Arabia 178 1993 9 Claudio Suarez Mexico 177 1992 10 Gianluigi Buffon Italy 176 1997 (REUTERS) googletag.cmd.push(function() { googletag.display('div-gpt-ad-1545053448854-0'); }); By Annie Charalambous Previous article ECB to reassure EU leaders on bank stability after latest market turbulence Next article Disgraced volunteerism commissioner’s forgery of diplomas case starts on Friday","pubDate":"2023-03-24 05:40:40","image_url":"https://in-cyprus.philenews.com/wp-content/uploads/2023/03/RONALDO.jpg","id":"e4f0ce57-9122-45cc-b6d8-4056a6160a51"},{"title":"149 Police Injured, 172 People Arrested in French Pension Protests","link":"https://www.khaama.com/149-police-injured-172-people-arrested-in-french-pension-protests/","description":"The largest online news service for Afghanistan","content":"Riot police scuffle with protesters during a protest in Rennes, France, March 22, 2023. © 2023 Jeremias Gonzalez/AP Photo\n\nIn the three-month revolt against President Emmanuel Macron’s highly controversial pension reforms, protesters clashed with French security forces.\n\nMore than 149 police and gendarmes have been injured during the day’s protests, and 172 people have been arrested, French Interior Minister Gérald Darmanin said Thursday evening.\n\nDuring the ensuing clashes, riot police used tear gas and stun grenades to push back the “Black Bloc” anarchists.\n\nAccording to Reuters, the ninth day of protests nationwide was primarily peaceful. Still, there were some fights with anarchists who broke shop windows, destroyed street furniture, and even looted a McDonald’s.\n\nIn addition, dozens of students from high schools and universities in France took part on Thursday to protest against planned pension reforms, according to France 24.\n\n“The Ministry of Education reported “148 incidents” in high schools in France, including 38 full blockades, 70 filter blockades, 14 attempted blockades and 26 other forms of disruption”\n\nProposed changes to France’s pension system, which have caused large protests and strikes since the beginning of the year, were about to be voted on in parliament.\n\nBut at the last minute, Macron stopped the vote and used special powers given to him by the Constitution to force the plans through.\n\nThe proposed changes include the minimum general retirement age will rise from 62 to 65, and there will be an accelerated increase in the number of years of work required for a full pension.\n\nThe changes were part of Macron’s manifesto for his re-election to a second term in office in 2022.","pubDate":"2023-03-24 05:33:51","image_url":"https://www.khaama.com/wp-content/uploads/2023/03/202303eca_france_pension_protest_riot_police.webp","id":"c29d384f-e2e0-4dd1-850a-ebacfeadf840"},{"title":"North Korea tests new nuclear-capable underwater drone","link":"https://www.ariananews.af/north-korea-tests-new-nuclear-capable-underwater-drone/","description":"North Korea has tested a new nuclear-capable underwater attack drone, state media reported on Friday, as leader Kim Jong Un warned joint military drills by South Korea and the U.S. should stop, Reuters reported. During the test, the new North Korean drone cruised underwater at a depth of 80 to 150 metres (260-500 feet) for […] The post North Korea tests new nuclear-capable underwater drone first appeared on Ariana News.","content":"During the test, the new North Korean drone cruised underwater at a depth of 80 to 150 metres (260-500 feet) for over 59 hours and detonated a non-nuclear payload in waters off its east coast on Thursday, North Korean state news agency KCNA said. Analysts say North Korea is showing off its increasingly diverse nuclear threats to Washington and Seoul, though they are sceptical whether the underwater vehicle is ready for deployment. North Korea intends to signal “to the United States and South Korea that in a war, the potential vectors of nuclear weapons delivery that the allies would have to worry about and target would be vast,” said Ankit Panda, senior fellow at the U.S.-based Carnegie Endowment for International Peace. “There would be silos, railcars, submarines and road mobile missile launchers. And now they’re adding this underwater torpedo to the mix,” he said. According to Reuters on Monday, the isolated country flew a short-range missile from a buried silo, a departure from usual basing methods. Dubbed “Haeil”, or tsunami, the new drone system is intended to make sneak attacks in enemy waters and destroy naval strike groups and major operational ports by creating a large radioactive wave through an underwater explosion, the KCNA said. “This nuclear underwater attack drone can be deployed at any coast and port or towed by a surface ship for operation,” the news agency said, adding that Kim oversaw the test. A South Korean military official said they were analysing North Korea’s claims. A U.S. official, speaking on the condition of anonymity, said there was no indication of a nuclear test. It is unclear whether North Korea has fully developed miniaturised nuclear warheads needed to fit on its smaller weapons. Analysts say perfecting such warheads would most likely be a key goal if the North resumes nuclear testing, read the report. A photo released by state media showed Kim smiling next to a large torpedo-shaped object, but did not identify it as the new drone. Other photos showed tracks of the object’s underwater trajectory, and blasts visible on the sea surface. Panda said the weapon’s operational concept was similar to Russia’s Poseidon nuclear torpedoes, a new category of retaliatory weapon meant to create destructive, radioactive blasts in coastal areas. On Friday South Korean President Yoon Suk Yeol said he would make sure North Korea paid for its “reckless provocations”, during a speech to commemorate service members who died in clashes with North Korea in western waters, including a 2010 sinking of a navy ship that South Korea said was struck by a North Korean torpedo. North Korea also said it had fired cruise missiles on Wednesday to practice carrying out tactical nuclear attacks, confirming earlier reports from the South Korean military, Reuters reported. The cruise missiles were tipped with a “test warhead simulating a nuclear warhead,” and flew 1,500-1,800 km (930-1,120 miles), according to KCNA. The latest tests took place as South Korean and U.S. troops launched their largest amphibious landing drills in years, involving a U.S. amphibious assault ship, on Monday. North Korea said military exercises by the United States and South Korea require its forces to “gird themselves for an all-out war and bolster up its nuclear force both in quality and quantity on a priority basis”. Pyongyang has long bristled at exercises conducted by South Korean and U.S. forces, saying they are preparation for an invasion of the North. South Korea and the U.S. say the exercises are purely defensive and have criticised the North’s tests as destabilising and in breach of U.N. sanctions. The allies concluded 11 days of their regular springtime exercises, called Freedom Shield 23, on Thursday, but have other field training exercises continuing. North Korean leader Kim expressed “his will to make the U.S. imperialists and the South Korean puppet regime plunge into despair for their choice,” KCNA said, adding that he warned the enemies that they should stop reckless anti-North Korea war drills. The director of the U.S. Defense Intelligence Agency said on Wednesday North Korean leader Kim does not appear poised to carry out a nuclear test during U.S.-South Korea military exercises, but the United States is staying vigilant.","pubDate":"2023-03-24 04:43:44","image_url":null,"id":"0b4c804b-3862-4ce2-9ba3-bad2c6f1073f"},{"title":"America bombs Syria after an American is killed in a drone strike","link":"https://www.jowhar.com/world-news/america-bombs-syria-after-an-american-is-killed-in-a-drone-strike.html","description":"The US navy carried out a number of air strikes in Syria on Thursday night time towards teams allied with Iran. These identical organizations are accused of being behind a drone strike that killed an American contractor, injured one other, in addition to 5 American troopers. The Pentagon mentioned that an American contractor was killed […]","content":"The US navy carried out a number of air strikes in Syria on Thursday night time towards teams allied with Iran. These identical organizations are accused of being behind a drone strike that killed an American contractor, injured one other, in addition to 5 American troopers. The Pentagon mentioned that an American contractor was killed and 5 American service members and one other American contractor had been wounded when a drone struck a facility at a coalition base in northeastern Syria on Thursday. In a press release issued late Thursday, the Protection Division mentioned the intelligence neighborhood had decided that the drone was of Iranian origin. Protection Secretary Lloyd Austin mentioned US Central Command forces responded with “precision air strikes” towards amenities in jap Syria utilized by teams affiliated with Iran’s Islamic Revolutionary Guard Corps. “The airstrikes had been performed in response to immediately’s assault in addition to a collection of latest assaults towards coalition forces in Syria by teams affiliated with the Iranian Revolutionary Guard,” Austin mentioned. In a single day, movies on social media claimed to indicate explosions in Syria’s Deir Ezzor province, a strategic province that borders Iraq and comprises oil fields. Iran-backed armed factions and Syrian forces management the world, which has additionally witnessed suspected Israeli air strikes in latest months concentrating on Iranian provide routes. North Korea says it has examined an underwater nuclear… ‘Democracy on the road’: French protesters vent… The Syrian state-run information company SANA didn’t instantly acknowledge any strikes. Syria’s mission to the United Nations didn’t instantly reply to a request for remark. The state-run Qatar Information Company reported a cellphone name between its international minister and Jake Sullivan, the US nationwide safety adviser. Doha has been an interlocutor between Iran and the USA just lately amid tensions over Tehran’s nuclear programme. There was no fast response from Iran to the strikes, which come through the holy month of Ramadan. Austin mentioned he licensed the retaliatory strikes on the course of President Joe Biden. “As President Biden has made clear, we are going to take all essential measures to defend our individuals and we are going to at all times reply at a time and place of our selecting,” Austin mentioned. “No group will strike our forces with impunity.” The Pentagon mentioned two of the wounded had been handled on the web site, whereas three others and the injured contractor had been transferred to medical amenities in Iraq. (AP) Prev Post North Korea says it has examined an underwater nuclear assault drone Next Post Koox qorsheyneysay weerar argagixiso oo lagu qabtay magaalada London","pubDate":"2023-03-24 04:34:05","image_url":null,"id":"7f825687-dae2-435f-bdc9-f45ff66ed6a4"},{"title":"Three Women Who Lead the World’s Top Happiest Countries","link":"https://www.khaama.com/three-women-who-lead-the-worlds-top-happiest-countries/","description":"The largest online news service for Afghanistan","content":"Women led the top three countries with the happiest populations. In the acceptable words of Queen Bey, “Who runs the world? Girls.”\n\nFinland, led by Prime Minister Sanna Marin, was crowned as the happiest population in the world, Denmark is the second, whose Prime Minister Mette Frederiksen has served as a leader since June 2019 while, and the third position went to Iceland, whose Prime Minister Karin Jakobsdottir has been in the role since 2017.\n\nThe study considers six factors: income, health, having someone to count on, having a sense of freedom to make a critical life decision, generosity, and finally, the “absence of corruption all play a strong role in supporting life evaluations.”\n\nThese countries have met all the six elements, including better institutions, people free to make important life decisions, and the material conditions of life are excellent in both income and health, the Happiness Report said.\n\nThe two most important factors which make these countries the world’s top happiest countries are: 1. having excellent childcare 2. There is no gender disparity. In other words, women are equal to men.\n\nAccording to the Happiness Report, these factors lead to the happiest population in a country.\n\nFor instance, in all three countries, child benefits are paid from State funds for all children under age 17 while they have cash for childcare schemes for children under age three, and Finland even offers new parents supplementary payments.\n\nIn the meantime, these countries have become some of the world’s best places for working parents.\n\nAlso, these countries are at the top of the rankings for gender equality by the World Economic Forum.\n\nIt shows a clear link between the happiest countries and those that work hard to ensure everyone is safe and that men and women have the same rights.\n\nSweden, New Zealand, and Lithuania are all led by women and are including the top 20 happiest countries in the world which have women leaders.","pubDate":"2023-03-24 03:32:07","image_url":"https://www.khaama.com/wp-content/uploads/2023/03/Women-Leaders.webp","id":"3184995a-9967-4881-a474-41686c053eb8"},{"title":"Video claiming Putin is using body doubles goes viral on Russian social media","link":"https://www.orissapost.com/video-claiming-putin-is-using-body-doubles-goes-viral-on-russian-social-media/","description":"London: A video is going viral on Russian social media claiming Vladimir Putin is conning his people by using multiple body doubles for trips he doesn’t want to make, Daily Mail reported. It seizes on speculation that the Kremlin president’s only trip so far to newly-invaded territory in Mariupol was performed by a doppelganger, and […]","content":"Video claiming Putin is using body doubles goes viral on Russian social media IANS Updated: March 24th, 2023, 09:00 IST in International 0 AP Pic Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin London: A video is going viral on Russian social media claiming Vladimir Putin is conning his people by using multiple body doubles for trips he doesn’t want to make, Daily Mail reported. It seizes on speculation that the Kremlin president’s only trip so far to newly-invaded territory in Mariupol was performed by a doppelganger, and asks: “Who is ruling Russia?” It is unclear who made the footage but it appears to be aimed at reaching Russians who rely on uber-loyalist state media for their news. Putin is widely believed to have had regular plastic surgery as he has aged since first becoming acting president on the last day of 1999, Daily Mail reported. Rumours are rife that Putin ‘understudies’ — who have undergone plastic surgery to resemble him — are deployed increasingly as his health worsens amid rumours of cancer and early stage Parkinson’s. “Evidently the weakest double was sent to Mariupol”, states the video in Russian. “They forgot to put in his jaw.” Earlier Ukraine mocked Putin for allegedly “sending a lookalike to war-ravaged Mariupol” in a high security visit, Daily Mail reported. Kyiv official Anton Gerashchenko posted three images of Putin’s chin and questioned whether they belonged to the same man. He taunted: “What’s up with your chin, Putin?” The Interior Minister advisor posted: ‘Looks like lately his makeup artists (i.e. for the recent trips of the bunker man to the occupied Crimea and Mariupol) had to work with quite a low-quality copy, not even a double but its copy. “I wonder which one of them was real?” One picture showed Putin, 70, one month ago in an address to the Federal Assembly in Moscow. Another was Putin’s reported visit to naval port Sevastopol in Crimea on March 18. And the third was from footage released the following day evidently showing Putin in war-blitzed Mariupol, Daily Mail reported. IANS Tags: Russia social media Vladimir Putin Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts World does not need lessons on democracy and human rights from Pakistan: India at UNHRC March 23, 2023 Pentagon: Budget readies US for possible China confrontation March 23, 2023 India, UK hold bilateral maritime exercise ‘Konkan’ March 23, 2023 Bill introduced in California Senate against caste-based discrimination March 23, 2023 Anger at Macron mounts as French unions hold new protests March 23, 2023 Israel passes law protecting Netanyahu as protests continue March 23, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-03-24 03:30:38","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2022/09/Vladimir-Putin.jpg?fit=300%2C239=1","id":"54998f25-0985-43ba-96f8-d4307456a2eb"},{"title":"8 new cases of Marburg virus confirmed in Equatorial Guinea","link":"https://telanganatoday.com/8-new-cases-of-marburg-virus-confirmed-in-equatorial-guinea","description":"With the confirmation of another 8 cases, Equatorial Guinea's total number of the “highly virulent” Marburg virus cases rise to nine, said the World Health Organisation","content":"8 new cases of Marburg virus confirmed in Equatorial Guinea\n\nWith the confirmation of another 8 cases, Equatorial Guinea's total number of the “highly virulent” Marburg virus cases rise to nine, said the World Health Organisation\n\nBy AP Published Date - 09:00 AM, Fri - 24 March 23\n\nWith the confirmation of another 8 cases, Equatorial Guinea's total number of the “highly virulent” Marburg virus cases rise to nine, said the World Health Organisation\n\nNairobi: Equatorial Guinea has confirmed another eight cases of the “highly virulent” Marburg virus, a deadly hemorrhagic fever with no authorised vaccine or treatment.\n\nThe World Health Organization on Thursday said that brings the country’s total number of cases to nine in the outbreak declared in mid-February. There are two known current outbreaks of Marburg on the African continent.\n\nTanzania this week announced eight cases of Marburg, including five deaths. One of the people killed was a health worker. “Our pathogen genomics team will sequence samples from both places … and see if there is a relationship between the current two outbreaks,” the acting director of the Africa Centers for Disease Control and Prevention, Ahmed Ogwell, said. He said the results should be known within the week.\n\nThe WHO said the new cases were found in the provinces of Kie Ntem, Litoral and Centro Sur, all with borders with Cameroon and Gabon. “The areas reporting cases are about 150 km apart, suggesting wider transmission of the virus,” the UN agency said.\n\nLike Ebola, the Marburg virus originates in bats and spreads between people via close contact with the bodily fluids of infected people, or surfaces, like contaminated bedsheets. Without treatment, Marburg can be fatal in up to 88 per cent of people who fall ill with the disease.\n\nAlso Read Obesity risk might pass from mothers to daughters: Study","pubDate":"2023-03-24 03:30:35","image_url":"https://cdn.telanganatoday.com/wp-content/uploads/2022/02/cropped-android-chrome-512x512-1-267x267-2.png","id":"f69c9e3b-2bd5-43ec-bce9-90970c2bf8e2"},{"title":"Trump created arrest hoax, Republicans messed with probe into Stormy Daniels hush money case: Manhattan DA","link":"https://www.indiatoday.in/world/story/donald-trump-stormy-daniels-hush-money-case-arrest-hoax-republicans-manhattan-da-2350721-2023-03-24?utm_source=rss","description":"The Manhattan prosecutors have said former US President Donald Trump created rumours about his arrest and prompted fellow Republicans to meddle with the Stormy Daniels hush money case.","content":"The Manhattan prosecutors have said former US President Donald Trump created rumours about his arrest and prompted fellow Republicans to meddle with the Stormy Daniels hush money case.\n\nBy India Today World Desk: Manhattan prosecutors have said former US President Donald Trump misled people to believe that he would be arrested this week and prompted fellow Republicans to meddle with the Stormy Daniels hush money case.\n\nLast Saturday, the former president said he would be arrested on Tuesday during the probe by the Manhattan District Attorney's office.\n\nThree Republican chairmen of committees in the US House of Representatives launched an attack on District Attorney Alvin Bragg, a Democrat, accusing him of misusing his prosecutorial power and requesting communications, documents, and testimony from him. As of Wednesday, no indictment was issued by the grand jury hearing evidence in the Stormy Daniels case, and on Thursday, Bragg's office sent a letter to the committee chairmen, which was accessed by Reuters.\n\nadvertisement\n\nALSO READ | Trump lawyer ordered to turn over Mar-a-Lago case documents\n\nThe letter stated that the accusations made by the chairmen \"only emerged after Donald Trump created a false expectation that he would be arrested the next day and his lawyers reportedly urged you to intervene.\" It confirmed that Bragg's office was investigating \"allegations that Donald Trump violated New York State's penal law.\"\n\nIf charged, Trump would be the first US president to face criminal charges. Despite facing legal challenges on various fronts, including federal investigations into his handling of government documents after leaving office and alleged attempts to overturn his 2020 election defeat, as well as a state-level investigation in Georgia into his alleged unlawful efforts to overturn the 2020 election results there, Trump has announced that he will continue to campaign for the presidency if charged with a crime.\n\nOn Thursday, Bragg's office responded, stating that the three Republican House committee chairmen had requested non-public information regarding a confidential pending criminal investigation, which is protected under state law.\n\nALSO READ | Facebook and YouTube unban Donald Trump ahead of 2024 US Presidential elections\n\n\"The letter's requests are an unlawful incursion into New York's sovereignty,\" said the letter signed by the district attorney's general counsel, Leslie Dubeck. \"Congress cannot have any legitimate legislative task relating to the oversight of local prosecutors enforcing state law.\"\n\nThe grand jury comprising Manhattan-based US citizens convened in January and their proceedings are kept confidential with prosecutors prohibited from disclosing any information. Although there were reports in the media that the grand jury would not be taking up the case on Thursday, it was not anticipated to convene again until at least next week. Possible criminal charges loom over former US President Donald Trump for allegedly concealing hush payments made to retired porn actress Stormy Daniels.\n\nThe actress claims to have had sexual relations with Trump and received $130,000 from his former lawyer, Michael Cohen, before the 2016 election, in exchange for her silence regarding the incident. Cohen was subsequently imprisoned on various charges.\n\nTrump has denied any sexual involvement with Daniels since the allegations were made public in 2018.\n\n--- ENDS ---","pubDate":"2023-03-24 02:07:19","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/trump_iowa_0-sixteen_nine.jpg?VersionId=lLaDPjRxdCPjWDt12tLqC4r9nXmemap4","id":"bfeaf813-e74f-436c-ae2c-72731e9d6aee"},{"title":"Biden administration adds 14 Chinese firms to red flag list","link":"https://www.indiatoday.in/world/story/biden-administration-adds-chinese-firms-to-red-flag-list-2350722-2023-03-24?utm_source=rss","description":"The Joe Biden administration on Thursday added 14 Chinese firms to a red flag list, forcing US exporters to conduct greater due diligence before shipping goods to them.","content":"The Joe Biden administration on Thursday added 14 Chinese firms to a red flag list, forcing US exporters to conduct greater due diligence before shipping goods to them.\n\nFlags of US and China are seen in this illustration | Reuters\n\nBy Reuters: The Joe Biden administration on Thursday added 14 Chinese companies to a red flag list, forcing US exporters to conduct greater due diligence before shipping goods to them because US officials have been unable to inspect the listed entities.\n\nBeing added to the list can potentially start a 60-day clock that could trigger much tougher penalties.\n\n\"Enforcing our export controls is a crucial part of protecting American national security,\" US Deputy Secretary of Commerce Don Graves said in a statement following the announcement. \"We are committed to using all of the tools at our disposal to establish how advanced US technology is being used around the globe.\"\n\nALSO READ Joe Biden expected to tighten rules on US investment in China\n\nadvertisement\n\nECOM International and HK P&W Industry Co Ltd were among those added to the list and did not respond to requests for comment. A spokesperson for the Chinese Embassy in Washington said \"China strongly deplores and firmly opposes\" moves by the United States to \"abuse export control measures\" and use \"state power to suppress and contain foreign companies.\"\n\n\"The US side should immediately stop its wrong practices. China will take necessary measures to resolutely safeguard the legitimate rights and interests of Chinese companies,\" the spokesperson added.\n\nALSO READ Several Chinese state-owned firms to delist from US stock exchange NYSE\n\nThe United States has used restrictions on exports of US goods as a key tool to thwart Beijing's technological advances, ratcheting up tensions between the two countries.\n\nThe Commerce department, which oversees US export controls, also added 18 other entities to the list from Turkey, the United Arab Emirates, Germany, Bulgaria, Canada, Indonesia, Israel, Malaysia, Saudi Arabia and Singapore.\n\nALSO WATCH Mastermind of China-linked shell companies arrested while trying to flee India\n\n--- ENDS ---","pubDate":"2023-03-24 02:04:32","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/china-us-reuters-sixteen_nine.jpg?VersionId=hvQauJ2sxMalU5ohBYkekdCiShGZzHCC","id":"de0239b0-1927-4ddc-b0f7-e58da3d2f7c3"},{"title":"US, Canada reach agreement to stop asylum seekers at unofficial crossings: Reports","link":"https://www.indiatoday.in/world/story/us-canada-reach-agreement-to-stop-asylum-seekers-at-unofficial-crossings-joe-biden-justin-trudeau-meet-2350720-2023-03-24?utm_source=rss","description":"Joe Biden is on a visit to Canada, where he would discuss a range of issues with Canadian Prime Minister Justin Trudeau. Border crossings between the two countries are governed by STCA, which allows US and Canadian officials to turn back asylum seekers in both directions at formal ports of entry.","content":"Joe Biden is on a visit to Canada, where he would discuss a range of issues with Canadian Prime Minister Justin Trudeau. Border crossings between the two countries are governed by STCA, which allows US and Canadian officials to turn back asylum seekers in both directions at formal ports of entry.\n\nFILE PHOTO: US President Joe Biden shakes hands with Canadian Prime Minister Justin Trudeau during a bilateral meeting at the North American Leaders' Summit in Mexico City (Credits: Reuters)\n\nBy India Today World Desk: The United States and Canada may have reached a deal to stop asylum seekers from entering the shared land border via unofficial crossings, Reuters quoted a source with the Canadian government and a US official as saying.\n\nAccording to the report, the details of the deal still need to be talked out.\n\nThe revised Safe Third Country Agreement (STCA) will be discussed on Friday at an official face-to-face between US President Joe Biden and Canadian Prime Minister Justin Trudeau in Ottawa, with the announcement likely afterward, the report stated.\n\nadvertisement\n\nALSO READ Joe Biden pushes for abortion rights during Women's History Month\n\nBiden arrived in Canada on Thursday on his long-delayed visit to express unity on Ukraine.\n\nThe US President will address the Parliament on Friday with Trudeau.\n\nThe two leaders and their wives met privately at Trudeau's residence in the evening.\n\nUS President Joe Biden and US first lady Jill Biden meet with Canadian Prime Minister Justin Trudeau and his wife Sophie Gregoire Trudeau at Rideau Cottage in Ottawa, Ontario, Canada (Credits: Reuters)\n\nASYLUM SEEKERS\n\nTrudeau has been under pressure to stop the flow of asylum seekers in Quebec, the mainly French-speaking province where he holds his parliamentary seat.\n\nAs part of the agreement, Canada will take in a additional 15,000 migrants over the next year on a humanitarian basis from the Western Hemisphere, the US official told Reuters.\n\nALSO READ Donald Trump lashes out at Biden as jury probes porn star hush money case\n\nBorder crossings between the two countries are governed by STCA, which allows US and Canadian officials to turn back asylum seekers in both directions at formal ports of entry, but does not apply to unofficial crossings like Quebec's Roxham Road.\n\nRoxham Road, a dirt path that has become a route of choice for asylum-seekers, made international headlines in 2017 soon after former US President Donald Trump started to crack down on illegal migrants, resulting in a huge inflow of asylum seekers into Canada.\n\nUS and Canada share the longest land border in North America and the new agreement would expand the pact so that it applies to the entire length and asylum seekers apprehended using unofficial crossings will be turned back.\n\nCanada has been pushing the United States to extend the deal for a while.\n\nIn recent months, there has been a sharp increase in asylum seekers entering Canada through unofficial border crossings.\n\nSpeaking to reporters on Wednesday, Trudeau said the US and Canadian governments had been working to resolve the \"complex\" issue of irregular border crossings for many months and that he hoped to make an announcement about it soon.\n\nALSO READ Russian missiles batter Ukraine, but Bakhmut offensive seen stalling\n\n--- ENDS ---","pubDate":"2023-03-24 01:56:32","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/collage_maker-24-mar-2023-07-03-am-7777-sixteen_nine.jpg?VersionId=Dw5hSoBJldRdO0Gp3Uw_ZNE3txCi.S.y","id":"66b299cb-73b4-4c40-8b2e-e30fe28e76f9"},{"title":"North Korea confirms it tested new nuclear-capable underwater attack drone","link":"https://www.indiatoday.in/world/story/north-korea-confirms-tested-new-nuclear-capable-underwater-attack-drone-2350716-2023-03-24?utm_source=rss","description":"North Korea says it tested 'Haeil', a new nuclear-capable underwater attack drone system that can cause an explosion by generating a radioactive tsunami.","content":"North Korea says it tested 'Haeil', a new nuclear-capable underwater attack drone system that can cause an explosion by generating a radioactive tsunami.\n\nNorth Korean leader Kim Jong Un and his daughter Kim Ju Ae watch a missile drill at an undisclosed location. (Photo: KCNA through Reuters)\n\nBy Reuters: North Korea has tested a new nuclear-capable underwater attack drone that can generate a radioactive tsunami, state media reported on Friday, as it blamed joint military drills by South Korea and the US for raising tensions in the region.\n\nDuring the drill, the new North Korean drone cruised underwater at a depth of 80 to 150 metres (260-500 feet) for over 59 hours and detonated in waters off its east coast on Thursday, North Korean state news agency KCNA said.\n\nadvertisement\n\nALSO READ | North Korea fires multiple cruise missiles off its east coast, says South Korea\n\nDubbed \"Haeil\", or tsunami, the drone system is intended to make sneak attacks in enemy waters and destroy naval striker groups and major operational ports by making a super-scale radioactive wave through an underwater explosion, the KCNA said.\n\n\"This nuclear underwater attack drone can be deployed at any coast and port or towed by a surface ship for operation,\" the news agency said, adding the test had been overseen by leader Kim Jong Un.\n\nIt is unclear whether North Korea has fully developed miniaturised nuclear warheads needed to fit on its smaller weapons.\n\nAnalysts say perfecting smaller warheads would most likely be a key goal if the North resumes nuclear testing.\n\nLeif-Eric Easley, a professor at Ewha University in Seoul, said Pyongyang's latest claim to have a nuclear-capable underwater drone \"should be met with skepticism.\"\n\n\"But it is clearly intended to show that the Kim regime has so many different means of nuclear attack that any preemptive or decapitation strike against it would fail disastrously,\" he said.\n\nALSO READ | North Korea doesn't appear poised for imminent nuclear test, says US\n\nCRUISE MISSILES\n\nKCNA also confirmed the North fired cruise missiles on Wednesday to practice carrying out tactical nuclear attack missions, confirming earlier reports from the South Korean military.\n\nThe cruise missiles were tipped with a \"test warhead simulating a nuclear warhead,\" and flew 1,500-1,800 km (930-1120 miles), according to KCNA.\n\nThe drill verified the reliability of its control devices and detonators in a mid-air explosion and served as a demonstration of another military attack capability, KCNA added.\n\nThe North said the latest weapon test and drills had no negative impact on security of the neighbouring countries.\n\nALSO READ | How plump, well-dressed daughter of Kim Jong Un is upsetting North Koreans: Report\n\nThe latest tests took place as South Korean and US troops launched their largest amphibious landing drills in years, involving a U.S. amphibious assault ship, on Monday.\n\nNorth Korea said the U.S. and South Korea were driving the situation on the Korean peninsula to an \"irreversibly dangerous point\" with their exercises, and that such moves require its forces to \"gird themselves for an all-out war and bolster up its nuclear force both in quality and quantity on a priority basis.\"\n\nadvertisement\n\nThe U.S. ship, USS Makin Island, docked at a naval base in South Korea's southeastern port city of Busan on Wednesday, carrying 10 F-35 stealth fighters.\n\nPyongyang has long bristled at exercises conducted by South Korean and U.S. forces, saying they are preparation for an invasion of the North.\n\nSouth Korea and the U.S. say the exercises are purely defensive and have criticised the tests as destablising and in breach of U.N. sanctions.\n\nThe allies concluded 11 days of their regular springtime exercises, called Freedom Shield 23, on Thursday, but they have other field training exercises continuing.\n\nALSO READ | North Korea's Kim Jong Un calls for nuclear attack readiness after US-South Korea war games\n\n--- ENDS ---","pubDate":"2023-03-24 01:34:36","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/kim_jong_un_with_daughter-sixteen_nine.jpg?VersionId=VvGd40tmtU7gbXJBJmnTxdRutfv.iB_x","id":"27256218-bba9-4e3e-a8a9-a25caceea8f6"},{"title":"US court blocks Covid-19 vaccine mandate for govt workers","link":"https://www.indiatoday.in/world/story/us-court-blocks-covid19-vaccine-mandate-for-united-states-government-workers-2350715-2023-03-24?utm_source=rss","description":"The US federal court has blocked an order by President Joe Biden, who in September 2021, mandated vaccinations for all executive branch agency employees, with exceptions for medical and religious reasons.","content":"The US federal court has blocked an order by President Joe Biden, who in September 2021, mandated vaccinations for all executive branch agency employees, with exceptions for medical and religious reasons.\n\nFILE - Pfizer, left, and Moderna bivalent COVID-19 vaccines are readied for use at a clinic (Credirs: AP)\n\nBy Associated Press: President Joe Biden’s order that federal employees get vaccinated against COVID-19 was blocked Thursday by a federal appeals court.\n\nThe 5th U.S. Circuit Court of Appeals in New Orleans rejected arguments that Biden, as the nation’s chief executive, has the same authority as the CEO of a private corporation to require that employees be vaccinated.\n\nThe ruling from the full appeals court, 16 full-time judges at the time the case was argued, reversed an earlier ruling by a three-judge 5th Circuit panel that had upheld the vaccination requirement. Judge Andrew Oldham, nominated to the court by then-President Donald Trump, wrote the opinion for a 10-member majority.\n\nadvertisement\n\nThe ruling maintains the status quo for federal employee vaccines. It upholds a preliminary injunction blocking the mandate issued by a federal judge in January 2022. At that point, the administration said nearly 98% of covered employees had been vaccinated.\n\nAnd, Oldham noted, with the preliminary injunction arguments done, the case will return to that court for further arguments, when “both sides will have to grapple with the White House’s announcement that the COVID emergency will finally end on May 11, 2023.”\n\nOpponents of the policy said it was an encroachment on federal workers’ lives that neither the Constitution nor federal statutes authorize.\n\nALSO READ Biden signs bill on Covid-19 origins declassification\n\nBiden issued an executive order in September 2021 requiring vaccinations for all executive branch agency employees, with exceptions for medical and religious reasons. The requirement kicked in the following November. U.S. District Judge Jeffrey Brown, who was appointed to the District Court for the Southern District of Texas by Trump, issued a nationwide injunction against the requirement the following January.\n\nThe case then went to the 5th Circuit.\n\nOne panel of three 5th Circuit judges refused to immediately block the law.\n\nBut a different panel, after hearing arguments, upheld Biden’s position. Judges Carl Stewart and James Dennis, both nominated to the court by President Bill Clinton, were in the majority. Judge Rhesa Barksdale, nominated by President George H.W. Bush, dissented, saying the relief the challengers sought does not fall under the Civil Service Reform Act cited by the administration.\n\nThe broader court majority agreed, saying federal law does not preclude court jurisdiction over cases involving “private, irreversible medical decisions made in consultation with private medical professionals outside the federal workplace.”\n\nA majority of the full court voted to vacate that ruling and reconsider the case. The 16 active judges heard the case on Sept. 13, joined by Barksdale, who is now a senior judge with lighter duties than the full-time members of the court.\n\nJudge Stephen Higginson, a nominee of former President Barack Obama, wrote the main dissenting opinion. “For the wrong reasons, our court correctly concludes that we do have jurisdiction,” Higginson wrote. “But contrary to a dozen federal courts — and having left a government motion to stay the district court’s injunction pending for more than a year — our court still refuses to say why the President does not have the power to regulate workplace safety for his employees.”\n\nALSO READ National Task Force on Covid-19 revises treatment guidelines for adults\n\n--- ENDS ---","pubDate":"2023-03-24 01:29:32","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/collage_maker-24-mar-2023-06-50-am-2859-sixteen_nine.jpg?VersionId=1psgJR5O4Urdfpd8LotW_fMjhZdcE0Eq","id":"e2c631e5-874f-43ad-abc1-41a63a754f31"},{"title":"Coronavirus pandemic originated from illegally traded wild animals in Wuhan: Research","link":"https://telanganatoday.com/coronavirus-pandemic-originated-from-illegally-traded-wild-animals-in-wuhan-research","description":"A team of Chinese investigators found that the cages typically used for transporting animals had tested positive for coronavirus","content":"Coronavirus pandemic originated from illegally traded wild animals in Wuhan: Research\n\nA team of Chinese investigators found that the cages typically used for transporting animals had tested positive for coronavirus\n\nBy ANI Published Date - 06:30 AM, Fri - 24 March 23\n\nPhoto: ANI\n\nWuhan: Chinese investigators have recently released a report that described in detail that illegally traded wild animals triggered the coronavirus pandemic, reported The New York Times.\n\nA team of Chinese investigators on January 12, 2020, combed a market for clues regarding the emergence of a strange new illness in the city of Wuhan. The team found that the cages typically used for transporting animals had tested positive for coronavirus.\n\nThe genetic material from that swab, which was covertly uploaded to a global database and only made public this year, has been examined by a group of international specialists three years later. The scientists, in a study that was made public on Monday night, said the swab evidence supports their contention that the coronavirus pandemic was started by illegally traded wild animals.\n\nAfter being approached by the international team, the Chinese researchers who had uploaded the raw data requested that it be taken down from the database. In response to what they claimed were rules violations, database administrators have now denied access to the international researchers, raising concerns about the database’s own role in the struggle for access to information that could provide insight into the origins of a virus that has killed seven million people.\n\nAccording to a report published in The New York Times, the swab from the cart held more than 4,500 lengthy fragments of raccoon dog genetic material in addition to coronavirus genetic signatures, the report stated. There were none from people.\n\nAccording to the study, some Covid-positive swabs from other items and market surfaces also contained more genetic material from animals than from people.\n\nAnimals themselves were not necessarily infected just because genetic material from the virus was discovered in the same location as animal genetic traces. Some scientists who read the report, however, noted that the prevalence of genetic material from animals, particularly raccoon dogs, indicated that species known to be able to spread the coronavirus were in fact carrying infections at market in late 2019.\n\nThey claimed that scenario, which was similar to the ones that led to the first SARS epidemic in China two decades earlier, was consistent with virus spreading into humans from market animals and sparking pandemic.\n\nTheodora Hatziioannou, a virologist at The Rockefeller University in New York, who was not involved in the research, said, “You look at them and say those are probably infected animals,” adding, “If it was a human shedding the virus, one would expect to find human DNA there, too.” More information about the origins of the virus in the samples may still be found in the swab. For instance, the report stated that there was proof of specific genes that might indicate the substance originated from a raccoon dog’s upper respiratory tract, reported The New York Times.\n\nHowever, even if an animal had the disease, it might not be obvious that it had exposed humans to the infection. A market animal might have fallen ill from someone who was afflicted with the virus. And since the market was cleared of animals shortly after the outbreak started, scientists were unable to determine whether an animal had been infected by swabbing it directly.\n\nThe report has been the focus of intense speculative discussion ever since the international experts presented their findings to the World Health Organization last week and then hurried to assemble their analyses. The discoveries also sparked a fight over access to the genetic codes that underlie them.\n\nAfter publishing a paper describing them last year, Chinese researchers first uploaded the raw sequences to a global database. However, the material was taken offline after the international experts made their discovery in early March and informed Chinese researchers of it.\n\nA report published in The New York Times read, the WHO censured China last week for three years of keeping such important information secret from the rest of the world. The Munich-based nonprofit GISAID, which manages the database, is currently under fire for its involvement in regulating data access.\n\nThe international team of scientists claimed that by allowing the Chinese researchers to withhold the data for such a prolonged period of time, GISAID had “deviated from its stated mission,” according to the new report.\n\nIn response to the story on Tuesday, the database administrators disabled the team members’ access to their online accounts and claimed they had broken the rules by posting their own analysis before the Chinese scientists had even finished.\n\nThe researchers claimed that in downloading and analyzing the sequences, they adhered to the terms of the GISAID database access agreement. They also mentioned that they had extended numerous invitations to collaborate with the Chinese researchers.\n\nMichael Worobey, an evolutionary biologist at the University of Arizona and a co-author of the new report, noted that GISAID also jeopardized team members’ work related to coronavirus variants and flu preparedness, adding that “the ramifications of cutting off access to this group of authors are huge.” “They’re accusing you in error.” Because so much of the animals’ genetic material was discovered in the key swab from the cart and because they are known to transmit viruses, the international team zeroed in on raccoon dogs, fluffy mammals related to foxes that are sold for their flesh and fur.\n\nThey claimed that their research supported the theory that the virus, which had its origins in bats, was being carried by the animal and being transmitted to people at the market.\n\nJoel Wertheim, an evolutionary biologist at the University of California, San Diego and a co-author of the study, said of the new genetic information, “This isn’t an infected animal.” But without the animal in front of you, this is the nearest you can get, The New York Times reported.\n\nKristian Andersen, a virologist at the Scripps Research Institute in La Jolla, California, and a co-author of the report, however, noted that the report also provided the most conclusive proof of other animals susceptible to the virus being sold at the market to this point.\n\nAdditionally, swabs that tested positive for the coronavirus contained genetic material from those animals, including the masked palm civet, a small Asian mammal that was connected to the SARS epidemic 20 years ago.\n\nRegarding the variety of animals listed in the report, Joseph DeRisi, a professor of biochemistry at the University of California, San Francisco and the head of the Chan Zuckerberg Biohub, said, “It’s literally Disney Land for zoonotic transfer.” Large amounts of human genetic material were discovered in several other swabs from the market, which the study said was evidence that some virus samples were probably being shed by infected individuals. Many of the earliest known Covid patients either worked or shopped at the market.\n\nAccording to the study, genetic material from animals not thought to be virus susceptible predominated in other positive swabs. For instance, a sample obtained from the surface of fish packaging revealed a significant amount of fish genetic material. Scientists concluded that the virus was probably human-deposited, demonstrating that the presence of large quantities of animal genetic material did not imply that the virus was created by animals in that location.\n\nSome scientists cited those results in claiming that the types of swabs examined in the study simply could not provide concrete evidence of an infected animal.\n\nAccording to Sergei Pond, a virologist at Temple University in Philadelphia, “The report does contain useful information.” But did it reveal anything about which mammal was infected, he continued? Really, it doesn’t.\n\nMicrobiologist Dr David Relman of Stanford said that without additional information on the methods used by the Chinese researchers to collect and analyze their swabs, it was impossible to evaluate the results. He pointed out that the Chinese paper from the previous year detailed using a kit to remove human genetic material and increase the tests’ sensitivity to the virus.\n\nHowever, several of the swabs from the Chinese researchers that were mentioned in the report of the international team contained significant quantities of human genetic material, indicating that those filtering techniques had not removed all of the human material from the samples. Such kits were usually ineffective at erasing people’s genetic signatures, according to Dr DeRisi, an expert in the kind of analysis detailed in the report.\n\nThe report’s methodologies were sound, according to Frederic Bushman, a microbiologist at the University of Pennsylvania who also specializes in sequencing methods.\n\nHe stated, “I think the simplest answer is that it’s an infected raccoon dog. “I don’t think it’s absolute proof,” The New York Times reported.","pubDate":"2023-03-24 01:00:13","image_url":"https://cdn.telanganatoday.com/wp-content/uploads/2023/03/Wuhan.jpg","id":"f66456e3-2d4a-4e3b-9354-a6f5ab487282"},{"title":"US lawmakers turn focus to plight of Uyghurs in China","link":"https://www.arabnews.com/node/2274616/world","description":"WASHINGTON: Two women who experienced life in Chinese “reeducation” camps for Uyghurs told lawmakers Thursday of lives under imprisonment and surveillance, rape and torture as a special House committee focused on countering China shined a light on human rights abuses in the country. Qelbinur Sidik, a member of China’s ethnic Uzbek minority who was forced to teach Chinese in","content":"WASHINGTON: Two women who experienced life in Chinese “reeducation” camps for Uyghurs told lawmakers Thursday of lives under imprisonment and surveillance, rape and torture as a special House committee focused on countering China shined a light on human rights abuses in the country.\n\nQelbinur Sidik, a member of China’s ethnic Uzbek minority who was forced to teach Chinese in separate detention facilities for Uyghur men and women, told lawmakers of male Uyghur detainees held chained and shackled in cells so tiny they had to crawl out when authorities summoned them. “They were called by numbers for interrogations. And then you would hear horrible screaming sounds from torture,” she said.\n\nInnocent female Uyghur detainees were held by the thousands, heads shaved, in gray uniforms, Sidik said. Guards tortured the women by electric shocks and by gang rape, sometimes combining both. “And I have witnessed an 18- to 20-year-old girl” slowly bleed to death from the treatment, Sidik said.\n\nReeducation camps intended to drain the Uyghur inmates of their language, religious beliefs and customs forced men and women into “11 hours of brainwashing lessons on a daily basis,” testified Gulbahar Haitiwaji, a Uyghur who spent more than two years in two reeducation camps and police stations.\n\n“Before eating, we have to praise them, say that we are grateful ... for China’s Communist Party and we are grateful for (President) Xi Jinping,” Haitiwaji said. “And after, to finish eating, we have to praise them again.”\n\nAccused of “disorder” and detained with 30 to 40 people in a cell meant for nine, the Uyghur woman said, she and other female detainees were chained to their beds for 20 days at one point.\n\nDetention left her gaunt. Freed and sent to France thanks to a pressure campaign by her family there in 2019, she was given more food by Chinese authorities before her release, so her appearance would not speak of her mistreatment.\n\nIn parting, Chinese officials warned Haitiwaji that “whatever I had witnessed in the concentration camp I should not talk about it,” she said. “If I do, they will retaliate against my family back home.”\n\nThe US and many other governments, the United Nations, and human rights groups accuse China of sweeping a million or more people from its Uyghur community and other predominantly Muslim ethnic minority groups into detention camps, where many have said they were tortured, sexually assaulted, and forced to abandon their language and religion. China denies the accusations, which are based on evidence including interviews with survivors and photos and satellite images from Uyghur’s home province of Xinjiang, a major hub for factories and farms in far western China.\n\n“For a long time, some US politicians have repeatedly used Xinjiang-related issues to stir up rumors and engage in political manipulation under the pretext of human rights, in an attempt to tarnish China’s image and curb China’s development,” said Liu Pengyu, a spokesman for the Chinese Embassy in Washington.\n\nThe Chinese government’s actions in Xinjiang were about “countering violence, terrorism, radicalization and separatism,” the embassy spokesman insisted.\n\nThe accusations also include draconian birth control policies, all-encompassing restrictions on people’s movement and forced labor.\n\nThe early focus on the plight of Uyghurs by the Select Committee on the Chinese Communist Party is designed to show the Chinese government’s true nature, said Rep. Mike Gallagher of Wisconsin, the committee’s Republican chairman.\n\n“They are the first-hand witnesses to the systemic, unimaginable brutality, witnesses to the attempted elimination of a people, a culture, a civilization,” Gallagher said Thursday.\n\nIn advance of the hearing, human rights experts talked about the importance of focusing on treatment of the Uyghurs, including Elisha Wiesel. He is the son of the late Elie Wiesel, a Holocaust survivor and the author of the memoir “Night” about his experiences during the Holocaust and living in concentration camps.\n\n“Looking at the world stage right now, it’s clear to me that there is no crime on such a massive scale taking place as what’s taking place with the Uyghur people,” Wiesel said.\n\nWiesel said that both the Trump and Biden administrations had been active on the topic, and pointed to passage of a bill on forced labor and sanctions against companies shown to be using forced labor of Uyghurs. “This is exactly the sort of pressure that needs to be continued,” he said.\n\nLaura Murphy, a researcher at Sheffield Hallam University in the United Kingdom, specializes in American businesses that draw on forced labor. She said it was important for the United States to keep identifying and penalizing companies using Uyghur forced labor.\n\n“Most companies ... they not only don’t know, they intentionally don’t know,” Murphy said.\n\nOutside of the sectors of cotton and components of solar panels, two industries in China that the US and others say relies heavily on forced labor by detained Uyghurs, companies that draw on supplies from China “would prefer not to look into it,” she said.\n\n“So long as businesses continue to do business with the Uyghur region ... they are financing a genocide,” Murphy said.\n\nThe US should step up legislation rewarding companies that have shown they make no use of Uyghur forced labor, in terms of access to US markets, and increase information-sharing on companies that haven’t, she said.\n\nThe hearing also comes following Chinese President Xi Jinping’s trip to Russia to show support for President Vladimir Putin, underscoring just how badly US relations with China have deteriorated.\n\n“What we’re seeing here is increasingly a de facto alliance against America and our allies to try and undercut our interests,” Gallagher said.\n\nThe formation of the special China committee this year was a top priority of House Speaker Kevin McCarthy, R-Calif., but close to 150 Democrats also voted for the committee’s creation, and its work has been unusually bipartisan so far.\n\n“This hearing is important because what happens to the Uyghur community in China impacts Americans at home,” said the committee’s ranking Democrat, Rep. Raja Krishnamoorthi of Illinois. “It’s in the goods produced with slave labor, it’s the degradation of human rights that makes the world less safe, and it’s the ceaseless persecution of Uyghurs abroad that includes those living in America.”\n\nHaitiwaji, the ethnic Uyghur woman testifying before the committee, said she is speaking out because she feels an obligation to speak for those still languishing in detention centers. She is calling on lawmakers to follow the example of Canada, which has adopted a policy of accepting 10,000 Uyghur refugees from around the world.\n\n“Please rescue Uyghur and other Turkic refugees, like Canada has done,” she said in her prepared remarks. “Please stop American companies from continuing to be complicit in surveilling our people and profiting from their labor.”","pubDate":"2023-03-24 00:58:11","image_url":"https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2023/03/24/3741066-610999939.jpg?itok=m6vdHGuN","id":"ae8bc3e0-5f59-4b9a-9ff5-d1367f6a71e9"},{"title":"Central banks hike rates as turmoil hits bank shares again","link":"https://cyprus-mail.com/2023/03/23/central-banks-hike-rates-as-turmoil-hits-bank-shares-again/","description":"The Bank of England on Thursday followed the Federal Reserve and the Swiss National Bank in pressing on with interest rate hikes, arguing the UK banking sector was strong enough to withstand the instability that rippled through markets this month. Investors have dumped banking stocks globally over the past two...","content":"The Bank of England on Thursday followed the Federal Reserve and the Swiss National Bank in pressing on with interest rate hikes, arguing the UK banking sector was strong enough to withstand the instability that rippled through markets this month. Investors have dumped banking stocks globally over the past two weeks, with rapid interest rate hikes to rein in inflation blamed by some as the root cause of the debacle. U.S. lender Silicon Valley Bank’s collapse over bond-related losses tied to a surge in interest rates was the initial trigger for the turmoil, and JPMorgan Chase & Co analysts estimate the “most vulnerable” U.S. banks likely lost a total of about $1 trillion in deposits since last year. Half of the outflows occurred in March after SVB’s collapse, they said. But policymakers have stressed the turmoil is different from the financial crisis 15 years ago, and the Bank of England became the latest central bank to hike rates this week. After its eleventh straight hike, the BoE said it had noted the “large and volatile moves” in financial markets, but that Britain’s banking system remained resilient. “We’ve had events in the last two weeks particularly which have signalled problems that have had to be dealt with in the global banking system. And there has been very prompt action,” BoE governor Andrew Bailey told broadcasters. “We have learnt a lot of lessons from the financial crisis. Of course, we keep learning lessons, but I’m confident that the banks in (Britain) are in a much stronger position,” he said. BANK SHARES FALL While recent market jitters have eased, they have prompted investors to adjust to more challenging economic and lending conditions ahead. The index of top European banks fell 2.5%, with German banking giants Deutsche Bank and Commerzbank falling 3.2% and 4.1%, respectively. London-headquartered HSBC dropped 2.9%. U.S. banking shares initially rose with traders citing the Fed’s hints that it could soon pause further increases in borrowing costs as a source of some relief, but later turned negative. Troubled U.S. regional lender First Republic Bank , which is among banks speaking to peers and investment firms about potential deals, fell 7.6% after rebounding as much as 10% earlier in the session. About 90% of the bank’s stock market value has evaporated this month, leaving it with a market capitalization of about $2 billion. “Despite the strong efforts to protect, particularly First Republic, the crisis continues and investors are left wondering what is it that I’m not seeing,” said Rick Meckler, partner at Cherry Lane Investments in New Vernon, New Jersey. Other U.S. banks under the microscope after the demise of SVB and Signature Bank added to recent losses. PacWest Bancorp tumbled about 10%, Comerica fell 8.7% and Zion Bancorp lost over 6%. Truist Securities cut its price targets on regional banks including Zions and Comerica, warning of slower growth and higher credit costs. The S&P 500 banks index dipped 1.1% to its lowest level since November 2020, and it has now fallen over 40% from its record high in February 2022. BANK BOND PRESSURE Earlier on Thursday, the Swiss National Bank raised its benchmark interest rate by 50 basis points and said the takeover of Credit Suisse – the biggest name ensnared by recent turmoil – by its Swiss rival UBS had averted a financial disaster. To stop investor panic from spreading, the Swiss bank was rushed into the deal on Sunday with UBS Group AG, which along with Swiss authorities is racing to close the takeover within as little as a month, according to two sources with knowledge of the plans. Spokespeople for UBS and Credit Suisse declined to comment. Swiss authorities had urged the banks to come together and offered financial guarantees worth up to 260 billion Swiss francs ($280 billion) to get the deal done. “At this moment the focus has to be that we can maintain financial stability and that the closing of the deal is smooth and fast,” SNB Chair Thomas Jordan told a news conference. Citigroup downgraded Europe’s banking sector, warning the rapid pace of interest rate hikes will further weigh on economic activity and lenders’ profits. The rescue of Credit Suisse has ignited broader concerns about investors’ exposure to a fragile banking sector. Switzerland’s financial market regulator FINMA defended its decision to impose steep losses on some of Credit Suisse bondholders as part of its rescue, saying the move was legally watertight. The decision to prioritise shareholders over Additional Tier 1 (AT1) bondholders rattled the $275 billion AT1 bond market and some Credit Suisse AT1 bondholders were seeking legal advice. The convertible bonds were designed to be invoked during rescues to prevent the costs of bailouts falling onto taxpayers as it happened during the global financial crisis in 2008. Politicians are also wary of public perceptions that banks are being bailed out again, after anger over the sector’s costly rescue in 2008. U.S. authorities say the recent support for SVB, in which all the bank’s deposits were protected, did not amount to a taxpayer-funded bailout. The U.S. Senate Banking Committee called on the former chief executives of SVB and Signature Bank to testify as lawmakers weigh possible action. “You must answer for the bank’s downfall,” the panel’s Democratic chair and ranking Republican wrote in separate letters to former SVB Chief Executive Gregory Becker and former Signature Bank CEO Joseph DePaolo.","pubDate":"2023-03-23 19:39:05","image_url":null,"id":"0935783c-f431-47fa-8200-a914877eb8d5"},{"title":"Russian suspect facing extradition from Italy to U.S. evades house arrest","link":"https://cyprus-mail.com/2023/03/23/russian-suspect-facing-extradition-from-italy-to-u-s-evades-house-arrest/","description":"A Russian businessman facing extradition from Italy to the United States has escaped from house arrest, Italian police said on Thursday. Artem Uss is due to face charges in the United States for shipping oil from Venezuela in breach of sanctions, and for bank fraud. The suspect has been on...","content":"A Russian businessman facing extradition from Italy to the United States has escaped from house arrest, Italian police said on Thursday. Artem Uss is due to face charges in the United States for shipping oil from Venezuela in breach of sanctions, and for bank fraud. The suspect has been on the run at least since Wednesday afternoon, when his electronic tag sent out an “evasion alarm”, the Carabinieri police said in a statement. Officers checked in at his home in Basiglio, in the outskirts of Milan, only to find that he had gone, and are now actively looking for him, the Carabinieri added. Uss’ Italian lawyer Vinicio Nardo had no comment. An Italian court had agreed to transfer the Russian to the United States on Tuesday, but only on two of the four counts with which he was charged by U.S. authorities. The court ruled against handing over the suspect for the additional alleged crimes of smuggling military technology from the United States to Russia and money laundering. U.S. prosecutors last year charged Uss and four other Russian citizens with shipping military technologies bought from U.S. manufacturers to Russian buyers, some of which ended up on the battlefield in Ukraine. They used a German company to ship the military technologies, as well as Venezuelan oil, to Russian purchasers, prosecutors said.","pubDate":"2023-03-23 19:22:17","image_url":null,"id":"9fff9088-60d8-4eeb-94eb-a73cca49f4f0"},{"title":"Banker fired over sexual harassment sues Barclays for $700,000","link":"https://cyprus-mail.com/2023/03/23/banker-fired-over-sexual-harassment-sues-barclays-for-700000/","description":"A former Barclays BARC.L director, fired for sexual harassment and other misconduct, is suing the British bank for more than 584,600 pounds ($719,412), arguing that female colleagues fabricated allegations and that his dismissal was unfair. Robert Record, once a senior wealth manager overseeing assets worth 580 million pounds, was dismissed in September...","content":"A former Barclays director, fired for sexual harassment and other misconduct, is suing the British bank for more than 584,600 pounds ($719,412), arguing that female colleagues fabricated allegations and that his dismissal was unfair. Robert Record, once a senior wealth manager overseeing assets worth 580 million pounds, was dismissed in September 2020 for gross misconduct after a 14-year career, documents available at the East London Employment Tribunal show. But the 46-year-old, whose claims against the bank include sex discrimination and unfair dismissal, says the most serious allegations never happened including that he inappropriately touched a female colleague, the filings show. Cross-examined on Thursday by Barclays’ lawyer Ed Williams, Record said he and others had seen a group of women in meetings and he believed they had been “cooking up the charge sheet”. “It is my belief that these women encouraged (a female former co-worker) to raise a grievance against me as part of a collective objective to remove me,” he said. Witnesses who could have corroborated his concerns about women “colluding” against him were not interviewed during subsequent internal investigations, he alleges, adding that he was unable to properly defend himself and that his dismissal was unfair and disproportionate. Barclays rejects his allegations, saying the dismissal was reasonable because the disciplinary findings included “unwelcome physical contact with a female colleague, sexual harassment of another colleague and language and behaviour which reasonably could be taken to be a racial slur”, filings showed. The bank declined to comment further on Thursday. Allegations against Record ranged from excluding a female staffer from a scavenger hunt to behaving in an “intimidating way”, staring at a woman’s breasts and inappropriately touching a female colleague, filings showed. Record denies the allegations. His lawyer Richard Hignett has questioned whether Barclays staff, investigating the case, properly tested the credibility of complainants. But Williams, for Barclays, said female employees believed they were being subjected to and were upset by “poor behaviour” at the bank, according to notes of meetings at the time. “If female members staff wanted to get rid of senior men who were sexual harassers, it has nothing to do with the fact they are men or senior. It is the fact they are sexual harassers. Do you see that point?” he asked. Record’s case includes a claim for lost past and future earnings, deferred bonuses, pension benefit and injury to feelings.","pubDate":"2023-03-23 19:08:45","image_url":null,"id":"fdcd15fd-b4a6-4f7c-9897-691ea2cad085"},{"title":"Indonesia orders high schools to start at 05:30!","link":"https://www.thesouthafrican.com/news/world-news/indonesia-orders-high-schools-to-start-at-0530-23-march-2023/","description":"It is never easy to get teenagers out of bed. But in Indonesia it just got a whole lot harder - and earlier in the morning!","content":"It is never easy to get teenagers out of bed. But in Indonesia it is even harder since the governor of East Nusa Tenggara province ordered secondary school students to be in class by 05:30. ALSO READ | Four South African airports voted in Africa’s Top 10 Eureka Ata, 16, now has to get up at 04:00 every morning. “She is exhausted and falls asleep immediately when she gets home,” her mother told AFP. ALSO READ | Snakes gone wild! Remember this unwanted Woolworths shopper? The governor is adamant, however, his experiment will improve discipline despite the American Academy of Pediatrics recommending that teenagers actually start school later than others. But Marsel Robot, an education expert from Nusa Cendana University, said teenagers zombified by sleep deprivation were more likely to lose it. ALSO READ | When is the next public holiday in South Africa?","pubDate":"2023-03-23 18:52:06","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","id":"810e5c1f-6cad-49a7-871a-df0d425dd15f"},{"title":"India-China Border Issue Cannot Be Solved With Third-Party Involvement: Envoy","link":"https://www.khaama.com/india-china-border-issue-cannot-be-solved-with-third-party-involvement-envoy/","description":"The largest online news service for Afghanistan","content":"Indian and Chinese troops in the border area.\n\nParticipation of third parties in India-China relations may not help solve the border dispute between the two sides, said Ma Jia, China’sChina’s Chargé d’affairesd’affaires ad interim in New Delhi, on Wednesday.\n\nJia emphasized talking between the two countries to solve the current geopolitical issues, particularly border and territory issues. Jia said that ” neither China nor India desired war over the issue and that the two parties “have to talk” she said while briefing the media.\n\nEarlier in March, the Indian Foreign Affairs Minister S Jaishankar described India and China ties as “abnormal” due to the current state in the Line of Actual Control (LAC) and empathized that the two sides need to address “real problems.”\n\nIndia-China relations are at their lowest point in six decades following the brutal battle in Galwan Valley in June 2020, which claimed the lives of 20 Indian soldiers and at least four Chinese soldiers. Since then, both countries have clashed several times over the unidentified border area across the Himalayas.\n\nIndia claimed that China had violated the norms, which led to retaliation in the border areas.\n\nMeanwhile, China is concerned about India-US relations, particularly in the Quad or Quadrilateral Security Dialogue between India, the United States, Australia, and Japan.\n\nJia added that while China was not opposed to regional alliances that aided countries’ economic development, Beijing opposed the Quad because it was meant to “contain” China.\n\nMs Jia, in response to a question posed by the Hindu about intelligence cooperation between India and US, said, “The border issue between India and China is a bilateral issue. We think our two countries have the wisdom to resolve this issue, and we can properly handle that. We do not invite any other (country), especially from other regions, to interfere in this bilateral dispute.”\n\nHowever, several bilateral and trilateral meetings have been conducted between the two sides, but no solid results exist, and China is unwilling to address the current border issues.","pubDate":"2023-03-23 18:49:43","image_url":"https://www.khaama.com/wp-content/uploads/2023/03/India-China-troops.jpg","id":"ece380e1-bc7b-4440-b5cc-c706e33bad0b"},{"title":"Teen kicked out of 'UK's rudest restaurant' for being rude to staff","link":"https://www.walesonline.co.uk/news/real-life/teen-kicked-out-uks-rudest-26542844","description":"Jack Keith had travelled two hours to visit Karen's Diner with his grandparents","content":"A lad and his grandparents were booted out of 'the UK's rudest restaurant' - after he called the waitress a 'fat s**g' because she branded him a 'p****y' for mumbling. Jack Keith had travelled two hours to visit the Manchester branch of Karen's Diner with his grandparents but they were ordered to leave after just ten minutes. Viral footage shows the in-character waitress hear the 17-year-old calling her a 'whore' under his breath as part of what appears to be the restaurant's accepted customer-vs-staff banter. She tells him 'not to mumble it because you're a p***y' and when he says it more clearly she hits back to say 'you can't pronunciate [sic], that's embarrassing'. However the exchange quickly turned sour when she asks his age and he quips back 'how old are you, you fat s**g?'. The angry waiter immediately tells another member of staff then returns to the table to declare 'you're out, all of you, it's in the rules. He's ruined it'. Stunned Jack and his family were forced to pay the £25 drinks bill and leave because rules given to customers upon entry tells them banter doesn't extend to 'body shaming'. Despite admitting he's not proud of the comments, he's since hit back at the restaurant chain questioning why staff 'can give [abuse] but can't take it'. His mum Jane Keith, who was also at the meal, insists the 'house rules' need to be made clearer before the experience begins to avoid customers getting 'caught in the moment'. However, Karen's Diners firmly hit back at the family and said it is 'sad that a minority of customers need reminding as to how to behave' but they have 'no choice but to cater to the minority' by putting up house rules. The diner confirmed that if 'give it but not take it' referred to 'body shaming' then the family were correct - the chain would act upon such 'unacceptable behaviour'. The chain condemned the footage as a 'sour clip' and sarcastically said they accept the possibility that some people 'struggle to read the 'house rules' handed to them on arrival. Jack, from Ulverston, Cumbria, said: \"I agree that if you can't take it don't give it. I was shocked when she told us we had to leave. We thought they'd tell us to pay for the drinks then to sit back down. \"She brought it on herself really because I wasn't going to say anything after she said about my pronunciation. I'm not going to say something then not be able to take it and start crying about it. I'd take it on the chin, have just laughed about it and say something back. \"It was just in the moment and that came to my head so I thought I'd throw that at her. I understand that they think it's against the rules. It said 'no body shaming' but I couldn't think of anything [my insult] would have come under because she wasn't fat. She was your average female build so I don't know why she took it to heart. Jack Keith after being told he's been kicked out \"We didn't have time to read the rules. They just threw them at us and it was a really loud atmosphere. There was a lot going on. Some of the insults they gave to my grandparents were pretty next-level. Karen's Diner is a crazy idea and I probably wouldn't go back.\" The family left Karen's Diner without issue and chose to eat at a nearby cafe instead where they discussed the incident. Jane says a staff member threw the rules on the floor upon entry and made her pick them up before showing them to a table. She admits they didn't read the rules and is keen emphasise the importance of making sure customers do before the experience begins. Jane said: \"When you're there and you see the way they speak to you it leaves you quite shell-shocked. Jack Keith is told to leave \"She was quite in his face and Jack doesn't like that really. He doesn't go out looking for trouble and he's quite a quiet lad. Before you sit down they should show you the rules and make you read them in front of you. They don't make it clear enough.\" Jack's brother Josh Keith, who was also at the meal, posted the video on TikTok where it's been viewed more than half-a-million times. Jack commented on his 19-year-old brother's post and said: \"Please let me state that I'm not proud of this. It was just [said] in the moment and I'm not a bad person.\" Social media users are split on whether the teen is out of order with his abuse or if the waitress should accept it as par for the course. Karen's Diner offers its 'rude' experience in more than 15 locations across the world, with six being in the UK. Karen's Diner House Rules As listed on the company's website Karen's Diner is a unique, interactive dining experience. But in order to maintain a shred of sanity here, we have some rules Breaking these rules will result in the table being asked to pay the bill and leave the venue. You will also be banned from returning to the venue We want both staff and customers to feel as safe as possible in our venues No racist, sexist, homophobic or ableist comments or slurs will be tolerated No body shaming No sexual harassment Any damage or vandalism of the venue will lead to instant removal from the venue. (Charges may also apply) Keep your food and drink on your tables, don't throw them, its not fun A spokesman for Karen's Diner said: \"[In response] to the allegation that Karen’s staff can 'give it, but not take it'. If the 'Take it' referred to is simple 'body abuse', then the statement is quite correct. \"Karen's Diners will not condone seriously offensive abuse either 'given' (which can be grounds for dismissal as all our staff are obliged to work within strict behavioural guidelines) or 'take it' as we will always take every stance to protect our staff from unacceptable behaviour. \"It is sad that a minority of customers need reminding as to how to behave. We have no choice but to cater for this minority and accept that it is always possible that they struggle to understand how to click onto the front bar of our website ('rules'), and perhaps struggle to read the cards ('House rules') handed to them on arrival, which state specifically what we consider to be unacceptable behaviour. Subscribe here for the latest news where you live \"Sadly we are unable to personally explain to every customer that calling a waitress a 'fat sl*g' is very directly 'body shaming' and that is why we hand out the House Rule cards. I accept that there is a distinct possibility that some people perhaps need an explanation as to the meaning of 'body shaming!' \"Perhaps this is what they mean when they say 'It needs to be made clearer!?' We spend days teaching our staff how to be rude and funny. Offending anyone is never funny. \"When you trawl through the thousands of video clips showing customers enjoying Karen's dining experience, it will take you some time to find other clips with content similar to the sour clip presented. We have loved being rude to over 50,000 people in Manchester and we thank 99% of them for being such fun.\"","pubDate":"2023-03-23 18:10:01","image_url":"https://i2-prod.birminghammail.co.uk/incoming/article26545418.ece/ALTERNATES/s615/0_KNM_DINER_ABUSE_ROW-_13.jpg","id":"c881b951-d7b5-4ca2-a62e-1a82d79f9158"},{"title":"Trump to face anonymous jury in high-profile New York defamation trial","link":"https://cyprus-mail.com/2023/03/23/trump-to-face-anonymous-jury-in-high-profile-new-york-defamation-trial/","description":"A U.S. judge on Thursday said Donald Trump will get an anonymous jury in rape accuser E. Jean Carroll’s upcoming defamation trial, citing the threat of juror harassment, including by supporters of the former U.S. president. Saying “this is a unique case,” U.S. District Judge Lewis Kaplan in Manhattan said...","content":"A U.S. judge on Thursday said Donald Trump will get an anonymous jury in rape accuser E. Jean Carroll’s upcoming defamation trial, citing the threat of juror harassment, including by supporters of the former U.S. president. Saying “this is a unique case,” U.S. District Judge Lewis Kaplan in Manhattan said the names, addresses and places of employment of prospective jurors for the former Elle magazine columnist’s April 25 trial against Trump will be kept secret. He also said jurors will be transported together to and from the courthouse, and looked after by U.S. marshals during breaks in the trial. Kaplan said the need for juror anonymity reflected the “unprecedented circumstances in which this trial will take place, including the extensive pretrial publicity and a very strong risk that jurors will fear harassment, unwanted invasions of their privacy, and retaliation.” Trump’s lawyers did not immediately respond to requests for comment. Lawyers for Carroll, through a spokesman, declined to comment. Kaplan had asked Trump and Carroll earlier this month whether they objected to an anonymous jury. Neither did. Carroll has sued Trump twice for defamation over his denials of her claim that he raped her in late 1995 or early 1996 in a Bergdorf Goodman department store dressing room in Manhattan. The April 25 trial stemmed from an October 2022 post by Trump on his Truth Social media platform. Trump maintained that he did not know Carroll, that she made up the rape claim to promote her upcoming memoir, and that the claim was a “hoax,” “lie,” “con job” and “complete scam.” Carroll’s lawsuit also includes a battery claim under New York’s Adult Survivors Act, which lets sexual abuse survivors sue their alleged attackers even if statutes of limitations have run out. ‘HARASSMENT OR WORSE’ In his decision, Kaplan cited Trump’s March 18 call for protest if he were indicted in a Manhattan’s district attorney case for covering up a hush money payment to porn star Stormy Daniels before the 2016 election. Kaplan said Trump’s reaction “has been perceived by some as an incitement to violence,” and said some people charged over the Jan. 6, 2021, attack on the U.S. Capitol “rightly or wrongly” attributed their actions to incitement by Trump. The judge also said Trump has “repeatedly” attacked courts, judges, law enforcement and even individual jurors. These, the judge said, included the forepersons of the grand jury looking into whether Trump tried to sway the 2020 election results in Georgia, and the jury at longtime Trump adviser Roger Stone’s 2019 obstruction trial. “If jurors’ identities were disclosed, there would be a strong likelihood of unwanted media attention to the jurors, influence attempts, and/or of harassment or worse of jurors by supporters of Mr. Trump,” Kaplan wrote. Two media outlets objected to an anonymous jury, but Kaplan said juror safety outweighed their interest in learning jurors’ identities. Carroll filed her other defamation lawsuit in November 2019, five months after Trump first denied the rape occurred and said she made it up. Earlier this week, Kaplan indefinitely postponed the scheduled April 10 trial in that case. The case is Carroll v Trump, U.S. District Court, Southern District of New York, No 22-10016.","pubDate":"2023-03-23 17:38:03","image_url":null,"id":"28c28714-901e-445d-afd4-19119c29d7fc"},{"title":"Photos show squalor and filth inside rat infested restaurant","link":"https://www.walesonline.co.uk/news/wales-news/photos-show-squalor-filth-inside-26544299","description":"A judge described the food handling processes at the restaurant as 'nauseating', adding there had been evidence of rats","content":"This is the state food hygiene inspectors found a Cardiff restaurant in during an inspection in what has been described as \"the worst case of neglect at a restaurant in the past 15 years\". Sabz Ali Khan, aged 77, and Sabrina Khan, aged 41, appeared at Newport Crown Court for sentencing having been previously been found guilty following a trial of 18 food hygiene offences. A number of food hygiene safety inspections at Lilo Grill in Cardiff took place between August 2019 and January 2020. The legal food business operator of the business is Nightcover Limited, and Sabrina Khan is the sole director of the business, whilst her father Sabz Khan managed the day-to-day operations of the restaurant. Judge Richard Williams, passing sentence on the pair, explained how inspectors found evidence of the presence of rats in the restaurant, and described its food handling processes as \"nauseating\". He also added that food was being stored in conditions likely to render it \"unfit for human consumption\". Read more: Get the latest court cases sent to your email inbox with our Crime & Punishment newsletter A mincer found in the raw meat prep area (Image: Cardiff Council) A rat hole by to the sewers by the waste stored in the salad storeroom (Image: Cardiff Council) A blocked open drain in the wash area with rat footprints in the thick grease (Image: Cardiff Council) Cables for the fire alarm gnawed by rats (Image: Cardiff Council) He said: \"The picture presented of Lilo's Grillhouse in City Road, Cardiff, as it was when it was inspected in 2019, was one of behind the scenes squalor. There was clear evidence of ingress by rats and accumulated filth of equipment which was inadequate or in disrepair, food handling processes which were simply nauseating, the provision for recording matters were token at best, and the recordings which were kept had been falsified by one or more persons who made them. \"Equipment such as thermometers and temperature probes which were necessary to test food for safety purposes were missing, broken, or those present didn't know how to use it. Food was being stored in conditions likely to render it unfit for human consumption, there was no established regime for maintenance of equipment or replacement of worn out equipment or pest control. There was no apparent appetite for those responsible to manage the restaurant and do anything other than trade. \"The principle person responsible was Mr Sabz Khan. When the restaurant was inspected, there was a deal of obfuscation and he did the bare minimum to secure the re-opening of the restaurant and had a foot dragging approach in carrying out measures to improve the restaurant and adopted a combative approach. The failure on Sabrina Khan's part was failing to do what a company director was supposed to do. There is no evidence she was directly involved in the management of the restaurant. Her ability to mitigate what was found was hampered by her relationship with her co-accused.\" A collapsed wall behind the freezer in the washing up area which inspectors say was a result of damage caused by rats (Image: Cardiff Council) A damaged freezer at the restaurant (Image: Cardiff Council) Dried rat urine dripping down the walls of the dry store (Image: Cardiff Council) Extensive rat activity and damage under seating at the restaurant (Image: Cardiff Council) Nightcover Ltd was fined £12,000 and ordered to pay £6,500 in costs, Sabrina Khan was fined £1,500 and ordered to pay £1,000 in costs and Sabz Ali Khan was fined £5,000 and ordered to pay £2,500 in costs. Speaking after the court case, Cardiff Council cabinet member responsible for shared regulatory services, councillor Dan De’Ath said: “I have been reliably informed by the case officer that this is the worst case of neglect at a restaurant that we have come across in the past 15 years. Not only was the state of the property an absolute disgrace that put their customers at risk, but the manager was also very unhelpful and obstructive throughout the investigation. To top it all off, the argument he used in his defence that the rats in the restaurant were due to the proximity of students living in the area, is quite honestly laughable. “If you own or run a food business, you have responsibilities which are laid out in law. If you do not follow the correct practices and allow your business to go into a state of disrepair, you are putting your customers at risk of disease and infection.” READ NEXT: Man living illegally in UK sent to tend cannabis farm in Cardiff Man branded 'pervert' by judge for 'beyond creepy' behaviour towards women Inquest opens into death of 68-year-old man found dead following house explosion Man accused of murdering toddler Lola James told police she was 'a nutcase' and 'accident prone' Man looked after cannabis farm to pay off loan for late dad's medical treatment","pubDate":"2023-03-23 17:31:29","image_url":"https://i2-prod.walesonline.co.uk/incoming/article26545180.ece/ALTERNATES/s615/0_RD_SWA_230323CardiffRestaurant_07jpgn.jpg","id":"6c4bcf57-1a87-4651-9a78-db81e8bdc1ed"},{"title":"Dog owner gets suspended jail sentence after pet attacks jogger","link":"https://www.walesonline.co.uk/news/uk-news/dog-owner-gets-suspended-jail-26544609","description":"A Shar Pei type breed attacked and injured the runner","content":"A man has been given a suspended jail sentence after his dog attacked a jogger. A court heard the Shar Pei type injured the runner in January 2021. At a hearing this week, Brian Dickson advised the court the dog is no longer in his possession and the judge ruled the pet was to be subject to an order ensuring it is permanently muzzled while in public. Dickson was sentenced at Belfast Magistrates’ Court after a prosecution by Belfast City Council, the statutory powers responsible for dog-owning, BelfastLive reports. Dickson was convicted under Article 29 of The Dogs (Northern Ireland) Order 1983. The judge imposed a three-month prison sentence suspended for 12 months. He was also ordered to pay £250 compensation to the injured jogger, along with court costs of £138 and an offender levy. The Shar Pei is an ancient guard dog breed of Chinese origin, noted in appearance for its deep wrinkles. The American Kennel Club, which helped save the breed from extinction in the 1970s, describes the Shar Pei as: \"a fascinating but challenging breed of ancient pedigree - steadfastly loyal to family, but standoffish with strangers.\" It adds: \"They are suspicious of strangers and other dogs. Shar-Pei are serene dogs, but they will meet a perceived threat with tenacity and vigor. Early training and socialization are essential - a dominant adult Shar-Pei without them is a serious problem waiting to happen.\" Subscribe here for the latest news where you live","pubDate":"2023-03-23 17:18:48","image_url":"https://i2-prod.belfastlive.co.uk/news/belfast-news/article26534849.ece/ALTERNATES/s615/0_GettyImages-713835621.jpg","id":"d6509c12-b362-47cc-8568-b0796d00c8fd"},{"title":"Teachers accept pay offer from Welsh Government ending strike action","link":"https://www.walesonline.co.uk/news/education/teachers-latest-pay-offer-26543584","description":"No deal has been offered to teaching assistants though with the National Education Union warning its national executive will be “considering next steps in our support staff pay campaign”.","content":"Teachers in Wales have called off any further strike action after accepting the latest pay offer from the Welsh Government. The dispute, rumbling since the autumn, saw teachers strike on two days across Wales closing hundreds of schools. The National Education Union said 73% of its teacher members in Wales who responded to it latest consultation voted to accept the pay offer put forward by Education Minister Jeremy Miles to end the dispute. He made the offer after the second strike on March 2 with members agreeing to suspend further action planned while they considered it. The offer will see an additional payment to teachers of 3% for this academic year (2022/23), made up of 1.5% consolidated award and a further 1.5% one-off unconsolidated lump-sum. The offer also included an increased pay rise of 5% paid from September 2023. The minister pledged that it will all be fully funded by the Welsh Government and not have to come from school budgets. Read more: Hundreds of teachers and school staff told to re-apply for their jobs in Pontypridd schools shake up Striking teachers on the picket line at Cardiff High on February 1 (Image: WalesOnline/Rob Browne) No offer has been made to teaching assistants however. The NEU warned that its national executive will be “considering next steps in our support staff pay campaign”. Speaking about the members’ decision to accept the offer NEU Joint General Secretary Kevin Courtney said: “Members in Wales have made a clear decision to accept the pay offer, put forward by the Minister in a letter dated 9 March. “We would like to thank the Welsh Government for the constructive way in which they have conducted negotiations with the union, and we look forward to a productive working relationship to ensure that the rest of the deal, focused on workload, continues to make good progress. “Whilst this doesn’t meet our ambitions for pay restitution every part of this offer is due to our members’ efforts - and we will continue campaigning for the governments in Cardiff and Westminster to invest properly in this generation of children and the staff who work with them.” David Evans, Wales Secretary for the National Education Union Cymru, said: “It is clear that a large majority of our teacher members here in Wales want to accept the deal from the minister. They were provided with full information about the offer and have given us a definitive steer. “This has been a difficult time for everyone in education. Our members do not take decisions to go on strike lightly, but they had to make a stand given the continuing impact of austerity, cost of living and spiralling inflation. We would like to thank all the parents who supported teachers and support staff in the action taken.” He added: “We remain disappointed that the minister made no offer to teaching assistants, but we know that we have raised the profile of the critical issues which affect everyone in education. Our national executive will be considering next steps in our support staff pay campaign.” NEU members turned down an initial 5% offer recommended by the Independent Pay Review Body for Wales and accepted by the Welsh Government “an insult”. They also turned down a second offer of an additional 1.5% lump sum and extra 1.5% pay rise as “not good enough”. They have accepted a third offer adding an increased pay rise of 5% paid from September 2023 with the promise that will be fully funded by the Welsh Government. But headteachers have voiced concerns that with school budgets being cut money is being given in one hand but taken in another. There are ongoing concerns about years of underfunding for schools leading to larger class sizes and use of unqualified staff. Teachers voice their anger at pay erosion during this terms strikes (Image: WalesOnline) The NEU estimates teachers’ pay had been eroded by as much as 20% in the last decade. Headteachers in the NAHT Cymru have been working to rule in protest over pay and working conditions. The full holding offer from Welsh Government: 5% already awarded (fully-funded) An extra 1.5% fully consolidated 1.5% one-off cash payment This makes a total consolidated increase of 6.5% and an in-year boost for the current year of 8% The money would be paid in April and backdated to September provided NEU Cymru pauses next week’s industrial action For the next academic year 2023-24 a new 5% offer compared to the original 3.5% offer Education Minister Jeremy Miles said: “I am pleased that NEU members have voted to accept the enhanced pay offer. This is good news for pupils, parents and teachers. “I want to thank unions and local authorities for engaging in a positive way in the negotiations. The result today will give learners and parents piece of mind and together we can focus on teaching and learning. I am also looking forward to working with our partners on the workload-related issues which we have identified together.” To get our free daily briefing on the biggest issues affection the nation, Wales Matters, click here . Read next: Teachers and school staff told to re-apply for their jobs in Pontypridd schools shake up 'Terrifying, frightening and extremely stressful': Headteachers in Wales on how it feels having their schools inspected Headteachers fear schools will have to pick up bill for pay rise offered in Wales Wales faces massive shortage of specialist physics and chemistry teachers The figure that shows why teachers went on strike in Wales","pubDate":"2023-03-23 17:10:40","image_url":"https://i2-prod.walesonline.co.uk/incoming/article26545544.ece/ALTERNATES/s615/1_Teachers-at-a-strike-rally-outside-the-Senedd-on-March-2.jpg","id":"72b4aa2f-bb39-47b5-b398-dc51d88d733c"},{"title":"EU Leaders Expected to Approve Ukraine Ammunition Plan","link":"https://www.voazimbabwe.com/a/7018519.html","description":"European Union leaders are expected to give their approval Thursday for a plan to speed ammunition deliveries to Ukrainian forces fighting a Russian invasion. The $2 billion plan was endorsed earlier this week by EU foreign and defense ministers. It calls for both sending ammunition from existing stocks and for EU countries to work together to place new orders for more rounds. Ukrainian leaders have told Western allies that Ukraine’s military has an urgent need for more ammunition, especially 155-millimeter shells. U.N. Secretary-General Antonio Guterres is due to join the EU leaders for a lunch meeting Thursday, with Ukrainian President Volodymyr Zelenskyy scheduled to give a later video address. Thursday’s session comes a day after Ukrainian authorities said new Russian drone and missile attacks killed at least seven people in two cities. SEE ALSO: Latest Developments in Ukraine: March 23 EU foreign policy chief Joseph Borrell used a Thursday tweet to highlight Russian President Vladimir Putin’s expression of support for a Chinese-drafted peace plan in Ukraine, placing Putin’s hosting of Chinese President Xi Jinping this week alongside the Russian attacks. “Ukraine has been attacked again by Russia with Iranian drones, targeting educational facilities & a missile attack on a residential building in Zaporizhzhia,” Borrell said. “Just when Putin expressed need for ‘peaceful settlement’ to President Xi, Russian again commits war crimes.” Putin on Tuesday praised Xi’s peace plan to end the Ukraine war, although it does not call for withdrawal of Russian troops as Zelenskyy has demanded before peace talks can start. SEE ALSO: Blinken: China’s Peace Plan Will Not End Russia’s Aggression in Ukraine The United States, Ukraine’s chief arms supplier, has rejected China’s peace plan because it would leave Russian territorial gains in eastern Ukraine in place. \"A cease-fire right now, freezing the lines where they are, basically gives [Putin] the time and space he needs to try to re-equip, to re-man, to make up for that resource expenditure,\" White House national security spokesman John Kirby said. SEE ALSO: Q&A: White House ‘Concerned’ About Xi-Putin Meeting, ‘Supports’ Xi-Zelenskyy Meeting Some material in this report came from The Associated Press, Agence France-Presse and Reuters.","content":"European Union leaders are expected to give their approval Thursday for a plan to speed ammunition deliveries to Ukrainian forces fighting a Russian invasion. The $2 billion plan was endorsed earlier this week by EU foreign and defense ministers. It calls for both sending ammunition from existing stocks and for EU countries to work together to place new orders for more rounds. Ukrainian leaders have told Western allies that Ukraine’s military has an urgent need for more ammunition, especially 155-millimeter shells. U.N. Secretary-General Antonio Guterres is due to join the EU leaders for a lunch meeting Thursday, with Ukrainian President Volodymyr Zelenskyy scheduled to give a later video address. Thursday’s session comes a day after Ukrainian authorities said new Russian drone and missile attacks killed at least seven people in two cities. EU foreign policy chief Joseph Borrell used a Thursday tweet to highlight Russian President Vladimir Putin’s expression of support for a Chinese-drafted peace plan in Ukraine, placing Putin’s hosting of Chinese President Xi Jinping this week alongside the Russian attacks. “Ukraine has been attacked again by Russia with Iranian drones, targeting educational facilities & a missile attack on a residential building in Zaporizhzhia,” Borrell said. “Just when Putin expressed need for ‘peaceful settlement’ to President Xi, Russian again commits war crimes.” Putin on Tuesday praised Xi’s peace plan to end the Ukraine war, although it does not call for withdrawal of Russian troops as Zelenskyy has demanded before peace talks can start. The United States, Ukraine’s chief arms supplier, has rejected China’s peace plan because it would leave Russian territorial gains in eastern Ukraine in place. \"A cease-fire right now, freezing the lines where they are, basically gives [Putin] the time and space he needs to try to re-equip, to re-man, to make up for that resource expenditure,\" White House national security spokesman John Kirby said.","pubDate":"2023-03-23 17:03:55","image_url":"https://gdb.voanews.com/21c10e1e-e855-4db4-9b50-75f79c33b213_cx0_cy5_cw0_w800_h450.jpg","id":"29d15e43-a758-4c96-8f14-eabdcb80f21d"},{"title":"Tears, a tissue, and iPhone photos – an Afghan softens a Turkish heart","link":"https://www.csmonitor.com/World/Middle-East/2023/0323/Tears-a-tissue-and-iPhone-photos-an-Afghan-softens-a-Turkish-heart?icid=rss","description":"The Turkey earthquake disaster has magnified anti-immigrant sentiments. A respectful conversation in a taxi between an Afghan and a Turk defused it.","content":"He fumbles, hands me a tissue, and says: “Turkey’s your home as much as it is mine.”\n\nHe offers condolences – and glimpsing sympathy, I burst into tears over the quake, discrimination, and years of loss in my homeland.\n\nMy cabbie asks which Afghans died under the rubble. I let him scroll my smartphone photos of the refugee Qaderi family whose extended family once housed me in my native Afghanistan when I needed a home. Half of them were killed in the collapse of their Anatolian apartment building in the quake just days before their appointment for resettlement in New York.\n\n“We’re not the thieves,” I say in broken Turkish, picked up in my seven years working as a foreign reporter and raising my two daughters in culturally diverse and cosmopolitan Istanbul. “We also died with you.”\n\nAnti-immigrant sentiment in Turkey, amplified by February's earthquake, has left the country on edge. But in a tearful conversation, our Afghan correspondent glimpsed new respect from her Turkish cabdriver.\n\nSomehow, I expected the earthquake to have a unifying effect. But, mourning and on edge, Turks want a scapegoat.\n\nStuck in Istanbul’s epic traffic, my taxi driver launches into a rant blaming refugees for Turkey’s every problem – inflation, unaffordable rents, unemployment, and now the Feb. 6 earthquake that has killed more than 54,000 people in Turkey and Syria. He believes viral videos suggesting refugees are looting bodies under the rubble.\n\nStuck in Istanbul’s epic traffic on a bridge crossing from Asia to Europe on the fabled Bosporus Strait, my cab driver launches into a charged monologue about refugees destroying Turkey.\n\nHe says Afghan refugees are stealing from bodies under the rubble of the Feb. 6 earthquake in southern Turkey, referring to a viral video accusing Afghans of stealing gold and cutting the arms off the dead. But the Turkish influencer, Ugur Kardas, who made the video was later arrested for spreading disinformation.\n\n“We are not the thieves. We also died with you,” I say in my broken Turkish.\n\nWhy We Wrote This Respect Anti-immigrant sentiment in Turkey, amplified by February's earthquake, has left the country on edge. But in a tearful conversation, our Afghan correspondent glimpsed new respect from her Turkish cabdriver.\n\nNo matter what I say or what the truth is, the cabbie believes that refugees are the reason for Turkey’s every problem – inflation, unaffordable rents, unemployment, and now the biggest natural disaster of the century that killed more than 54,000 people in Turkey and Syria.\n\nIstanbul’s been my home for seven years. But the anti-foreign sentiment has become so ominous that I have to prove my loyalty in public. The perennial question is: Where are you from? Upcoming elections don’t give refugees any reprieve; nearly every party is against them, and kicking out migrants seems politically popular.\n\nCourtesy of the Qaderi family Bahar Qaderi (right) with her father, Mohammed Amin Qaderi. Both died in the Feb. 6 earthquake in Adiyaman, Turkey, one month shy of Bahar's 11th birthday.\n\nI was born in Afghanistan, and raised partly in the U.S. I moved here to work as a foreign reporter and to raise my two daughters. Istanbul is a culturally diverse, cat-loving, family-friendly, geographically accessible cosmopolitan hub. People were generally welcoming toward Afghans until a wave of migration beginning in 2015 turned Turkey against us. Tens of thousands have moved on to Europe but about 200,000 Afghans legally remain in Turkey – some 144,000 of them are refugees waiting for asylum elsewhere. Afghans are second only to Syrians as the largest refugee population in Turkey. The worst-hit targets of discrimination are Syrians, then us.\n\nThe consequences of prejudice are much worse for Afghans who don’t have Western passports like I do. I confront verbal hostility, but refugees are often illegally detained and deported.\n\nSomehow, I thought the earthquake might have a unifying effect in Turkey. But in this city, mourning and on edge, anticipating the next big earthquake, Turks want a scapegoat.\n\nAnd yet, in the traffic standstill on the bridge, my driver stops his rant, scratches his neatly trimmed mustache, and quietly asks me which Afghans died under the rubble.\n\nHundreds of Afghans were among the casualties in the 10 provinces hard hit by the quake, I tell him. I take out my phone to show him videos and photos so he can get another view of Afghans besides the one he saw presenting them as looters.\n\nI tell him about Mohammed Amin Qaderi whose extended family had housed me when I needed a home in Afghanistan and in New York, where some of them had settled. Mr. Qadari and his family had fled the war in northern Afghanistan in 2017 and made it to Turkey. They, like most refugees, were sent away from urban areas to the hinterlands of Anatolia to live – with no legal right to work – while their asylum cases were processed.\n\nCourtesy of the Qaderi family Lale (left) and Suheyl Qaderi (center) celebrate their sister Fariheh's (right) 7th birthday at their home in Adiyaman, Turkey, a year ago. That home collapsed in the earthquake and Fariheh died under the rubble with her father and another sister, Bahar, 10.\n\nThere, in the town of Adiyman, the Qadaris’ apartment building collapsed in the February earthquake – just eight days before their appointment for resettlement in New York with Mr. Qaderi’s brother, Sharif Qaderi, who is a U.S. citizen.\n\nMohammed and his two daughters, Bahar, 10, and Fariheh, 7, died. His wife, Meryem Amini, and two of their children were pulled alive from the rubble, but none of them can walk – Ms. Amini’s legs were amputated, her 3-year-old son Suheyl lost a leg, and surgeons are monitoring her 10-year-old daughter Lale to decide whether she also needs an amputation. The survivors are each in different hospitals in Ankara unaware that half of their family is gone.\n\nThe cabbie, Burak, turns off the radio to hear me better.\n\nI see a glimpse of sympathy.\n\n“Who’s with the survivors now?” he asks.\n\n“Sharif, from America, and other family members are taking turns visiting the three survivors,” I reply.\n\nBurak scrolls the photos of the Qaderi children on my phone. He offers his condolences, and I feel I have accomplished something – somehow he may stop blaming Afghans, if just for a moment.\n\nThen suddenly, I burst into tears, sobbing.\n\nBurak fumbles, hands me a tissue, and apologizes.\n\nCourtesy of the Qaderi family Afghan refugee Meryem Amini plays in the snow with her son, Suheyl (center), and daughter Fariheh in Adiyaman, Turkey, in December 2022. The building they lived in collapsed in the Feb. 6 earthquake just days before their final interviews for resettlement in the United States. Fariheh died, and Ms. Amini and Suheyl were severely injured.\n\nBut my tears aren’t just about Burak’s discrimination – nor the blow dealt by the earthquake. My grief, part of the story of my homeland, is layered in years of loss: an uncle lost to torture in the Soviet invasion, a 9-year-old classmate to a rocket, countless Afghan friends and colleagues to suicide bombings in the decades of war in Afghanistan. Now the Qaderi family is suffering, and Meryem Amini is barely hanging onto life.\n\nIn the chaotic aftermath of the U.S. pullout from Afghanistan in August 2021, I managed to help evacuate two families with teen girls to California on a P2 visa granted for helping me report during the seven years – 2000 to 2007 – that I wrote from Afghanistan.\n\nThen I stopped talking or writing about Afghans. It physically hurt to think about the lives we left behind. The Taliban had won, and the American envoys anxious to end an unpopular war said the hardliners had reformed. Those of us who knew Afghanistan shook our heads, but few others cared.\n\nThe overwhelming sentiment about Afghans globally is fatigue and helplessness. The attitude I most often encounter is that Afghans lost a battle for freedom and were betrayed by the U.S. and its allies, but that Afghans had 20 years to save themselves from the depths of poverty and religious extremism. They failed themselves and the world. No one owes Afghans anything.\n\nThese narratives are apparent in mainstream and social media – and these sentiments filter into how refugees are considered for asylum and treated in their host countries like Turkey.\n\nI stop crying as I reach my destination. I tell Burak that most Afghans in Turkey want to leave, just as Turkey wants. But they are in purgatory, waiting for a Western country to accept them. They work jobs in construction and farming for low wages that Turks wouldn’t accept. Many are abused on the job.\n\nBurak says he’s sorry if his comments upset me; that he’s just angry that he can’t afford to eat meat and is accumulating debt to pay his rent in Istanbul.\n\nGet stories that\n\nempower and uplift daily. By signing up, you agree to our Privacy Policy Already a subscriber? Log in to hide ads.\n\n“Turkey’s your home as much as it is mine,” Burak says.\n\nFariba Nawa is an Istanbul-based journalist, host of “On Spec Podcast,” and author of “Opium Nation: Child Brides, Drug Lords and One Woman’s Journey through Afghanistan.”","pubDate":"2023-03-23 16:07:59","image_url":"https://images.csmonitor.com/csm/2023/03/1153181_5_0321%20INSTANBULLETTER%20rubble_standard.jpg?alias=standard_900x600","id":"b0b1ca5d-070f-4668-9777-b98c3d3fe159"},{"content":"Viral outbreaks are on the rise. Ben Spencer meets the scientists racing to stop them becoming a global threat. As the airlock swings shut, the safety co-ordinator issues a final reminder. “Please do not touch anything,” he says. Machines hum as we step into the containment lab. “This is where we work on some of the most dangerous viruses,” says Professor Tom Solomon, director of the Liverpool-based Pandemic Institute. “A lot of the initial Covid work was done here.” Inside biological safety cabinets sit trays of purple cells infected with Japanese encephalitis virus — a mosquito-borne pathogen that can cause inflammation of the brain, paralysis and death. Solomon assures me the viruses being assessed today have been inactivated, meaning they can no longer infect humans, but the protocols here are still strict. Powerful fans suck any airborne microbes up into a filter, rather than being allowed to waft around the room. The most dangerous material is handled inside airtight cabinets using inbuilt rubber gauntlets. All other equipment can be used only with corresponding gloves, which are binned before anything else is touched. “We need to be very careful,” repeats Felipe Cia Viciano, the safety man. I step away from the equipment. Inactivated or not the samples look pretty alarming. I don’t want inadvertently to cause a lab leak. This Thursday marked three years since Boris Johnson ordered the UK into its first lockdown. Since then we have endured the biggest social and economic disruption since World War II. Some 219,000 people in the UK and nearly seven million globally have lost their lives to the virus. Solomon’s task is to ensure that never happens again. “If we wait for things to become pandemics then we’ve already failed in our mission,” he says. The Pandemic Institute was founded in 2021 to monitor emerging diseases and prepare for future outbreaks. “Never again will we be unprepared” is its motto. It is not alone. Around the world, research institutes and universities are working on two key questions: where will the next pandemic come from? And how can we stop it? Their investigations concern illnesses such as Ebola, Zika, Lassa fever and Nipah virus. These viruses and others like them form the bulk of the World Health Organisation’s list of “priority pathogens” — diseases that pose the greatest public health risk due to their “epidemic potential”. But most terrifying of all is the one at the very bottom of the list: Disease X. This is the pathogen we don’t yet know about — a virus, bacterium or fungus that is yet to appear. It could be a mutated form of a disease we have lived with for years. Or a combination of animal viruses that evolve to jump into humans. Covid-19 was this era’s Disease X, emerging in Wuhan at the end of 2019 to change our world. What will be the next? Advertisement Advertise with NZME. A dangerous blind spot It is a subject few of us want to think about. And who can blame us? Covid is still with us, quietly taking 500 or so lives a week, but the dark days of March 2020 seem like a distant memory. We are able to forget thanks to the miracle of Covid vaccines. While the virus still kills some people, and long Covid blights many lives, our boosted immunity means that for most of us, infection will result in a relatively short illness. The risk of forgetting history, however, is that we are destined to repeat it. Dame Kate Bingham, who chaired the vaccine taskforce at the height of the emergency, told a hearing of the Commons science and health committees in November that the UK’s pandemic preparedness had declined since the emergency ended. “Our approach seems to have been to go backwards rather than to continue the momentum,” she said. Related articles World Lab leak or not? How politics shaped the battle over Covid’s origin 19 Mar 11:51 PM World Here’s why the science is clear that masks work 15 Mar 05:00 AM World Opinion: We need to get ready for ‘Disease X’ 13 Mar 05:00 AM World Wuhan Covid lab leak theory: Why demonising China threatens the world 01 Mar 08:20 PM Lord Bethell, who was a Conservative health minister in 2020 and 2021, agrees. “It’s in the psychology of all of us that we turn away from the bad things that have happened in our life. And that’s what’s happening,” he says. He is furious that testing infrastructure created from scratch during the pandemic has fallen out of use. Spanish flu claimed 50 million lives in 1918-19. Photo / Getty Images “For me, it’s totally heartbreaking. What you should do after a big pandemic is find other uses for that infrastructure. You turn the machines and the infrastructure to doing other public health screening. And then when the next pandemic turns up you have a platform to scale up from. But it has all been closed, the mega labs have been shut or sold. I think we will live to regret that.” Sooner or later the next Disease X will appear. The course of human history has been punctuated by the emergence of such pathogens. The Black Death killed up to 200 million people in the 14th century. Russian flu, which scientists now believe was likely to have been caused by a coronavirus, swept across the world in the 1890s. Spanish flu took 50 million lives in the aftermath of World War I. And in the past four decades, HIV has killed 40 million people. Modern science means we are now better equipped to battle these diseases, but they come along far more frequently thanks to growing human populations, intensive industrial farming and the illegal wildlife trade. Many experts believe the way we treat animals makes the “spillover” of pathogens to humans more likely. Deforestation and habitat loss has brought us in ever closer proximity to wildlife; huge wet markets in which live animals and fish are bought and sold provides an easy transmission route; vast farms — such as a 26-storey pig-breeding operation that opened last year in the Chinese province of Hubei — create mixing bowls for diseases. Since the 1980s outbreaks of new diseases have tripled in number. And when they emerge they spread rapidly, flown around the globe by an increasingly mobile population. What once might have remained a localised outbreak can become a pandemic in a matter of weeks. “It took a year for people to get around the planet 150 years ago,” Solomon says. “And the global population was 1.3 billion. Now it takes 24 hours to get around the world and there are eight billion of us, and we live in close proximity in megacities. We didn’t have intensive farming in the past.” Advertisement Advertise with NZME. The leap from animals Several times since the turn of the century we have been caught unawares by viruses that have either leapt from animals to humans for the first time or spread at an unprecedented pace: Sars-1, found in bats and palm civets as well as humans, appeared in China in 2002; H1N1 swine flu arrived in 2009; Mers jumped from camels to people in 2012, killing 36 per cent of those it infected; Ebola, which is thought to have originated in bats or primates, killed 11,300 people in 2014 and 2015; mosquito-borne Zika was reported in 86 countries in 2015 and 2016; and then there was Covid-19. We will probably never know for sure whether the coronavirus jumped from bats or leaked in some disastrous accident from the Wuhan Institute of Virology. Scientists are divided on the matter, and while the FBI last month disclosed that it now believes a lab leak is the most likely explanation, other US agencies still think a zoonotic spillover was the probable cause. Workers bury an ebola victim in Liberia, 2014. Photo / Getty Images We have to be on our guard for both possibilities in the future. As each of the epidemics that preceded Covid came and went, either seen off by science, the virus’s own weaknesses or by the laws of herd immunity, we became complacent. We have now, to all intents and purposes, seen off Covid too. But other threats remain — and they are growing. Solomon points to Japanese encephalitis. First identified in humans in 1871, it is transmitted in a cycle between mosquitoes, pigs, waterbirds and people. The samples being analysed in the lab today were collected by Solomon in Vietnam in the 1990s. But now this virus is spreading through Australia for the first time, with 45 cases and seven deaths recorded so far. While vaccinations for Japanese encephalitis exist, inoculation is not routine in Australia. And once someone is infected there is no treatment. Most people experience no symptoms or something like mild flu, but if the infection spreads to the brain it kills one in three patients, and half of those who survive suffer permanent brain damage. Solomon’s team is comparing the sequence of the Vietnamese samples with those taken in Australia to look for genetic changes. “You don’t need a crystal ball to realise that mosquito-borne pathogens are spreading,” he says. “Climate change means [mosquito habitat] range is expanding. In southern Europe we have mosquito-borne infections that we haven’t had previously.” Flavivirus (family Flaviviridae), these viruses are responsible for yellow fever, dengue fever, Japanese encephalitis, Zika virus, West Nile encephalitis. They are transmitted by mosquitoes or ticks. Photo / Getty Images West Nile virus, which originated in Uganda, is another example. Like Japanese encephalitis it is spread when a mosquito bites an infected bird and then a person, which can cause a flu-like illness, muscle weakness and, in some cases, seizures. Until 1996 Europe had seen no significant outbreaks; last year there were 965 cases, most of them in Italy, with 73 deaths. The UK has not yet had any infections. But mosquito species that have the potential to carry West Nile virus or Japanese encephalitis have been found in the Kent marshes and even in the warm conditions of the London Underground. Solomon reels off a list of other neglected threats: Nipah virus, which kills up to 75 per cent of those it infects; Marburg virus, a cousin of Ebola that has a fatality rate of 90 per cent; and superbugs, which he says will have a “massive” death toll if they evolve to evade the antibiotics at our disposal. The bird flu threat What is really keeping virologists up at night is H5N1 avian influenza — bird flu. “If there was an outbreak in humans tomorrow, we wouldn’t be able to vaccinate the world in 2023,” Jeremy Farrar, the outgoing director of the Wellcome Trust, said last month. “My concern is that we’re in slow motion watching something that may never happen, but if it were to happen we would look back and ask why we didn’t do more.” The mortality rate of H5N1 is terrifying. Since it was first identified in Hong Kong in 1996 about 900 people have contracted it and 56 per cent have died. When Covid first emerged, by comparison, it killed 1.4 per cent of those it infected. Despite its high mortality rate, the threat of H5N1 to humanity is limited by the fact there is no evidence it has ever been transmitted from one human to another. In the parlance we all learned so quickly during the Covid pandemic, the R-rate of bird flu is 0. People are occasionally infected — usually because they keep ducks or work with poultry. But then they either recover or die. The virus — so far at least — has never been passed on. In the past two decades waterbirds — particularly ducks, geese and wading birds — have been the main source of avian flu, bringing the virus with them as they flew into Britain each autumn from Europe and the Arctic. Occasionally it has spread to poultry, which had to be culled. South Korea culls ducks to halt the spread of bird flu, 2003. Photo / Getty Images Last summer conservationists spotted something new. For the first time, the virus got into our seabird colonies. Gannets, guillemots, kittiwakes and puffins were found dead along the British coast. Ornithologists fear entire species could be wiped out in what is shaping up to be a conservation disaster. It is also a catastrophe for the poultry industry: the US alone has culled 50 million poultry and the UK at least four million. Countless millions of wild birds have died worldwide. The jump of the virus to new avian species means it has found a new range, spreading deep into South America for the first time, with thousands of pelicans killed along the Peruvian coast. More worryingly, the virus has now been found in mammals such as sea lions in Peru, foxes and otters in Britain, and bears in North America. While most of these cases are thought to have been down to hunting or scavenging, mammal-to-mammal transmission has been confirmed on a mink farm in Spain. “The outbreak in mink is a real warning sign,” says Professor Paul Digard, a virologist at the Roslin Institute at Edinburgh University. “I can’t think of a case before where we’ve seen this lineage of H5 transmitted between mammalian species outside of a laboratory setting.” Experts stress that mink farms are a perfect breeding ground for infections, with thousands of the animals crammed together in captivity. To spread among mammals in other environments is a different prospect. That was demonstrated in 2011 during experiments led by Ron Fouchier at the Erasmus University Rotterdam. The team genetically modified an H5N1 virus to see what changes were required to force it to transmit among ferrets. This “gain-of-function” study was controversial — critics argued that making a dangerous pathogen transmissible among humans was highly irresponsible. But the team made a significant discovery. “They found entire constellations of mutations that were needed to get it to transmit between ferrets,” Digard says. “The odds of those changes happening by chance — when there’s no real benefit for the virus that’s living quite happily in birds — are small. There’s no real pressure to drive it through a multistep process.” But he adds: “Time and again with flu and other viruses, we work out ‘rules’ for how the virus behaves, and then we find a new variant that breaks those rules. H5N1 is absolutely the type of virus we need to worry about.” Dr David Bauer, a virologist at the Francis Crick Institute in London, says there is another way bird flu can create problems for humans: a piece of virological trickery called reassortment. That is when two strains of influenza virus such as human flu and bird flu infect the same host and swap genetic information. “It acquires a new set of surface antigens. It changes its coat so it cannot be recognised and your immune system just has no idea what this thing is,” Bauer says. “It happened in 1957 and 1968 — the virus reached down into the avian reservoir and pulled out new segments. Those were particularly deadly years — there was complete escape of immunity.” The swine flu pandemic of 2009 was caused by a “triple reassortment”. H1N1 in Mexico took genetic segments from both birds and pigs, spreading worldwide and killing up to half a million people. Solomon agrees that pandemic influenza in general, and H5N1 in particular, is a significant risk. But he adds that in the past fears about flu have blinded politicians to other threats. “If all you’ve got in the dusty drawer is the flu pandemic preparedness plan, when a pandemic happens that’s what you pull out. Covid has taught us that we can’t just look at one pathogen. We need to look at a variety of threats.” So where to start? With so many dangers to our health, how can scientists possibly identify a future Disease X and stop it before it spreads? Meet the virus hunters Gregory Gray, professor of infectious disease epidemiology at the University of Texas Medical Branch in Galveston, found one such threat in a fishing village at the mouth of the Rajang River in Sarawak, Malaysia. In 2017 a 5-month-old baby boy had become feverish and was struggling to breathe. He was taken to the nearest hospital, three hours away in the city of Sibu. There he was admitted to intensive care, where his lungs filled with mucus. He had pneumonia but doctors were puzzled as to what was causing it. The boy was discharged within a week, though he took several months to recover fully. A sample was sent to Gray’s lab in the US, along with 300 others from Sarawak. Gray discovered the baby had been infected with a coronavirus found in dogs. Genetic sequencing suggested it had also exchanged parts of its genome with pigs and cats. Signs of this new dog-cat-pig coronavirus were identified in seven other patients in Sarawak. Strikingly, a similar virus has been identified in distant Haiti. Gray believes that, while concerning, the virus is not an immediate threat. “What is often portrayed in movies is that these pathogens just jump over to humans and suddenly cause a pandemic,” he says. Instead, he believes animal viruses “spill over” into humans more often than we think. These viruses test the body, challenge its immune system and usually die off. Over time, however, they can evolve to colonise our cells, to replicate and to transmit between humans. “Seventy per cent of new emerging threats detected in humans come from animals,” Gray says. He wants far more comprehensive surveillance of people sick with respiratory conditions and fevers, which he believes will detect more pathogens than are currently picked up. It is a radical approach but if new diseases can be identified in this early phase — before they become transmissible — they can be stopped in their tracks. He also wants to track farm workers, who are often the first to become infected. “If you work in close proximity with animals you are challenged,” he explains. “It is not a rare event.” His team has run trials among pig farmers in China, taking regular swabs and blood tests. They also took samples from the animals and tested the air and water. “It validated the idea that these farms are real mixing bowls for these viruses,” he says. How to prevent a pandemic Early surveillance is crucial if pandemics are to be averted. The Coalition for Epidemic Preparedness Innovations (Cepi), an Oslo-based international alliance of organisations, aims to stop emerging diseases 100 days after detection. Richard Hatchett, Cepi’s chief executive, says with better surveillance — and greater transparency — the world could have been alerted to Covid far earlier. “Imagine if China had realised that they were dealing with a novel coronavirus in mid-December and started responding, rather than mid-January when they revealed it to the world,” he says. “Imagine if they had implemented efforts to control local transmission straight away.” That would have limited spread — potentially keeping the virus within Wuhan. “Then imagine if we could compress vaccine development timelines from the 11 months that we actually achieved from a cold start in 2020 down to 100 days. We would have been delivering vaccines in March.” Instead of baking bread and learning how to use Zoom this time three years ago, we would have been queueing for jabs. Hatchett points out that in April 2020 just 2.2 million cases of Covid had been recorded globally. “In December, when the vaccines were available, there were 70 million cases.” He extends his point further. If, by winding back the clock, Covid had been contained in Wuhan, and vaccines had been rapidly developed, then “you are talking about having vaccines available when there are 30,000 cases. Then you actually are working towards the possibility of preventing pandemics altogether.” A baby with microcephaly, a birth defect that affects head size and brain development, born to a mother with zika virus. Photo / Getty Images It is a tantalising thought. After all, lockdowns are a failure of public health policy, a last resort. But what would it take? Cepi has drawn up a US$3.5 billion ($5.6b) plan to kick-start the process, though it acknowledges more funding will be needed. At its heart is the creation of a library of vaccines against a large proportion of the 250 viruses that we know can infect humans. Not every virus will need its own vaccine: the recent mpox (previously known as monkeypox) outbreak, which was tackled effectively outside of central and west Africa with established smallpox vaccines, has shown that existing jabs can be put to good use. But a seed bank of prototype vaccines against each of the 25 main viral families will be a start. And it is doable. The “plug and play” vaccine technology that came to the fore to see off Covid has shown what can be achieved. The mRNA vaccines, as showcased by Pfizer-BioNTech and Moderna, and the adenovirus vector vaccines, developed by Oxford, are all programmable. Once the sequence of a virus is known, the jabs can be directed against a variety of threats. This approach has its limitations. Most notably, after 40 years there are still no effective vaccines against HIV. If a similar retrovirus emerged, we would struggle to contain it. But Covid has shown us what is possible. Never before has the world vaccinated so many people as it did in 2021. As Larry Brilliant, the American epidemiologist who helped eradicate smallpox, said in 2014: “Outbreaks are inevitable, but pandemics are optional.” What did we learn from Covid? Do facemasks work? In March 2020 England’s deputy chief medical officer, Jenny Harries, advised the public that wearing face coverings was “not a good idea”. Doing so could “actually trap the virus in the mask”. By June there had been a u-turn. Masks were not only a good idea but we would be fined if we did not use them on public transport, in shops and health premises. And now? The respected Cochrane Review recently concluded that masks “probably make little or no difference” to Covid outcomes. But this says more about the quality of the evidence than masks themselves. It is likely that face coverings reduce the risk of transmission to some degree — and other studies have found that N95-type respirators are far more effective than cloth coverings or surgical masks — but we still do not know by how much. Antiviral hygiene In the spring of 2020, hygiene advice went into overdrive. People started worrying whether parcels delivered to their homes might be contaminated with coronavirus. Clothing retailers were told to quarantine returned items for 48 hours. But scientists later concluded that inanimate objects were unlikely to play any meaningful role in the spread of Covid. While microscopic flecks of virus might linger on surfaces for a few days, there was little risk they could be transferred into someone’s lungs. Instead, the virus is spread in tiny aerosol droplets that can stay aloft for hours. Opening a window or two, rather than doing a deep clean, could make all the difference. Infected people spread viral particles when they talk, breathe, cough or sneeze. Social distancing works: exposure to such particles is reduced by between two and 10 times if people are 2m apart compared with 1m. What about handwashing? Handwashing is still advisable because of our inescapable habit of putting our hands to our face. The Cochrane Review found good hand hygiene cuts the risk of Covid and other acute respiratory infections by 14 per cent. It did not venture a conclusion on the impact of singing Happy Birthday while doing so. Written by: Ben Spencer © The Times of London Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","description":"Times: Covid-19 was this era’s Disease X. What will be the next?","id":"d086038b-0043-45f5-a83b-e7ab9ce64518","image_url":"https://www.nzherald.co.nz/resizer/lD2u8dHj4PtPKI4uXbW0RHzvwwI=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/AZNGWYJ5PRG3HAM7X3XMW5B2OI.jpg","link":"https://www.nzherald.co.nz/world/disease-x-is-coming-are-we-ready-for-the-next-pandemic/GXNVC4KL3ZEZPAJWRCIG2YZ6WY/","pubDate":"2023-03-23 16:00:00","title":"Disease X is coming. Are we ready for the next pandemic?"},{"content":"Britain’s parliament will block TikTok on all devices on its network following a similar ban on government devices, becoming the latest Western institution to bar the Chinese-owned video app over security concerns. “Following the government’s decision to ban TikTok from government devices, the commissions of both the House of Commons and Lords have decided that TikTok will be blocked from all parliamentary devices and the wider parliamentary network,” a parliament spokesperson said. Britain last week banned the Chinese-owned video app on government phones. “Cyber security is a top priority for parliament,” the spokesperson added. The United States, Canada, Belgium and the European Commission have already banned the app from official devices. TikTok has come under increasing scrutiny due to fears that user data from the app owned by Beijing-based company ByteDance could end up in the hands of the Chinese government, undermining Western security interests. The British parliament’s ban was announced as TikTok’s chief executive faced questions from U.S. lawmakers who are convinced the app should be barred for being a potential national security threat to the United States.","description":"Britain’s parliament will block TikTok on all devices on its network following a similar ban on government devices, becoming the latest Western institution to bar the Chinese-owned video app over security concerns. “Following the government’s decision to ban TikTok from government devices, the commissions of both the House of Commons...","id":"382f741d-bf4a-4c56-861a-2b60944eeb3b","link":"https://cyprus-mail.com/2023/03/23/british-parliament-blocks-tiktok-over-security-concerns/","pubDate":"2023-03-23 15:30:01","title":"British parliament blocks TikTok over security concerns"},{"content":"The Turkish parliament’s foreign affairs commission approved a bill ratifying Finland’s bid to join NATO, state broadcaster TRT Haber reported on Thursday, effectively taking Helsinki another step toward membership of the trans-Atlantic pact. Parliament’s general assembly still needs to approve the bill and is expected to do so before it closes in mid-April, ahead of parliamentary and presidential elections on May 14. President Tayyip Erdogan said last week during a visit by his Finnish counterpart Sauli Niinisto to Turkey that parliament would ratify Helsinki’s accession to NATO. But Erdogan held off approving the NATO membership bid of Sweden, which Ankara says has not gone far enough in cracking down on people Turkey considers terrorists. The three countries signed a pact on the issue last year. Finland and Sweden applied to join NATO after Russia invaded Ukraine in February last year. The parliaments of all 30 NATO members must ratify newcomers. Apart from Hungary, whose ruling party has said it backs the two Nordic bids but which has delayed formal steps to approve them, Turkey is the only NATO member that has not yet given the green light. Finland’s membership would represent the first enlargement since North Macedonia joined the alliance in 2020.","description":"The Turkish parliament’s foreign affairs commission approved a bill ratifying Finland’s bid to join NATO, state broadcaster TRT Haber reported on Thursday, effectively taking Helsinki another step toward membership of the trans-Atlantic pact. Parliament’s general assembly still needs to approve the bill and is expected to do so before it...","id":"863149b3-ee44-494a-b19f-65a074244782","link":"https://cyprus-mail.com/2023/03/23/turkish-parliamentary-commission-approves-finlands-nato-bid/","pubDate":"2023-03-23 15:17:30","title":"Turkish parliamentary commission approves Finland’s NATO bid"},{"title":"Why Kurds are the biggest beneficiaries 20 years after Iraq War","link":"https://www.csmonitor.com/World/Middle-East/2023/0323/Why-Kurds-are-the-biggest-beneficiaries-20-years-after-Iraq-War?icid=rss","description":"Irbil, a Kurdish city in northern Iraq, has transformed in the past 20 years with wide U.S.-style highways lined with fast-food restaurants and real estate offices. The conflict between the U.S. and Baghdad benefitted the Kurds more than anyone else.","content":"Complexes of McMansions, fast-food restaurants, real estate offices, and half-constructed high-rises line wide highways in Irbil, the seat of the semi-autonomous Kurdish region in northern Iraq.\n\nMany members of the political and business elite live in a suburban gated community dubbed the American Village, where homes sell for as much as $5 million, with lush gardens consuming more than a million liters of water a day in the summer.\n\nThe visible opulence is a far cry from 20 years ago. Back then, Irbil was a backwater provincial capital without even an airport.\n\nThat rapidly changed after the 2003 U.S.-led invasion of Iraq that toppled Saddam Hussein. Analysts say that Iraqi Kurds – and particularly the Kurdish political class – were the biggest beneficiaries in a conflict that had few winners.\n\nThat’s despite the fact that for ordinary Kurds, the benefits of the new order have been tempered by corruption and power struggles between the two major Kurdish parties and between Irbil and Baghdad, the Iraqi capital.\n\nIn the wake of the invasion, much of Iraq fell into chaos, as occupying American forces fought an insurgency and as multiple political and sectarian communities vied to fill the power vacuum left in Baghdad. But the Kurds, seen as staunch allies of the Americans, strengthened their political position and courted foreign investments.\n\nIrbil quickly grew into an oil-fueled boom town. Two years later, in 2005, the city opened a new commercial airport, constructed with Turkish funds, and followed a few years after that by an expanded international airport.\n\nTraditionally, the “Kurdish narrative is one of victimhood and one of grievances,” said Bilal Wahab, a fellow at the Washington Institute think tank. But in Iraq since 2003, “that is not the Kurdish story. The story is one of power and empowerment.”\n\nWith the Ottoman Empire’s collapse after World War I, the Kurds were promised an independent homeland in the 1920 Treaty of Sevres. But the treaty was never ratified, and “Kurdistan” was carved up. Since then, there have been Kurdish rebellions in Iran, Iraq, and Turkey, while in Syria, Kurds have clashed with Turkish-backed forces.\n\nIn Iraq, the Kurdish region won de facto self-rule in 1991, when the United States imposed a no-fly zone over it in response to Saddam’s brutal repression of Kurdish uprisings.\n\n“We had built our own institutions, the parliament, the government,” said Hoshyar Zebari, a top official with the Kurdistan Democratic Party who served as foreign minister in Iraq’s first post-Saddam government. “Also, we had our own civil war. But we overcame that,” he said, referring to fighting between rival Kurdish factions in the mid-1990s.\n\nSpeaking in an interview at his palatial home in Masif, a former resort town in the mountains above Irbil that is now home to much of the KDP leadership, Mr, Zabari added, “The regime change in Baghdad has brought a lot of benefits to this region.”\n\nIraqi President Abdul Latif Rashid, from the rival Patriotic Union of Kurdistan, also gave a glowing assessment of the post-2003 developments. The Kurds, he said, had aimed for “a democratic Iraq, and at the same time some sort of … self-determination for the Kurdish people.”\n\nWith the U.S. overthrow of Saddam, he said, “We achieved that. ... We became a strong group in Baghdad.”\n\nThe post-invasion constitution codified the Kurdish region’s semi-independent status, while an informal power-sharing arrangement now stipulates that Iraq’s president is always a Kurd, the prime minister a Shiite, and the parliament speaker a Sunni.\n\nBut even in the Kurdish region, the legacy of the invasion is complicated. The two major Kurdish parties have jockeyed for power, while Irbil and Baghdad have been at odds over territory and the sharing of oil revenues.\n\nMeanwhile, Arabs in the Kurdish region and minorities, including the Turkmen and Yazidis, feel sidelined in the new order, as do Kurds without ties to one of the two key parties that serve as gatekeepers to opportunities in the Kurdish region.\n\nAs the economic boom has stagnated in recent years, due to both domestic issues and global economic trends, an increasing number of Kurdish youths are leaving the country in search of better opportunities. According to the International Labor Organization, 19.2% of men and 38% of women aged 15-24 were unemployed and out of school in Irbil province in 2021.\n\nMr. Wahab said Irbil’s post-2003 economic success has also been qualified by widespread waste and patronage in the public sector.\n\n“The corruption in the system is really undermining the potential,” he said.\n\nIn Kirkuk, an oil-rich city inhabited by a mixed population of Kurds, Turkmen, and Sunni Arabs where Baghdad and Irbil have vied for control, Kahtan Vendavi, local head of the Iraqi Turkmen Front party, complained that the American forces’ “support was very clear for the Kurdish parties” after the 2003 invasion.\n\nTurkmen are the third largest ethnic group in Iraq, with an estimated 3 million people, but hold no high government positions and only a handful of parliamentary seats.\n\nIn Kirkuk, the Americans “appointed a governor of Kurdish nationality to manage the province. Important departments and security agencies were handed over to Kurdish parties,” Mr. Vendavi said.\n\nSome Kurdish groups also lost out in the post-2003 order, which consolidated the power of the two major parties.\n\nAli Bapir, head of the Kurdistan Justice Group, a Kurdish Islamist party, said the two ruling parties “treat people who do not belong to [them] as third- and fourth-class citizens.”\n\nMr. Bapir has other reasons to resent the U.S. incursion. Although he had fought against the rule of Saddam’s Baath Party, the U.S. forces who arrived in 2003 accused him and his party of ties to extremist groups. Soon after the invasion, the U.S. bombed his party’s compound and then arrested Bapir, and imprisoned him for two years.\n\nKurds not involved in the political sphere have other, mainly economic, concerns.\n\nPicnicking with her mother and sister and a pair of friends at the sprawling Sami Abdul Rahman Park, built on what was once a military base under Saddam, Tara Chalabi acknowledged that the “security and safety situation is excellent here.”\n\nBut she ticked off a list of other grievances, including high unemployment, the end of subsidies from the regional government for heating fuel, and frequent delays and cuts in the salaries of public employees like her.\n\n“Now there is uncertainty if they will pay this month,” she said.\n\nNearby, a group of university students said they are hoping to emigrate.\n\n“Working hard, before, was enough for you to succeed in life,” said a woman who gave only her first name, Gala. “If you studied well and you got good grades … you would have a good opportunity, a good job. But now it’s very different. You must have connections.”\n\nIn 2021, hundreds of Iraqi Kurds rushed to Belarus in hopes of crossing into Poland or other neighboring EU countries. Belarus at the time was readily handing out tourist visas in an apparent attempt to pressure the European Union by creating a wave of migrants.\n\nThose who went, Mr. Wahab said, were from the middle class, able to afford plane tickets and smuggler fees.\n\nGet stories that\n\nempower and uplift daily. By signing up, you agree to our Privacy Policy Already a subscriber? Log in to hide ads.\n\n“To me, it’s a sign that it’s not about poverty,” he said. “It’s basically about the younger generation of Kurds who don’t really see a future for themselves in this region anymore.”\n\nThis story was reported by The Associated Press.","pubDate":"2023-03-23 15:16:35","image_url":"https://images.csmonitor.com/csm/2023/03/1153451_1_032323-Iraq-war-Kurds_standard.jpg?alias=standard_900x600","id":"e9f85982-b8b8-4254-a908-7a5092cce266"},{"content":"LONDON: A judge in the UK on Wednesday launched an independent probe into allegations of dozens summary killings by British troops in Afghanistan.\n\nSpeaking to reporters in London, Lord Justice Haddon-Cave, the chair of the inquiry, issued a call for anyone with evidence to come forward.\n\nIt is “critical” that those who have violated the law be referred to authorities “for the reputation of the armed forces and the country,” he said, referring to “extremely serious” allegations of more than 50 summary killings by the British Special Air Service (SAS) soldiers in Afghanistan.\n\n“Either the allegations are untrue, or if some of them are true then the military and the country can hold its head high and say we have looked into these properly and thoroughly. It’s about, ultimately, reputation,” Haddon-Cave said.\n\nLast December, Britain’s Defense Ministry ordered an independent inquiry after a BBC TV documentary reported that soldiers from SAS had killed dozens of people during raids carried out by one SAS squadron in Helmand in 2010-11.\n\n“I would urge anyone, who has got any information or material, which they think may be relevant to the inquiry, to please get in touch with the inquiry team as soon as possible,” Haddon-Cave said.","description":"LONDON: A judge in the UK on Wednesday launched an independent probe into allegations of dozens summary killings by British troops in Afghanistan. Speaking to reporters in London, Lord Justice Haddon-Cave, the chair of the inquiry, issued a call for anyone with evidence to come forward. It is “critical” that those who have violated the law […]","id":"c86c318e-5128-48ac-86ad-dfcb400b5d88","image_url":"https://www.pakistantoday.com.pk/wp-content/uploads/2023/03/UK-troops.jpg","link":"https://www.pakistantoday.com.pk/2023/03/23/uk-probes-troops-alleged-extrajudicial-killings-in-afghanistan/","pubDate":"2023-03-23 15:14:07","title":"UK probes troops’ alleged extrajudicial killings in Afghanistan"},{"content":"AHMEDABAD: An Indian court Thursday found opposition leader Rahul Gandhi guilty of defamation for a three-year-old campaign trail remark implying that Prime Minister Narendra Modi was a criminal.\n\nModi’s government has been widely accused of using the law to target and silence critics, and the case in the premier’s home state of Gujarat is one of several lodged against his chief opponent in recent years.\n\nGandhi, the leading face of the opposition Congress party, was sentenced to two years imprisonment but immediately granted bail after his lawyers announced their intention to appeal.\n\nThe case stemmed from a remark made during the 2019 election campaign in which the 52-year-old had asked why “all thieves have Modi as (their) common surname”.\n\nHis comments were seen as a slur against the prime minister, who went on to win the election in a landslide, and those sharing his surname.\n\nGandhi’s lawyer B. M. Mangukiya said his client had not meant to insult anyone.\n\n“When the magistrate asked Gandhi what he had to say in his defence, the Congress leader said that he was fighting to expose corruption in the country,” Mangukiya told reporters outside the court.\n\n“His comments were not meant to hurt or insult any community.”\n\nGandhi is the son, grandson and great-grandson of a dynasty of former Indian prime ministers, beginning with independence leader Jawaharlal Nehru.\n\nBut the scion of India’s most famous political dynasty has struggled to challenge the electoral juggernaut of Modi and its nationalist appeals to the country’s Hindu majority.\n\nHis Congress party, a once-mighty force with a proud role in ending British colonial rule 75 years ago, is now a shadow of its former self after two landslide election defeats with Gandhi at the helm.\n\nGandhi, who was present in court in Surat for the verdict, was greeted by supporters on his arrival. He faces at least two other defamation cases elsewhere in the country.\n\nGandhi is also on bail in another money laundering case that has been snaking its way through India’s glacial legal system for more than a decade. He denies any financial impropriety.","description":"AHMEDABAD: An Indian court Thursday found opposition leader Rahul Gandhi guilty of defamation for a three-year-old campaign trail remark implying that Prime Minister Narendra Modi was a criminal. Modi’s government has been widely accused of using the law to target and silence critics, and the case in the premier’s home state of Gujarat is one […]","id":"e0637d7d-6d7e-4af6-9aed-dc2d1363e343","image_url":"https://www.pakistantoday.com.pk/wp-content/uploads/2023/03/Rahul-Gandhi.jpeg","link":"https://www.pakistantoday.com.pk/2023/03/23/indias-rahul-gandhi-found-guilty-of-defamation-over-modi-remark/","pubDate":"2023-03-23 15:12:22","title":"India’s Rahul Gandhi found guilty of defamation over Modi remark"},{"content":"The Chinese People’s Liberation Army (PLA) expelled a US destroyer when the latter trespassed into Chinese territorial waters off the Xisha Islands in the South China Sea on Thursday amid continued US attempts to destabilize the region.\n\nWithout authorization from the Chinese government, guided missile destroyer the USS Milius on Thursday made an illegal intrusion into Chinese territorial waters off the Xisha Islands, sabotaging the peace and stability in the South China Sea, Senior Colonel Tian Junli, a spokesperson at the PLA Southern Theater Command, said in a press release on the day.\n\nThe PLA Southern Theater Command organized naval and air forces, tracked, monitored and warned away the US warship in accordance with the law, Tian said.\n\nCommand troops will stay on high vigilance at all times and take all necessary measures to resolutely safeguard national sovereignty, security as well as peace and stability in the South China Sea, the spokesperson said.\n\nLaunching an immediate response, the PLA displayed that it is ready at all times to counter foreign provocations, including those from the US, Song Zhongping, a Chinese military expert and TV commentator, told the Global Times on Thursday.\n\nThe US has been ramping up provocations on China’s doorstep, attempting to conduct close-in reconnaissance on China and to deny China of its sovereignty and jurisdiction over the Xisha and Nansha islands, showing US military presence and hegemony in the South China Sea, Song said.\n\nBut the PLA will not give an inch when it comes to territorial integrity, Song added.\n\nIn late February, a US P-8A spy plane took a group of US reporters on a close-in reconnaissance operation over the South China Sea, during which it was warned away by a PLA fighter jet when it came close to Chinese airspace around the Xisha Islands.\n\nThis latest US warship trespass and the P-8A media tour are a combo move aimed at hyping “China threat” in the South China Sea and throwing mud at China, Song said.\n\nFrom a military point of view, these types of close-in reconnaissance operations are also carried out under a tactical consideration in preparation for potential military conflict, the expert warned.\n\nThe world should see clearly that the US is the real trouble maker in the South China Sea, multiple observers noted.","description":"The Chinese People’s Liberation Army (PLA) expelled a US destroyer when the latter trespassed into Chinese territorial waters off the Xisha Islands in the South China Sea on Thursday amid continued US attempts to destabilize the region. Without authorization from the Chinese government, guided missile destroyer the USS Milius on Thursday made an illegal intrusion into Chinese […]","id":"74f3d30c-6f7c-4542-96b6-d791a973a788","image_url":"https://www.pakistantoday.com.pk/wp-content/uploads/2023/03/J-10s-e1679583435535.jpeg","link":"https://www.pakistantoday.com.pk/2023/03/23/south-china-sea-pla-expels-us-destroyer-trespassing-chinese-waters/","pubDate":"2023-03-23 14:57:22","title":"South China Sea: PLA ‘expels’ US destroyer trespassing Chinese waters"},{"content":"A 28-year-old man was remanded in custody on Thursday accused of attempting to murder two elderly men who were set on fire shortly after leaving mosques in the UK.\n\nMohammed Abbkr, 28, from Edgbaston in Birmingham, central England, was placed in custody by the city's magistrates court following the attacks last month and earlier this week.\n\nPolice arrested him on Tuesday following an investigation also involving counter-terrorism police.\n\nAbbkr, originally from Sudan, will next appear at Birmingham Crown Court on April 20.\n\nHis lawyer appeared in court via a video-link, but gave no indication of how his client will plead and made no bail application.\n\nAbbkr allegedly sprayed a substance on the two men outside or near mosques they had attended and then set them alight, in west London on February 27 and Birmingham on Monday.\n\nThe victim in the attack in the British capital, 82-year-old Hashi Odowa, was treated for severe burns to his face and arms.\n\nThe perpetrator spoke to him before dousing him in what is believed to be petrol and setting him on fire, according to police.\n\nIn the Birmingham attack, Mohammed Rayaz, 70, was set on fire as he walked home from a mosque in Edgbaston on Monday evening.\n\nHe remains in hospital with severe injuries.\n\nPolice are appealing for video footage to help the investigation.","description":"Naharnet is the leading Lebanese news destination, breaking the news as it happens!","id":"13a41d9b-99c0-45aa-aa7e-7135eec39d05","image_url":"http://images3.naharnet.com/images/253495/w140.jpg?1679583368","link":"https://www.naharnet.com/stories/en/296485-man-accused-of-attacks-near-uk-mosques-held-in-custody","pubDate":"2023-03-23 14:56:43","title":"Man accused of attacks near UK mosques held in custody"},{"content":"A top Ukrainian commander on Thursday threatened an impending counterattack against Russian forces in the frontline town of Bakhmut as President Volodymyr Zelensky visited Kherson, still partially controlled by Russia.\n\nOleksandr Syrsky, commander of Ukraine's ground forces, said Russian troops were \"exhausted\" near Bakhmut, the scene of the longest and bloodiest battle since the Russian invasion last year.\n\nBakhmut -- an eastern town which once had an estimated population of around 70,000 people -- has virtually emptied of civilians over months of fierce fighting between Russian and Ukrainian forces.\n\n\"The aggressor has not given up hope of taking Bakhmut at all costs despite losses in manpower and equipment,\" said Syrsky.\n\n\"Sparing nothing, they are losing significant strength and becoming exhausted.\n\n\"Very soon we will take advantage of this opportunity, like we did near Kyiv, Kharkiv, Balakliya and Kupiansk,\" he added, referring to successful Ukrainian counteroffensives last year.\n\nKyiv considers Bakhmut key to holding back Russian forces along the entire eastern front.\n\nBoth sides have invested heavily in the fight, even though analysts say the city has little strategic value.\n\nThe head of Russia's Wagner mercenary group said this week that his forces were in control of around 70 percent of the city. A Russian aide in the wider Donetsk region has said the city was \"practically surrounded\".\n\nZelensky on Wednesday recognized troops had a \"difficult\" task as he visited the eastern front near Bakhmut.\n\n- 'Returning' to Kherson -\n\nOn Thursday, he said he was on a \"working trip to Kherson region\" -- the southern region still partly controlled by the Russians, who are dug in on the eastern bank of the Dnipro river and routinely shell Kherson city, killing civilians.\n\nUkrainian forces recaptured Kherson city, the administrative center of the southern region, last November following a strategic withdrawal of Russian forces.\n\nZelensky said his visit included one village where \"houses and civilian infrastructural facilities were damaged\" as a result of Russia's invasion.\n\nHe said local authorities were restoring essential services like electricity and water in the village and rebuilding a medical center.\n\n\"People are returning,\" he said in the post on social media Thursday.\n\n\"I talked to the locals about their problems and needs,\" he added.\n\nKherson, a gateway to the Black Sea and the Sea of Azov, was captured easily and early by Russian forces in the early days of their February 2022 invasion.\n\nRussian President Vladimir Putin claimed to have annexed Kherson and three other regions in Ukraine last September, despite not having full military control over any of them.\n\nZelensky, in a separate post, said he held a coordination meeting with officials and discussed de-mining and reconstruction in recaptured territory.\n\nThe head of Kherson's regional military administration, Oleksandr Prokudin, said Russian forces had killed one person and wounded two others over the last 24 hours.","description":"Naharnet is the leading Lebanese news destination, breaking the news as it happens!","id":"66de98fe-d285-4fa1-9aea-67280406823c","image_url":"http://images1.naharnet.com/images/253490/w140.jpg?1679583029","link":"https://www.naharnet.com/stories/en/296481-kyiv-threatens-bakhmut-counterattack-as-zelensky-visits-kherson","pubDate":"2023-03-23 14:50:36","title":"Kyiv threatens Bakhmut counterattack as Zelensky visits Kherson"},{"content":"0 SHARES Share Tweet\n\nNAIROBI, Kenya, Mar 23 – Azimio La Umoja One Kenya has dismissed calls by a section of the clergy to call off the coalition’s demonstrations and instead focus on dialogue.\n\nThe party leader Raila Odinga defended the protests saying they are aimed at seeking for the truth which is espoused in the Bible.\n\nQuoting John 8:2 in the bible, Odinga insisted that the demonstrations are aimed at agitating for the truth of what unfolded in the August 9 general election.\n\n“We want the truth by opening of the servers to allow for a forensic audit of the election results. We want tangible action to lower the cost of living,” he said.\n\n“We are want the reconstitution of the IEBC to be stopped and the reinstatement of IEBC commissioners and the ending of trivialization when it comes to appointments,” Odinga added.\n\nThe Opposition Leader reiterated that they are not interested in a handshake with President William Ruto as alluded by his close allies.\n\nOdinga emphasized that he cannot engage in a truce with a government which he termed as “illegitimate”.\n\n“This is an insult to the intelligence of Kenyans.We cannot and we will not participate in a handshake with an illegitimate regime, “he said.\n\nThe Kenya Conference of Catholic Bishops (KCCB) has asked President William Ruto to engage Azimio leader Raila Odinga in a dialogue to resolve the standoff for the sake of the country’s peace.\n\nAdvertisement. Scroll to continue reading.\n\nThe truce between the two leaders, they stated, will avert attempts to plunge the country into the risk of violence that will cripple the nation.\n\nThe bishops who opposed Odinga’s call for mass action urged the former premier to avoid the route of demonstrations that saying dialogue is the best avenue to resolve their differences.\n\n“We believe that dialogue can resolve this dangerous standoff. The two need to establish a common ground to address the ills facing the country and restore sanity we need in our country,” said Archbishop Martin Kivuva.\n\n“We plead and ask our President to follow through with his promise to sit with and listen to Mr Odinga and other leaders and come out with reasonable proposals to address the main plights in our country. We also invite Mr Odinga to accept dialogue for the good of the country,” added the KCCB Chairperson.","description":"NAIROBI, Kenya, Mar 23 - Azimio La Umoja One Kenya has dismissed calls by a section of the clergy to call off the coalition's demonstrations and instead - Kenya breaking news | Kenya news today | Capitalfm.co.ke","id":"8efe9111-21d7-4860-abf8-40963e615a4d","image_url":"https://www.capitalfm.co.ke/news/files/2022/09/Raila-ODM-1-e1679581692599.jpg","link":"https://www.capitalfm.co.ke/news/2023/03/raila-dismisses-call-by-clergy-for-dialogue-following-azimio-protests/","pubDate":"2023-03-23 14:28:50","title":"Raila dismisses call by clergy for dialogue following Azimio protests"},{"content":"0 SHARES Share Tweet\n\nNAIROBI, Kenya, Mar 23 – Azimio La Umoja One Kenya Leader Raila Odinga has castigated the Communications Authority of Kenya for faulting media houses on the coverage of Azimio demonstrations.\n\nAddressing journalists on Thursday at his private office in Capitol Hill, Odinga indicated that the statement by CAK Director General Ezra Chiloba was aimed at gagging the media.\n\nOn Wednesday, Chiloba faulted six media houses saying they violated the regulator’s set standards in their live coverage of the Azimio-led protests on Monday.\n\n“The statement by Ezra Chiloba is meant to censor the media and gag media professionals,” Raila stated.\n\nOdinga bashed President William Ruto’s administration saying the move to ensure total blackout during the Azimio protest is a dictatorial stand.\n\n“We agree with other democracies that democracy dies in darkness. This action by President Ruto is opening the full dictator playbook,” he said.\n\nThe Azimio La Umoja One Kenya Coalition insisted that they will not allow President Ruto to claw back the gains enshrined in the 2010 constitution.\n\n“In Azimio La Umoja,we will not allow President William Ruto to send us to dark days of yesterday,”Odinga stated.\n\nIn a statement, the CA Director-General Ezra Chiloba had claimed that six TV stations including NTV, Citizen, K24, KBC, TV47 and Ebru Africa depicted scenes that could cause panic or incitement to the public and threaten peace in the country.\n\nAdvertisement. Scroll to continue reading.\n\nHe asked all broadcasters to ensure compliance adding that it was imperative all broadcasters exercise caution in live broadcast coverage to avoid scenes that would be detrimental to peace and cohesion.\n\n“Take note that failure to adhere to the outlined obligations shall be acting in breach of license conditions, which shall attract liability under relevant provisions of the law including revocation of broadcast license or/and broadcast frequencies,” said Chiloba","description":"NAIROBI, Kenya, Mar 23 - Azimio La Umoja One Kenya Leader Raila Odinga has castigated the Communications Authority of Kenya for faulting media houses on - Kenya breaking news | Kenya news today | Capitalfm.co.ke","id":"bc23e4c5-0afa-490f-8f56-1f3729699bee","image_url":"https://www.capitalfm.co.ke/news/files/2022/09/RAILA-ODINGA-ORANGE-TIE.jpg","link":"https://www.capitalfm.co.ke/news/2023/03/raila-says-chilobas-statement-on-tv-stations-aimed-at-gagging-media/","pubDate":"2023-03-23 13:11:29","title":"Raila says Chiloba’s statement on TV stations aimed at gagging media"}]